{
    "items": {
        "5418477_0037": {
            "codes": [
                "ia1a",
                "iiic",
                "iiih"
            ],
            "content": [
                "Methodist Episcopal Church extends helping hand to Shkipetars (Albanians) in educational endeavor.",
                "PROF. JONES PRAISES ALBANIANS.",
                "p. 1.- The Albanian government has appealed to the Methodist Episcopal Church of America to undertake the establishment of an American college in Albania. Bishop Blake answered the call of Albania and sent to that country Prof. Elmer E. Jones, director of the School of Education of North-western University of Evanston, to investigate educational conditions and future possibilities.",
                "Prof. Jones spent three months in Albania last summer visiting all the important cities and towns and studying the archaic characteristics and the national customs of the Albanian people. He returned to Evanston a few weeks ago and in his extensive report to the Board of Foreign Missions of the Methodist Episcopal Church of America strongly recommends the establishment of the American college in Albania.",
                "\"The Albanians are eager for education,\" says Prof. Jones, \"and anything American is cherished by them. I was royally welcomed by them everywhere, and the people showed great appreciation of my interest in their educational welfare. Officers of the government and mayors of various towns came out many miles to meet me and escort me to their respective towns. The people swarmed around me, and I was bored with kindness shown me. The hospitality of the Shkipetars, as the Albanians call themselves, is beyond comparison.",
                "\"I sat at banquets with them from early evening till midnight almost everyday and I had a very pleasant time with them.",
                "\"While in Tirana I had daily conferences with the leaders of the government. They were enthusiastic at my proposition and promised me every possible assistance to make the American college a success. The Albanian government is willing to offer suitable buildings for the college and will place at our disposal large tracts of land for agricultural experimental purposes such as we may need. Albania is an undeveloped country but with very rich resources. The land in the plains is very productive and the mountains provide excellent pasture for the sheep and goats. Every family in the country keeps a certain number of sheep and goats, and there is a possibility for the development of the wool industry.",
                "\"The enthusiasm of the Albanian children amazed me when I visited them in their schools. They amused me with their beautiful songs which they sang everywhere I went. But the condition of the schools in many towns is appalling and books are scarce. It seems to me as though Albania is clamoring for education with outstretched hands toward America, and I have promised to the Albanians American assistance in their educational development.",
                "\"When the Albanian boys hear that we have a college at Valona they will climb up the mountains and come to it. Education has been utterly neglected in Albania in the past on account of the political animosity that has been prevalent in the Balkans, and Albanians who sought education were compelled to study foreign languages because their own language was prohibited by the Ottoman government, which ruled the country for four centuries, and anathematized by the Greek Orthodox Church. Notwithstanding the Turkish government, the Greek clergy was a dominant authority in the political affairs of Albania. Fortunately, both Turkey and Greece lost their political game in Albania, because since 1912 political authority is in the hands of the Albanians themselves who have proved their ability to run the government.",
                "\"The Christian Albanians just lately severed their allegiance to the Greek Church and declared the Albanian Church independent.\""
            ],
            "dateFull": "1922-01-02",
            "dateText": "Jan. 2, 1922",
            "dateYear": "1922",
            "groups": [
                "albanian"
            ],
            "id": "5418477_0037",
            "title": "The Albanian College for Albania Next Summer.",
            "topTitle": "The Albanian Journal"
        },
        "5418477_0042": {
            "codes": [
                "ic",
                "iiih",
                "ia1a"
            ],
            "content": [
                "Albanian's tobacco monopoly, recently held by the British, has not been extended and is open to American interests. American business men will sail from New York, June 2nd, with Professor Elmer E. Jones and a group of Albanians, for a tour of Albania."
            ],
            "dateFull": "1923-04-10",
            "dateText": "April 10, 1923",
            "dateYear": "1923",
            "groups": [
                "albanian"
            ],
            "id": "5418477_0042",
            "title": "The Albanian Journal",
            "topTitle": ""
        },
        "5418477_0044": {
            "codes": [
                "iib1a",
                "iib1c",
                "ib3b",
                "ia1a"
            ],
            "content": [
                "The talent and intellectual achievement of the Albanian race are always to be praised, because they not only honor the talented person and his parents; they honor all Albanians.",
                "Young Miss Kristina Nikolla, daughter of Pando and Urani Nikolla of Pogradeci, who has been taking violin lessons for a short time from the famous German professor, Nicholas Frazen, revealed extraordinary talent and ability in a program in which she participated at Professor Frazen's studio. She played Beethoven's \"Minuet in G,\" and made a good impression for one of her age. In addition, Kristina took part in a concert and dramatic program presented by the Voisava Society, an organization of Chicago Albanian women, in which she played a violin solo before a large gathering of Albanians. She was enthusiastically applauded.",
                "The parents of this girl are to be praised, because the duty of bringing up and educating the children falls on the parents, who should do everything in their power to encourage the children in their studies and in anything else that contributes to the welfare of the child. In addition, the parents should urge their children to learn the Albanian language, if they wish to preserve the traditions of their forefathers."
            ],
            "dateFull": "1934-06-16",
            "dateText": "June 16, 1934",
            "dateYear": "1934",
            "groups": [
                "albanian"
            ],
            "id": "5418477_0044",
            "title": "The Talent of the Albanian Race",
            "topTitle": "The Albanian Messenger"
        },
        "5418477_0047": {
            "codes": [
                "iib1c",
                "iv"
            ],
            "content": [
                "co-operation in everything that pertained to Albanian Day.",
                "Your program reached a high standard of entertainment, and you are to be congratulated, with your committee, upon its presentation.",
                "By this time, you have received the medal of A Century of Progress from President Rufus C. Dawes. It is our tangible appreciation of your successful effort.",
                "Thank you again for your help.",
                "Yours sincerely,",
                "A CENTURY OF PROGRESS",
                "J. V. Houghteling, Supervisor of Nationality Events."
            ],
            "dateFull": "1935-01-17",
            "dateText": "January. 17, 1935",
            "dateYear": "1935",
            "groups": [
                "albanian"
            ],
            "id": "5418477_0047",
            "title": "The Albanian Messenger",
            "topTitle": ""
        },
        "5418477_0048": {
            "codes": [
                "iib1c",
                "iiih"
            ],
            "content": [
                "Faik Konitza, first Albanian Minister to the United States, greets U. Grant-Smith, first American Minister to Albania, at the Albanian Day celebration in the Court of States at the World's Fair. More than 4,000 Albanians attended the fete."
            ],
            "dateFull": "1934-10-15",
            "dateText": "Oct. 15, 1934",
            "dateYear": "1934",
            "groups": [
                "albanian"
            ],
            "id": "5418477_0048",
            "title": "First Ministers",
            "topTitle": "Chicago Daily Times"
        },
        "5418477_0049": {
            "codes": [
                "iib1c",
                "iv",
                "iib1a",
                "iib1c",
                "iiih"
            ],
            "content": [
                "The Albanian-American Club of Chicago, held on Sunday, Oct. 14th, its national day's festivities at the Century of Progress, with a well prepared and organized program, headed by the most prominent members of the Albanian Community of Chicago, and suburbs. The Chairman of the committees and of events of the day was Christ A. Lepon. Others were Hysen Haxhi Jero, Vice-Chairman; Ahmet Ramo, Sec'y.; Sofokli Stefani, treas.; and Vangjel Grapsi, Christ Skurti, Spiro Johns, Naum Tona, Pano Nikolla, Metre Chomo, Mike Frasheri, and Chas. Michaels.",
                "Woman's Committee: Mrs Evanthi Prifti, Chairman; Mrs. Theofani Stefani, Sec'y.; and Mrs. Artemisi Peters, Mrs. Urania Nikolla, and Limiada Pappas.",
                "Other eminent members of the committee were Messrs. Rapo Zemblaku, Spase Vangjel, and Misto M. Opari, from Gary, Ind.; Haki Chaush, Dilaver Orhan, Alush Emin, and Zenel Sali, from Whiting, Ind., Demir Poloska, Thoma Zoto, and Shyqyr Myrteza from Argo, Ill.",
                "Entertainment--Music: Peter Sutter, Chairman and Tasi Noti, George Sutter, Louis Nick, Pandi Xeka, Sotir Postol, Kristina Nikolla, and Jeanette Vanjel, members of the entertainment committee.",
                "Dancing and Singing--Men: Sotir Tresol, James Miller, Koci Karakosta, Koci Sutter, Alqiviadhi Treslo, Kristo Kolche and Naqo Iskali. Women: Mrs. Evanthi Prifti, Theofana Stefani, Magdhalini Anton, Evangjeli Baze, Limiada Pappas, Theano Peters, Evanthi Dimashi, Urania Nikolla, Marigo Tromara, Gertrude Vangel, Anastasia Thomas and Miss Viki Thomas. Children: Viki Thomas, chairman; Sophie Skurti, Olga Stefani, Trisa Peters, Julia Johns, Olga Shomo, Sophie Pappas, Phiro Thomas, Gust Shomo, Ethel Skurti, Christ Totoni, Anton Lazar, George Peters, Kristina Nikolla, Helen Iskali, and Helen Skurti.",
                "Parade Marshall, James Koburi. Color Guards, Kristo Kolche Naqo Iskali and Vasil Palko.",
                "The Program of the Festivities was as follows: Star Spangled Banner; Albanian National Hymn. Christ A. Lepon will introduce the following people: the President of \"A Century of Progress,\" the Hon. Rufus C. Dawes; Brig. Gen. William E. Horton, retired President of \"Society of American Friends of Albania, 1922-1925. His Excellency, the Hon. Faik Konitza, First Minister from Albania to the United States, will be introduced by the Hon. U. Grant-Smith. \"Miss Albania,\" Julia Peters, will be introduced by Christ Lepon.",
                "Songs (Ladies): \"Chu Mbush Oda Plot Bandille\" (\"Your Chamber Filled With Heroes\"); \"De Bashte Tende Kendon Bilbili\" (\"The Nightingale Sings in Your Garden\"). Dance (Men): \"Devoliche.\" Speaker: Nelo Drizari. Songs: \"Trendafili\" (The Rose). Dance (Ladies): \"Berache,\" \"Ehequr.\" Piano and Violin (Young Girls) Orchestra: \"Eqare\" (Lamento). Speaker: Louis W. Mack. Dance (Men): \"Kasapche\" (Butcher Dance). Gypsy Dance (Young girls). Songs (Men): \"Mahmudie.\" Native Dance: (children). Song (all those on the stage): \"Bilbili\" (\"The Nightingale\").",
                "The event was honored by the presence of the Hon. Quin O'Brien, Corporation Counsel of the City of Chicago, an eloquent speaker, who was the official representative of Mayor Kelly. Mr. O'Brien's speech followed that of the Hon. Rufus C. Dawes.",
                "Mrs. Thelma Marek Cushing, professional artist in violin, singing and dancing, has recently arrived from a trip to Albania to collect material for her career. She spoke briefly on her sojourn in Albania."
            ],
            "dateFull": "1934-10-14",
            "dateText": "Sunday, Oct. 14, 1934",
            "dateYear": "1934",
            "groups": [
                "albanian"
            ],
            "id": "5418477_0049",
            "title": "[Albanian Day at World's Fair]",
            "topTitle": "Program of \"Albanian Day\" at the Century of Progress Presented by the \"Albanian American Club of Chicago,\""
        },
        "5418477_0054": {
            "codes": [
                "iib1c"
            ],
            "content": [
                "This is Albanian Day at the fair, and large groups of celebrants yesterday were converging on Chicago from all sections of the country. Heavy reservations were reported at the hotels."
            ],
            "dateFull": "1934-10-14",
            "dateText": "Oct. 14, 1934",
            "dateYear": "1934",
            "groups": [
                "albanian"
            ],
            "id": "5418477_0054",
            "title": "World's Fair Sets Another Crowd Record",
            "topTitle": "Chicago Herald and Examiner"
        },
        "5418477_0055": {
            "codes": [
                "iib1c",
                "iiih",
                "iv"
            ],
            "content": [
                "Two major programs, both national in character, will entertain Fair visitors today. They are the presentations of the Albanian and the Czechoslovakian groups.",
                "The arrival of the Albanian minister, Faik Konitza, who will make the principal address today, was one of the major events of yesterday's Fair. Reception of the diplomat was unusual, for it was an occasion when minister met minister. The Albanian diplomat is the first minister from his country to the United States. He was greeted on behalf of the Fair by U. Grant-Smith, chief of protocol, who was the first American minister to Albania, serving from 1922 to 1925.",
                "Reception Military Spectacle",
                "Yesterday's reception was a military spectacle with soldiers, sailors and marines from Camp Roosevelt passing in review. A fifteen gun salute was fired in honor of the official party. Accompanying the Albanian minister were Brig. Gen. William E. Horton, U. S. A.; Prof. Nale Drizari, instructor of Albanian languages at Columbia University; Christ A. Lepon, chairman of the Albanian-American club of Chicago, and others.",
                "The official Albanian program will be held this afternoon in the Court of States. Preceding the ceremonies there will be a parade of Albanians in native costumes through the Avenue of Flags."
            ],
            "dateFull": "1934-10-14",
            "dateText": "Oct. 14, 1934",
            "dateYear": "1934",
            "groups": [
                "albanian"
            ],
            "id": "5418477_0055",
            "title": "Two Nations Have Day",
            "topTitle": "Chicago Tribune"
        },
        "5418477_0057": {
            "codes": [
                "iib1c",
                "iiih"
            ],
            "content": [
                "Albania tomorrow will stage one of the outstanding celebrations of national groups held during the 1934 edition of a Century of Progress.",
                "Today, Minister Faik Konitza of Albania was welcomed to the exposition with the fifteen-gun salute reserved for his rank. The minister reviewed troops in front of the Administration Building with Colonel M. M. Keck, Commandant of Camp Franklin D. Roosevelt, and U. Grant-Smith, first United States minister to Albania. Later, President Rufus C. Dawes honored the guest at a reception.",
                "Tomorrow he is to be the principal speaker on the Albanian program in the Court of States, which will be held from 2:30 to 5:30. Several hundred Albanian-American citizens will take part in the program, in native costume. Miss Julia Peters, of 556 North Artesian Avenue, Miss Albania in the recent competition at the fair, will also be a feature of the celebration."
            ],
            "dateFull": "1934-10-13",
            "dateText": "Oct. 13, 1934",
            "dateYear": "1934",
            "groups": [
                "albanian"
            ],
            "id": "5418477_0057",
            "title": "Honor Albanians at Fair Tomorrow",
            "topTitle": "Chicago American"
        },
        "5418477_0058": {
            "codes": [
                "iib1c",
                "iiih"
            ],
            "content": [
                "Faik Konitza, envoy extraordinary and minister plenipotentiary of the Kingdom of Albania, is coming here from Washington to deliver the principal address at the celebration of Albanian Day at the World's Fair tomorrow."
            ],
            "dateFull": "1934-10-13",
            "dateText": "Oct. 13, 1934",
            "dateYear": "1934",
            "groups": [
                "albanian"
            ],
            "id": "5418477_0058",
            "title": "To Speak at Fair",
            "topTitle": "Chicago Daily News"
        },
        "5418477_0059": {
            "codes": [
                "iib1c"
            ],
            "content": [
                "The committee on preparations for Albanian Day decided, at the meeting held August 26, to print a program for the event. Advertisements or announcements will be solicited from Albanian businessmen and others. This souvenir program will be distributed free of charge."
            ],
            "dateFull": "1934-09-14",
            "dateText": "Sept. 14, 1934",
            "dateYear": "1934",
            "groups": [
                "albanian"
            ],
            "id": "5418477_0059",
            "title": "Souvenir Program for Albanian Day, October 14, at the Chicago World's Fair",
            "topTitle": "Dielli (The Sun)"
        },
        "5418477_0060": {
            "codes": [
                "iib1c",
                "iiih",
                "iv"
            ],
            "content": [
                "Dear Sisters: Regarding the celebration of Albanian Day at the World's Fair, we request all those who wish to take part in this celebration, whether in dances, in singing, or simply appearing in native costume, to communicate with the committee on arrangements. Send all communications to the secretary of the committee, Mrs. Theofana Stefani, 1153 North Franklin Street, Chicago, Illinois.",
                "Evanthi Prifti, president,",
                "Theofana Stefani, secretary."
            ],
            "dateFull": "1934-09-14",
            "dateText": "Sept. 14, 1934",
            "dateYear": "1934",
            "groups": [
                "albanian"
            ],
            "id": "5418477_0060",
            "title": "[Appeal By] the Committee of Albanian Women in Chicago",
            "topTitle": "The Albanian Messenger"
        },
        "5418477_0061": {
            "codes": [
                "iib1c",
                "iv"
            ],
            "content": [
                "The Chicago International Exposition opened its doors for 1934 on Saturday, May 26. Over half a million people attended the opening-day ceremonies. Included in this enormous crowd were officials of the State of Illinois, the City of Chicago, the Army, the Police Department, and many other organizations. Twenty-three foreign nations participated in the cermonies, among them Albania, whose delegation led the foreign countries in the parade.",
                "For this representation of Albania, we praise and thank our indefatigable patriot, Christ A. Lepon, who, through hard work and with the assistance of friends, made the required preparations and arrangements within two days, thus securing representation for the Albanian nation. Mr. Lepon is the only patriot who strives to promote nationalistic activities in our colony, and he should be praised at this time, since he has brought honor not only to our colony, but to all Albanians in the United States, and to the Albanian nation as well.",
                "Our nation was represented at this great event by the following young men and women, who were dressed in colorful national costumes: Messrs. Kristo Kolche, Pandi Xeka, Alqiviadhi Treslo, Koci Karakosta, Naqo Iskali; Mrs. Marigo Tromara, Mrs. Theofana Stefani, Mrs. Evanthi Prifti; and Misses Viki Thomas, Julia Peters, and Mary Anton.",
                "The flag of Skanderbeg, with its two-headed eagle, was carried by the zealous patriot Kristo Kolche, accompanied by Viki Thomas; and since all the nations were arranged in the parade in alphabetical order, our flag waved ahead of all the others. The Albanian delegation, and the colorful costumes of Toskeria (South Albania) and Gegeria (North Albania), made the finest of impressions on the spectators. The young men and women who represented our nation at this spectacular event, and who had made every effort to secure the costumes, should be highly praised, not least of all for their endurance in a parade which lasted more than two hours.",
                "After the parade we visited many of the interesting exhibits. Many officials, and others, too, looked with amazement and admiration upon the beautiful costumes of the Albanians, and made inquiries about their origin.",
                "The Exposition will, in the near future, specify a day for us, to be known as Albanian Day. The Albanians must do everything possible on such occasions to honor themselves, their community, and their nation.",
                "Sofokli Stefani.",
                "[Translator's note: This article also appeared in Dielli (The Sun), June 29, 1934.]"
            ],
            "dateFull": "1934-06-28",
            "dateText": "June 28, 1934",
            "dateYear": "1934",
            "groups": [
                "albanian"
            ],
            "id": "5418477_0061",
            "title": "The Chicago International Exposition",
            "topTitle": "The Albanian Messenger"
        },
        "5418477_0065": {
            "codes": [
                "iib2d"
            ],
            "content": [
                "Petro Donushi was elected secretary of The (Albanian) Journal at a directors' meeting on April 26."
            ],
            "dateFull": "1922-05-01",
            "dateText": "May 1, 1922",
            "dateYear": "1922",
            "groups": [
                "albanian"
            ],
            "id": "5418477_0065",
            "title": "Mr. Donuski New Secretary of the Journal",
            "topTitle": "The Albanian Journal"
        },
        "5418477_0067": {
            "codes": [
                "iid1",
                "iib1c",
                "iib1c",
                "iib1a",
                "iv"
            ],
            "content": [
                "The Albanian women's society Viosava celebrated Mother's Day on May 13. The committee on arrangements and the members of the society bent every effort in preparing for the occasion. On Sunday at 2 P. M., a program of music and drama was presented in Oakley Hall that will long be remembered in the Chicago colony.",
                "The program opened with several piano and mandolin selections offered by Viki Thomas, Pandi Xeka, and Sotir Postol. The drama \"Assistance For Those Who Live Abroad\" was presented, the cast consisting of Mrs. Evanthi Prifti, Theofana Stefani, Viki Thomas, and George Peters. Folk dances were offered by Mrs. Evanthi Prifti, Theofana Stefani, Urani Nikolla, Margarita Stefani, Katerina Iskali, and Alexandra Manika, who were dressed in native costumes.",
                "The children sang several folksongs, and a beautiful poem was recited by Miss Olga Stefani, who has shown extraordinary talent on many other occasions. A piano duet was played by the young brothers, Spiro and Tomi Thomas. A beautiful quadrille was presented by Olga Stefani, Trisa Peters, Sofi Papa, Kristaq Totoni, Tomi Thomas, and George Peters. Dhimitri Thomas, Alqiviadhi Treslo, and Koci Karakosta sang a folksong with orchestra accompaniment. Christ A. Lepon, John Adams, Ahmet Ramo, Vasil Papanika, and Peter Demas were the speakers of the day."
            ],
            "dateFull": "1934-06-16",
            "dateText": "June 16, 1934",
            "dateYear": "1934",
            "groups": [
                "albanian"
            ],
            "id": "5418477_0067",
            "title": "(Summary)",
            "topTitle": "The Albanian Messenger"
        },
        "5418477_0069": {
            "codes": [
                "iid1",
                "iiib4",
                "iiih"
            ],
            "content": [
                "p. 4.- The members of Branch 30, Chicago, and the Albanians who desire to become members of the Albanian Federation, Vatra (The Hearth), are notified to be present at the meeting which will be held Sunday, Feb. 26th at German Hall, 814 W. Harrison street, near Halsted street, Room 218.",
                "At the meeting will be discussed many matters of importance which concern every patriotic Albanian. The Albanians of Chicago and suburbs, should be proud to be members of a society like the Federation, Vatra, and those who on account of personal affairs have not had the chance to join the society up to date, should not hesitate to become members of Vatra, as by so doing they will benefit themselves, their family, and their beloved Fatherland.",
                "From the Office of Branch 30, Chicago, Illinois.",
                "Ali Rusi, Branch Secretary."
            ],
            "dateFull": "1928-02-17",
            "dateText": "Feb. 17, 1928",
            "dateYear": "1928",
            "groups": [
                "albanian"
            ],
            "id": "5418477_0069",
            "title": "Important Notice",
            "topTitle": "Dielli (The Sun)"
        },
        "5418477_0070": {
            "codes": [
                "iid1",
                "iiic",
                "iv"
            ],
            "content": [
                "On the occasion of the birthday of Mohammed, the president of Branch 30 of the Albanian federation Vatra (The Hearth) wishes his brother Mohammedans many happy returns of the day.",
                "From the Office of Branch 30, Chicago, Illinois.",
                "Kristo A. Liponi, (Christ A. Lepon), president."
            ],
            "dateFull": "1927-11-22",
            "dateText": "Nov. 22, 1927",
            "dateYear": "1927",
            "groups": [
                "albanian"
            ],
            "id": "5418477_0070",
            "title": "Felicitations",
            "topTitle": "Dielli (The Sun)"
        },
        "5418477_0071": {
            "codes": [
                "iid1",
                "iiih"
            ],
            "content": [
                "p. 2.- We notice in the paper, Dielli (The Sun), that, recently, two new branches were added to the Federation, Vatra. Branch thirty of Chicago is one of the old branches of the Federation, but was corrupted for some time by a few ambitious opponents to its social progress. However, the good patriots of Chicago regardless of the opposition organized the new branch in Chicago. We are confident the officials of that Branch, Liponi (Lepon), Meshgorani, Prifti and other members of the committee, are intelligent, energetic, and patriotic and that through their efforts the branch in that colony will progress. The Albanians of Chicago have the opportunity now to become members of the Federation and help their country."
            ],
            "dateFull": "1927-11-11",
            "dateText": "Nov. 11, 1927",
            "dateYear": "1927",
            "groups": [
                "albanian"
            ],
            "id": "5418477_0071",
            "title": "New Branches of Vatra",
            "topTitle": "Dielli (The Sun)"
        },
        "5418477_0072": {
            "codes": [
                "iid1",
                "iiih"
            ],
            "content": [
                "As you all know, as soon as I came to Chicago last year for personal reasons, always wishing to see the progress of our famous society, Vatra, which has saved and liberated Albania from the foreign yoke, I did not cease working day and night for the reorganizations of the branch in Chicago. But my dream did not materialize while I was here. However, I enjoyed coming in contact with those Albanians, who valued the work of the Federation, Vatra, and who later took the initiative in calling a meeting and organizing the Branch 30. These patriots are to be congratulated for their patriotic deed."
            ],
            "dateFull": "1927-11-11",
            "dateText": "Nov. 11, 1927",
            "dateYear": "1927",
            "groups": [
                "albanian"
            ],
            "id": "5418477_0072",
            "title": "New Branch in Chicago a Letter from Albania",
            "topTitle": "Dielli (The Sun)"
        },
        "5418477_0073": {
            "codes": [
                "iid1",
                "iiih"
            ],
            "content": [
                "We read in the report of the meeting of Branch 30 of the Albanian Federation, Vatra, Chicago, the criticism of Lasko Maleshova and Simo Kume Peshtani. As for Mr. Lesko, we are well acquainted with him and do not wish to make any comment in this paper. But I regret the affair exceedingly for my fellow citizen, Mr. Simo Kume, who criticizes the uniform of the President of the Albanian Republic. His Excellency, Ahmet Zogu. As I arrived recently from the old country, I have a thorough knowledge of the affairs of our country and know that Ahmet Zogu is one of the best Executives that Albania has ever had. As for the uniform of His Excellency, which does not appear to be liked by Mr. Simo Kume, I may state the following:",
                "Mr. Kume should not forget that His Excellency is a Colonel in the Albanian Army, and whenever he goes on a tour of inspection, he wears the uniform; at other times he wears civilian clothes, just like any other president of a civilized Republic. Mr. Simo Kume's attention is called to the Albanian stamps, which show His Excellency in civilian clothes and not as a monarch."
            ],
            "dateFull": "1927-11-11",
            "dateText": "Nov. 11, 1927",
            "dateYear": "1927",
            "groups": [
                "albanian"
            ],
            "id": "5418477_0073",
            "title": "Criticisms Without Foundation.",
            "topTitle": "Dielli (The Sun)"
        },
        "5418477_0074": {
            "codes": [
                "iid1"
            ],
            "content": [
                "Branch 30, Chicago, of the Albanian federation Vatra (The Hearth) has eleven new members. We are informed that Branch 30 will soon have as many members as the Massillon, Ohio branch, which is at present the largest branch of the federation."
            ],
            "dateFull": "1927-11-11",
            "dateText": "Nov. 11, 1927",
            "dateYear": "1927",
            "groups": [
                "albanian"
            ],
            "id": "5418477_0074",
            "title": "[Branch 30 Gains Eleven New Members]",
            "topTitle": "Dielli (The Sun)"
        },
        "5418477_0075": {
            "codes": [
                "iid1"
            ],
            "content": [
                "The Dielli has recently reported the addition of two new branches to the federation Vatra.",
                "Branch 30, Chicago, was one of the older branches of the federation, but was disrupted for a long time by a few ambitious, anti-social men. However, the good patriots of Chicago, despite the opposition they encountered, recently reorganized the branch. We are confident that the new officers--Liponi, Meshgorani, Prifti, and others--are intelligent, energetic, and patriotic, and that through their efforts the Chicago branch will flourish. The Albanians of Chicago now have the opportunity to become members of Vatra and thus help their native land."
            ],
            "dateFull": "1927-11-11",
            "dateText": "Nov. 11, 1927",
            "dateYear": "1927",
            "groups": [
                "albanian"
            ],
            "id": "5418477_0075",
            "title": "New Branches of Vatra",
            "topTitle": "Dielli (The Sun)"
        },
        "5418477_0076": {
            "codes": [
                "iid1",
                "iv"
            ],
            "content": [
                "On Sunday, October 16, the Albanians of Chicago and vicinity gathered at Hull House, Polk and Halsted Streets, to discuss the organization of a branch of the Albanian federation Vatra. At 4:30 P. M., Ahmet Meshgorani called the meeting to order, and after thanking the gathering for their patriotic zeal and explaining the purpose of the meeting, he proposed the election of a chairman and a secretary. Kristo A. Liponi (Christ A. Lepon) was selected chairman, and John Adams was named secretary.",
                "The chairman thanked the members for the honor bestowed on him, and spoke at length on the patriotic duty of every Albanian and what could be accomplished through the federation Vatra. He praised His Excellency, Ahmet Zogu, President of the Albanian Republic, and Faik Konitza, Minister of Albania to Washington, D. C. There were several other speeches.",
                "The following officers of the new branch were elected: Kristo A. Liponi (Christ A. Lepon), president; Ahmet Meshgorani, secretary; Spiro Prifti, treasurer; Kristo Mustaka, assistant secretary."
            ],
            "dateFull": "1927-11-01",
            "dateText": "Nov. 1, 1927",
            "dateYear": "1927",
            "groups": [
                "albanian"
            ],
            "id": "5418477_0076",
            "title": "(Summary)",
            "topTitle": "Dielli (The Sun)"
        },
        "5418477_0078": {
            "codes": [
                "iid1",
                "iiih",
                "iv"
            ],
            "content": [
                "Sunday, on the 16th of this month, the Albanians of Chicago and suburbs, were gathered in a meeting at Hull House, Polk and Halsted Streets, to discuss the organization of a branch of the Albanian Federation, Vatra. At 4:30 P.M. Ahmet Meshgorani declared the meeting open and after thanking the gathering for their patriotic zeal and explaining the purpose of the meeting, he proposed to elect a chairman and a reporter. He nominated for Chairman, Kristo A. Liponi (Christ A. Lepon), who was elected. John Adams was elected reporter.",
                "The chairman thanked the members for the honor bestowed on him, spoke at length and explained in detail the patriotic duty of every Albanian and what could be accomplished through the Federation, Vatra. He highly praised His Excellency, Ahmet Zogu, President of the Albanian Republic, and Faik Konitza, Minister of Albania at Washington, D. C. The other speakers of the day were Messrs. Meshgorani, Lasko, Papanika, Kume, Prifti, and Zereci.",
                "Officers elected were the following: Kristo A. Liponi (Christ A. Lepon), Pres.; Ahmet Meshgorani, Sec'y.; Spiro Prifti, Treas.; Kristo Mustaka, Ass't. Sec'y, and Panajot Kana, Vasillilo, Nevrus Jahja, members."
            ],
            "dateFull": "1927-11-01",
            "dateText": "Nov. 1, 1927",
            "dateYear": "1927",
            "groups": [
                "albanian"
            ],
            "id": "5418477_0078",
            "title": "From the Colonies Report of Branch 30 of the Federation, \"Vatra\", Which Was Organized in Chicago, Illinois",
            "topTitle": "Dielli (The Sun)"
        },
        "5418477_0080": {
            "codes": [
                "iid1"
            ],
            "content": [
                "We received the following telegram Monday morning:",
                "\"Chicago, Illinois.",
                "\"Oct. 17, 1927.",
                "\"Vatra",
                "\"Boston",
                "\"Despite all the opposition the branch has been organized.",
                "\"Kristo A. Liponi.\"",
                "(Christ A. Lepon).",
                "The federation Vatra now has a branch in Chicago. Kamber Machurishti, together with Mr. Liponi and others who had the progress of Vatra at heart, undertook the necessary propaganda work as early as last year. But because of the opposition they encountered, the branch was not organized until yesterday."
            ],
            "dateFull": "1927-10-18",
            "dateText": "Oct. 18, 1927",
            "dateYear": "1927",
            "groups": [
                "albanian"
            ],
            "id": "5418477_0080",
            "title": "Chicago Organizes Vatra Branch",
            "topTitle": "Dielli (The Sun)"
        },
        "5418477_0082": {
            "codes": [
                "iid1",
                "va1"
            ],
            "content": [
                "The society Progress was recently organized in Chicago by Albanians from Qyteza, Devolli."
            ],
            "dateFull": "1923-04-10",
            "dateText": "Apr. 10, 1923",
            "dateYear": "1923",
            "groups": [
                "albanian"
            ],
            "id": "5418477_0082",
            "title": "[New Albanian Society Organized]",
            "topTitle": "The Albanian Journal"
        },
        "5418477_0084": {
            "codes": [
                "iiia",
                "iia2",
                "iid1"
            ],
            "content": [
                "There are approximately 3,500 Albanians in Chicago. Christ Anton Lepon, through whose efforts, largely, as chairman, Albanian Day at A Century of Progress was such an outstanding success, estimates that there are about 5,000 of his countrymen in Cook County. The great majority of them are adults born in Albania, the men predominating in number by a ratio of two to one. Strange as it may seem, in view of their ancient background and traditions, they are among the most completely Americanized foreign group in the city. There is no \"Little Albania\" in Chicago. The greatest concentration of Albanianpopulation is in an area bounded on the north and south by Division and Madison Streets, and on the east and west by Ashland Avenue and Pulaski Road. The most detailed survey of this section, however, would reveal no signs of a colony.",
                "Proud as they are of their racial heritage, these expatriate \"sons of the two-headed eagle\" are not a clannish people. They associate freely with other nationalities, do business with them, partake of their common culture and participate, in a typically middle class way, in the general life of the city. They do, of course, occasionally think and talk of their homeland, that mountainous little kingdom, situated between Greece and Jugo-Slavia, on the west coast of the Balkan peninsula. One sure way of getting them to reminisce is to mention the name of Alexander the Great.",
                "According to the Encyclopedia Britannica, it is probable that the Albanian who owns a restaurant on West North Avenue, or a furniture upholstering business on West Madison Street, is a direct descendant of the conquering Macedonian.",
                "Once Part of Roman Empire",
                "The history of Albania is more the history of a people than of a country. It is a history that had its beginning with the subjection of the ancient inhabitants of Albania, the Illyrians, by the Romans. Illyria, cut up into provinces, formed part of the East Roman Empire. In the fourth and fifth centuries, the \"barbarian\" Goths overran the Albanian mountain meadows, but the land was reconquered by Justinian in 535 A.D.",
                "In 640 the Serbo-Croatian people conquered northern Albania and kept more or less constant control over the country until 1360, though the Bulgars occupied the northern portion after 861. When the great Serb ruler, Stephen Dushan, died in 1358, his vast empire was broken up and returned to the control of local feudal princes.",
                "Early in the 15th century began the long struggle of Albania against the Turks, who had captured the city of Jannina in 1431. That struggle, marked by frequent massacres of the Albanians, continued until 1912, when with the assistance of the Greeks, Serbians, and Bulgarians in the Balkan war, Albania won her independence. The kingdom today is ruled over by King Zog, a former insignificant local prince, who became the country's dictator after the World War and was elected president in 1925 and hereditary king in 1929.",
                "Agriculture and sheep and cattle raising are the chief industries in Albania, and many Albanians in this country are employed in agricultural pursuits. Chicago Albanians engage in such varied occupations as the brokerage, restaurant, and furniture upholstering business, barbering, bartending, cooking, and store clerking.",
                "Hospitality National Trait",
                "A typical meal prepared for a guest in a Chicago Albanian home would include a brandy aperitif, a pie with cheese, meat or egg filling [burek], lamb stew cooked with onions and tomatoes and one other vegetable, roast lamb, rice pudding cooked in milk [sukliach], sour milk [kos], a sweet, and Arabian coffee made Turkish fashion and served without cream. Incidentally, when an Albanian drinks to your health, he exclaims \"Gezuar\" [good luck].",
                "There are, however, a number of social and semi-benevolent organizations, including the Albanian American Club of Chicago, the Pan-Albanian National Society Unity, the Albanian Society of America, Qyteza Brotherhood Progress [social], the Sinica Brotherhood Perparimi [social], and the Albanian Ladies Society Voisava [social and charitable]."
            ],
            "dateFull": "1935-07-28",
            "dateText": "July 28, 1935",
            "dateYear": "1935",
            "groups": [
                "albanian"
            ],
            "id": "5418477_0084",
            "title": "by Arch Farmer",
            "topTitle": "Chicago Tribune"
        },
        "5418477_0089": {
            "codes": [
                "iiia",
                "iib1c",
                "ia3"
            ],
            "content": [
                "p. 4.- This year the Albanian women organized a society named \"Voisava.\" Up to this date there are thirty members. The purpose of this organization is to assist the members and their families to learn the good traditions of Albania and its language.",
                "On May 13, Mother's Day, a drama will be presented for the benefit of the society."
            ],
            "dateFull": "1934-04-27",
            "dateText": "Apr. 27, 1934",
            "dateYear": "1934",
            "groups": [
                "albanian"
            ],
            "id": "5418477_0089",
            "title": "From Chicago, Illinois Voisava Society",
            "topTitle": "The Albanian Messenger"
        },
        "5418477_0091": {
            "codes": [
                "iiib1",
                "va1",
                "iiih"
            ],
            "content": [
                "An appeal for Albanian independence was cabled today to Premier Clemenceau and Secretary of State Lansing, in Paris, by delegates representing seventy-two Albanian organizations in America. The message was as follows:",
                "\"Americans of Albanian descent and Albanian residents of Illinois, natives of Kossova and Chameria, respectfully appeal to Your Excellency for independence and territorial integrity for Albania, including the provinces of Kossova and Chameria, in accordance with the noble principles enunciated by President Wilson and the Allied Powers.\""
            ],
            "dateFull": "1919-03-03",
            "dateText": "Mar. 3, 1919",
            "dateYear": "1919",
            "groups": [
                "albanian"
            ],
            "id": "5418477_0091",
            "title": "Chicagoans Ask Independence for Albania",
            "topTitle": "Chicago Tribune"
        },
        "5418477_0093": {
            "codes": [
                "iiib2",
                "iiia"
            ],
            "content": [
                "The Voisava Society was organized this year by a group of Albanian women. The purpose of this organization, which now has a membership of thirty, is to assist the members and their families in studying the traditions of Albania and its language.",
                "On May 13, Mother's Day, a drama will be presented for the benefit of the Society."
            ],
            "dateFull": "1934-04-27",
            "dateText": "Apr. 27, 1934",
            "dateYear": "1934",
            "groups": [
                "albanian"
            ],
            "id": "5418477_0093",
            "title": "The Voisava Society of Chicago",
            "topTitle": "The Albanian Messenger"
        },
        "5418477_0094": {
            "codes": [
                "iiib2"
            ],
            "content": [
                "The members of Branch 30, Chicago, and the Albanians who desire to become members of the Albanian federation Vatra (The Hearth), are herewith notified to be present at the meeting which will be held Sunday, February 26 in Room 218, German Hall, 814 West Harrison Street, near Halsted Street.",
                "Many matters of importance to every patriotic Albanian will be discussed at this meeting. The Albanians of Chicago and vicinity should be proud of membership in a society like Vatra, and those who, for personal reasons, have not yet had the chance to join the society should not hesitate to become members of Vatra, since by doing so they will benefit themselves, their family, and their beloved fatherland.",
                "From the Office of Branch 30, Chicago, Illinois.",
                "Ali Rusi, Branch Secretary."
            ],
            "dateFull": "1928-02-17",
            "dateText": "Feb. 17, 1928",
            "dateYear": "1928",
            "groups": [
                "albanian"
            ],
            "id": "5418477_0094",
            "title": "Important Notice",
            "topTitle": "Dielli (The Sun)"
        },
        "5418477_0095": {
            "codes": [
                "iiib2",
                "iid1",
                "iv"
            ],
            "content": [
                "On November 8 the President of Branch 30 of Chicago was present at a dinner in the residence of Thomas Johns, 323 Schiller Street, who was celebrating the name day of his son, Michael. The National songs and dances and foxtrots lasted until 4 A.M. Among the guests were Mr. and Mrs. Daniel Peters, who recently returned from Europe. Mr. Peters sings very well and was the life of the party."
            ],
            "dateFull": "1927-11-22",
            "dateText": "Nov. 22, 1927",
            "dateYear": "1927",
            "groups": [
                "albanian"
            ],
            "id": "5418477_0095",
            "title": "Social Activities in Chicago",
            "topTitle": "Dielli (The Sun)"
        },
        "5418477_0097": {
            "codes": [
                "iiib3a",
                "iiih",
                "iv"
            ],
            "content": [
                "On Sunday, November 27, the Albanians of Chicago and vicinity gathered in Olympia Hall, 748 South Halsted Street, to celebrate the independence of Albania. The committee of the day consisted of Messrs. John Adams, Kristo A. Liponi (Christ A. Lepon), Simo Kume, Spiro Prifti, Vasil Papanika, Petro Donushi, Pano Angelo, Kocho Hysi, Evanthi Liponi, Ligor Exarhos, Spiro Johns, and Sofokli Stefani.",
                "The meeting was called to order at 4 P. M. by John Adams, chairman, who requested the orchestra to play the American and Albanian national anthems. The Chicago Albanian societies Metamorphosis, Ipapandi, and Saint Nicholas were represented at the celebration.",
                "The chairman presented the speaker of the day, Petro Donushi, who spoke at some length on the history of the Albanian race, from the time of George Kastriota, the Albanian national hero, to the day when the venerable Ismail Qemali raised the flag, the symbol of independence, over Valona on November 28, 1912. Other speakers of the day were Messrs. Vasil Papanika, Spiro Prifti, Thoma Vasil, Kosta Avgerino, Nexhat Rusi, Simo Kume, Stayre Telio, and Panajot Elia. Mrs. Evanthi Liponi and Miss Donushi sang a patriotic song, and Lefter Spiro Johns, a young lad of nine years, recited a poem on the flag. A dinner was held at 8 P. M., at which Kristo A. Liponi spoke on the activities of the Albanians of Chicago."
            ],
            "dateFull": "1927-12-13",
            "dateText": "Dec. 13, 1927",
            "dateYear": "1927",
            "groups": [
                "albanian"
            ],
            "id": "5418477_0097",
            "title": "(Summary)",
            "topTitle": "Dielli (The Sun)"
        },
        "5418477_0099": {
            "codes": [
                "iiib3a",
                "iiih"
            ],
            "content": [
                "Chicago Shkipetars, otherwise known as Albanians, will celebrate today the fifth anniversary of their native land's independence. Patriotic speeches, singing and dancing will comprise the program at Olympia Hall, 748 South Halsted Street."
            ],
            "dateFull": "1927-11-27",
            "dateText": "Nov. 27, 1927",
            "dateYear": "1927",
            "groups": [
                "albanian"
            ],
            "id": "5418477_0099",
            "title": "Albanians to Hold Anniversary Fete",
            "topTitle": "Chicago Herald and Examiner"
        },
        "5418477_0100": {
            "codes": [
                "iiib3a",
                "iiih"
            ],
            "content": [
                "The Albanians of Chicago and vicinity, and their friends, are herewith notified to be present at the celebration of Albanian independence which will take place next Sunday, November 27, at 2322 West Chicago Avenue. The celebration, which will begin at 3 P. M., is under the auspices of the Progress Brotherhood of Qyteza Devolli.",
                "The Committee."
            ],
            "dateFull": "1927-11-22",
            "dateText": "Nov. 22, 1927",
            "dateYear": "1927",
            "groups": [
                "albanian"
            ],
            "id": "5418477_0100",
            "title": "Notice to Albanians of Chicago and Vicinity",
            "topTitle": "Dielli (The Sun)"
        },
        "5418477_0101": {
            "codes": [
                "iiib3a",
                "iiih"
            ],
            "content": [
                "It was a glorious occasion when the natives of Albania now living in Chicago, Argo, and Milwaukee heard Prof. Elmer E. Jones, director of the School of Education at Northwestern University in Evanston, tell them of his trip to Albania. The Albanians had gathered to celebrate the tenth anniversary of the independence of Albania, and to express their loyalty to the American flag for the privilege they enjoy under it of shaping the destiny of their country. The Albanians believe that while the races of mankind are represented by their own distinct languages, the nations and governments of the world are symbolized by their flags. The Albanian flag is highly esteemed by the Albanians, and at all patriotic meetings the flag of Albania and the Stars and Stripes lend their grandeur to the occasion. A committee had been appointed to extend an invitation to Professor Jones, who had been on a trip to Albania recently for the purpose of investigating the educational needs of that country. Dr. Francis La Piana presided at the meeting.",
                "Professor Jones was greeted by the Albanians as the first American who went to see what Albania is like and to bring back a complete report of the present conditions and future possibilities of the Balkan countries. During his lecture, he brought Albania to Chicago for the Albanians, who listened attentively to his experiences in going from town to town on muleback, by carriage, and by automobile; how the people in Albania welcomed him, and the hospitality shown him during his trip through the land of the Shkipetars (Albanians). The possibilities regarding the education of their countrymen and the development of the country's natural resources made the audience see the realization of the Albanian national aspirations.",
                "Professor Jones spoke for two hours. He related how his friends in Evanston advised him to carry a gun with him because they thought Albania was a lawless country, full of bandits, but since he was going for a peaceful purpose he decided not to carry a gun. He said he felt perfectly safe without it among the alleged bandits. He spoke of Albania as a law-abiding country with an effective government, but greatly in need of educational facilities. He commented on the eagerness of the people for education and their interest in the establishment of schools."
            ],
            "dateFull": "1922-12-06",
            "dateText": "Dec. 6, 1922",
            "dateYear": "1922",
            "groups": [
                "albanian"
            ],
            "id": "5418477_0101",
            "title": "Professor Elmer E. Jones Tells of Educational Needs and Future Development of Albania",
            "topTitle": "The Albanian Journal"
        },
        "5418477_0105": {
            "codes": [
                "iiih",
                "iid1"
            ],
            "content": [
                "In the report of the meeting of Branch 30, Chicago, of the Albanian federation Vatra, we have just read certain criticisms made by Lasko Maleshova and Simo Kume Peshtani. As for Mr. Lasko, we are well acquainted with him and do not wish to make any comment in this paper. But we regret the matter exceedingly for the sake of our fellow citizen, Simo Kume, who criticizes the uniform of the President of the Albanian Republic, His Excellency, Ahmet Zogu. Since we have but recently arrived from the old country, we have a thorough knowledge of the affairs of our country and know that Ahmet Zogu is one of the best executives that Albania has ever had. As for His Excellency's uniform, which Simo Kume apparently does not like, I may state the following: Simo Kume should not forget that His Excellency is a colonel in the Albanian Army, and whenever he goes on a tour of inspection, he wears his uniform. At all other times, he wears civilian clothes, just like any other President of a civilized republic. We call attention to the Albanian stamps, which show His Excellency in civilian clothes, not in royal dress."
            ],
            "dateFull": "1927-11-11",
            "dateText": "Nov. 11, 1927",
            "dateYear": "1927",
            "groups": [
                "albanian"
            ],
            "id": "5418477_0105",
            "title": "Unfounded Criticism",
            "topTitle": "Dielli (The Sun)"
        },
        "5418477_0106": {
            "codes": [
                "iiih"
            ],
            "content": [
                "Albania, a little known Balkan nation, was an ancient country long before the dawn of Grecian history. Commercial prospects in this new republic on the Adriatic Sea, three fourths the area of England, have been little exploited by American or European business.",
                "There are many reasons why Albania should appeal to American capital. The government is sound, and the finances of the country are in good shape, there being an unusually large gold supply for such a small European nation. The government is seeking American co-operation in education, commerce, agriculture, finance, and in church relationships. As Albania goes, so go all the Balkan states.",
                "Ten thousand Albanians who have attended school in the United States have returned to Albania to assist in the development of this Balkan country.",
                "The mountains--and Albania is indeed mountainous--contain an abundance of gold, silver, copper, and other ore. American capital will be interested in this.",
                "Albania's tobacco monopoly, until recently held by the British, has not been extended, and is now open to American interests. American businessmen will sail from New York, June 2, with Professor Elmer E. Jones and a group of Albanians for a tour of Albania."
            ],
            "dateFull": "1923-04-10",
            "dateText": "Apr. 10, 1923",
            "dateYear": "1923",
            "groups": [
                "albanian"
            ],
            "id": "5418477_0106",
            "title": "Good Reasons to Help Albania",
            "topTitle": "The Albanian Journal"
        },
        "5418477_0108": {
            "codes": [
                "iiih"
            ],
            "content": [
                "American businessmen are usually quite shrewd in seeing the opportunity to make excellent investments in foreign countries. Thus far, however, there has been little interest manifested in Albania as a field in which American capital might be invested with assurance of good returns. This is doubtless due to the fact that men of means know little of the opportunities for development in the Balkans, particularly that newest of the republics, Albania.",
                "There is probably no country in the world in which the possibilities for commercial and industrial development are greater than in Albania. When we consider that the present government is not yet four years old, and that for hundreds of years the Turkish government has prevented any industrial or commercial development whatsoever in Albania, the possibilities are clearly apparent. Every enterprise which will eventually be introduced into the country is now in the crudest stages of formation. Capital is needed in every department of the emerging civilization.",
                "Albania needs railroads, truck roads, bridges, agricultural implements, modern vehicles, factories, the development of her water power, development of her mines and oil wells, improvement of harbors, and all other natural resources. The country is teeming with potential industries. Tobacco is grown, but not upon the large scale of which the country is capable. The wool industry offers one of the greatest possibilities for development, in as much as the mountains are covered with sheep and goats, and yet there is not a woolen mill in the country. Albania abounds in many varieties of fur-bearing animals, yet the fur industry is undeveloped. Tons of fine fruit rot in the orchards of Albania every year because the canning industry is unknown. Many parts of southern Albania are covered with olive orchards, and yet there are no factories for making oil, or for canning and preserving.",
                "We could go on indefinitely, almost, with the great opportunities to establish various sorts of businesses in Albania, having a two-fold result: first, large and easy incomes on the investment; second, a distinct service to the people of Albania.",
                "At the present time, there are many people in Albania out of employment, or at least not engaged in continuous and remunerative employment.",
                "American capital introduced into the country should bring about industrial development, give the people much needed employment, and assist in the general production of wealth. The leaders of Albania are very desirous that the American capitalists be stimulated to make investments in their country. They would much prefer American capital to that of any other country.",
                "From what I learned from representatives in the Parliament, the government would welcome American business men to the country, and would show them every courtesy in investigating the various fields for industrial development."
            ],
            "dateFull": "1923-04-10",
            "dateText": "Apr. 10, 1923",
            "dateYear": "1923",
            "groups": [
                "albanian"
            ],
            "id": "5418477_0108",
            "title": "Government Invites U. S. Money by Professor Elmer E. Jones, Northwestern University",
            "topTitle": "The Albanian Journal"
        },
        "5418477_0111": {
            "codes": [
                "iiih",
                "ia1a"
            ],
            "content": [
                "Prof. Elmer E. Jones tells Albanians of Educational Needs and Future Development of Shkiperia (Albania).",
                "MORE SCHOOLS FOR THE COUNTRY",
                "p. 1.- It was a glorious time when the natives of Albania now residing in Chicago, Argo, Ill., and Milwaukee, Wis., heard Prof. Elmer E. Jones, director of the School of Education of the Northwestern University of Evanston, Illinois, relate to them about his trip to Albania.",
                "The Albanians assembled to celebrate the Tenth Anniversary of the Independence of Albania, and to express their loyalty to the American flag for the privilege they enjoy under it in shaping the destiny of their country. The Albanians believe that while the races of mankind are represented by their own distinct languages, the nations and governments of the world are symbolized by the flags. The Albanian flag is highly esteemed by the Albanians, and at all patriotic meetings the flag of Albania and The Stars and Stripes lend their grandeur to the occasion.",
                "A committee had been appointed to invite Prof. Jones who had been on a trip to Albania recently for the purpose of investigating the educational needs of that country. Dr. Francis La Piana presided at the meeting.",
                "Prof. Jones was greeted by the Albanians as the first American who went to see what Albania is like and brought a complete report of the present conditions and future possibilities of the Balkan countries. During his lecture he brought Albania to Chicago for the Albanians who listened attentively to his experiences in going from town to town on mule's back, by carriage and automobile; how the people in Albania welcomed him and the hospitality shown him during his trip through the land of the Shkipetars (Albanians). The possibilities regarding the education of their countrymen and the development of the natural resources made the audience see the realization of the Albanian national aspirations.",
                "Prof Jones spoke for two hours. He related how his friends in Evanston advised him to carry a gun with him because they thought Albania was a lawless country full of bandits, but since he was going for a peaceful purpose he decided not to carry the gun and that he felt perfectly safe without it among the supposed bandits. He spoke of Albania as a law-abiding country with an effective government, but greatly in need of educational facilities. He commented on the eagerness of the people for learning and their interest in the establishment of schools."
            ],
            "dateFull": "1922-12-06",
            "dateText": "Dec. 6, 1922",
            "dateYear": "1922",
            "groups": [
                "albanian"
            ],
            "id": "5418477_0111",
            "title": "The Albania's Independence Celebrated in Chicago.",
            "topTitle": "The Albanian Journal"
        },
        "5418477_0114": {
            "codes": [
                "iiih"
            ],
            "content": [
                "[Telegram]",
                "\"Chicago, Illinois.",
                "\"July 28, 1922.",
                "\"Honorable Charles E. Hughes,",
                "\"Secretary of State,",
                "\"Washington, D. C.",
                "\"Albanians of Chicago congratulate State Department for recognizing Albania.",
                "\"The Albanian Journal",
                "\"John Adams.\"",
                "[Acknowledgment of Telegram]",
                "\"Department of State,",
                "\"Washington, D. C.",
                "\"August 2, 1922.",
                "\"John Adams, Esquire.",
                "\"P. O. Box 118,",
                "\"Chicago, Illinois.",
                "\"Sir: The receipt is acknowledged, with thanks, of your telegram dated July 28, expressing to the Secretary of State the congratulations of the Albanians of Chicago on the occasion of the recognition by this government of the independence of Albania.",
                "\"For the Secretary of State,",
                "\"Robert Woods Bliss, Third Assistant Sec'y.\""
            ],
            "dateFull": "1922-08-05",
            "dateText": "Aug. 5, 1922",
            "dateYear": "1922",
            "groups": [
                "albanian"
            ],
            "id": "5418477_0114",
            "title": "Chicago Albanians Show Appreciation in Message to Secretary of State",
            "topTitle": "The Albanian Journal"
        },
        "5418477_0116": {
            "codes": [
                "iiih"
            ],
            "content": [
                "The Albanian government has appealed to the Methodist Episcopal Church of America to undertake the establishment of an American college in Albania. Bishop Blake answered the call of Albania and sent to that country Professor Elmer E. Jones, director of the School of Education of Northwestern University at Evanston, to investigate educational conditions and future possibilities.",
                "Professor Jones spent three months in Albania last summer, visiting all the important cities and towns and studying the ancient traditions and the national customs of the Albanian people. He returned to Evanston a few weeks ago, and in his extensive report to the Board of Foreign Missions of the Methodist Episcopal Church of America strongly recommends the establishment of an American college in Albania.",
                "\"The Albanians are eager for education,\" says Professor Jones,\" and anything American is cherished by them. I was royally welcomed by them everywhere, and the people showed great appreciation of my interest in their educational welfare. Officers of the government and mayors of various towns came out many miles to meet me and escort me to their respective towns. The people swarmed around me, and I was overwhelmed with the kindness shown me. The hospitality of the Shkipetars, as the Albanians call themselves, is beyond comparison. I sat at banquets with them from early evening till midnight almost everyday, and I had a very pleasant time with them.",
                "\"While in Tirana I had daily conferences with the leaders of the government. They were enthusiastic at my proposition and promised me every possible assistance in making the American college a success. The Albanian government is willing to offer suitable buildings for the college and will place at our disposal large tracts of land that we may need for agricultural experimental purposes. Albania is an undeveloped country but is very rich in resources. The land in the plains is very productive, and the mountains provide excellent pasture for the sheep and goats. Every family in the country keeps a certain number of sheep and goats, and there is a possibility of developing a wood industry.",
                "\"The enthusiasm of the Albanian children amazed me when I visited them in their schools. They amused me with their beautiful songs which they sang everywhere I went. But the condition of the schools in many towns is appalling and books are scarce. It seems to me as though Albania is clamoring for education with hands outstreched toward America, and I have promised the Albanians American assistance in their educational development.",
                "\"When the Albanian boys hear that we have a college at Valona they will climb the mountains and come to it. Education has been utterly neglected in Albania in the past, on account of the political animosity that has been prevalent in the Balkans, and Albanians who sought an education were compelled to study foreign languages, because their own language was prohibited by the Ottoman government, which ruled the country for four centuries, and was anathematized by the Greek Orthodox Church. Notwithstanding the Turkish government, the Greek clergy was a dominant force in the political affairs of Albania. Fortunately, both Turkey and Greece lost their political game in Albania, because since 1912 political authority has been in the hands of the Albanians themselves, who have proved their ability to run the government.",
                "\"The Christian Albanians just lately severed their allegiance to the Greek Church and declared the Albanian Church independent.\""
            ],
            "dateFull": "1922-01-02",
            "dateText": "Jan. 2, 1922",
            "dateYear": "1922",
            "groups": [
                "albanian"
            ],
            "id": "5418477_0116",
            "title": "Methodist Episcopal Church Extend Helping Hand to Shkipetars (Albanians) in Educational Endeavor",
            "topTitle": "The Albanian Journal"
        },
        "5418477_0121": {
            "codes": [
                "iv"
            ],
            "content": [
                "Spiro Johns, 234 Beethoven Place, Chicago, Illinois."
            ],
            "dateFull": "1934-05-29",
            "dateText": "May 29, 1934",
            "dateYear": "1934",
            "groups": [
                "albanian"
            ],
            "id": "5418477_0121",
            "title": "Our Representatives",
            "topTitle": "The Albanian Messenger"
        },
        "5418477_0122": {
            "codes": [
                "iv"
            ],
            "content": [
                "The president of Branch 30, Chicago, [of Vatra] attended a dinner at the home of Thomas Johns, 323 Schiller Street, who was celebrating the name day of his son Michael. Folk dancing and the singing of folksongs lasted until 4 A. M. Among the guests were Mr. and Mrs. Daniel Peters, who recently returned from Europe. Mr. Peters sings very well and was the life of the party."
            ],
            "dateFull": "1927-11-22",
            "dateText": "Nov. 22, 1927",
            "dateYear": "1927",
            "groups": [
                "albanian"
            ],
            "id": "5418477_0122",
            "title": "Social Activities in Chicago",
            "topTitle": "Dielli (The Sun)"
        }
    },
    "dates": {
            "1922": [
                "5418477_0037",
                "5418477_0065",
                "5418477_0101",
                "5418477_0111",
                "5418477_0114",
                "5418477_0116"
            ],
            "1923": [
                "5418477_0042",
                "5418477_0082",
                "5418477_0106",
                "5418477_0108"
            ],
            "1934": [
                "5418477_0044",
                "5418477_0048",
                "5418477_0049",
                "5418477_0054",
                "5418477_0055",
                "5418477_0057",
                "5418477_0058",
                "5418477_0059",
                "5418477_0060",
                "5418477_0061",
                "5418477_0067",
                "5418477_0089",
                "5418477_0093",
                "5418477_0121"
            ],
            "1935": [
                "5418477_0047",
                "5418477_0084"
            ],
            "1928": [
                "5418477_0069",
                "5418477_0094"
            ],
            "1927": [
                "5418477_0070",
                "5418477_0071",
                "5418477_0072",
                "5418477_0073",
                "5418477_0074",
                "5418477_0075",
                "5418477_0076",
                "5418477_0078",
                "5418477_0080",
                "5418477_0095",
                "5418477_0097",
                "5418477_0099",
                "5418477_0100",
                "5418477_0105",
                "5418477_0122"
            ],
            "1919": [
                "5418477_0091"
            ]
        }
    ,
    "codes": [{ 
            "ia1a": [
                "5418477_0037",
                "5418477_0042",
                "5418477_0044",
                "5418477_0111"
            ],
            "iiic": [
                "5418477_0037",
                "5418477_0070"
            ],
            "iiih": [
                "5418477_0037",
                "5418477_0042",
                "5418477_0048",
                "5418477_0049",
                "5418477_0055",
                "5418477_0057",
                "5418477_0058",
                "5418477_0060",
                "5418477_0069",
                "5418477_0071",
                "5418477_0072",
                "5418477_0073",
                "5418477_0078",
                "5418477_0091",
                "5418477_0097",
                "5418477_0099",
                "5418477_0100",
                "5418477_0101",
                "5418477_0105",
                "5418477_0106",
                "5418477_0108",
                "5418477_0111",
                "5418477_0114",
                "5418477_0116"
            ],
            "ic": [
                "5418477_0042"
            ],
            "iib1a": [
                "5418477_0044",
                "5418477_0049",
                "5418477_0067"
            ],
            "iib1c": [
                "5418477_0044",
                "5418477_0047",
                "5418477_0048",
                "5418477_0049",
                "5418477_0049",
                "5418477_0054",
                "5418477_0055",
                "5418477_0057",
                "5418477_0058",
                "5418477_0059",
                "5418477_0060",
                "5418477_0061",
                "5418477_0067",
                "5418477_0067",
                "5418477_0089"
            ],
            "ib3b": [
                "5418477_0044"
            ],
            "iv": [
                "5418477_0047",
                "5418477_0049",
                "5418477_0055",
                "5418477_0060",
                "5418477_0061",
                "5418477_0067",
                "5418477_0070",
                "5418477_0076",
                "5418477_0078",
                "5418477_0095",
                "5418477_0097",
                "5418477_0121",
                "5418477_0122"
            ],
            "iib2d": [
                "5418477_0065"
            ],
            "iid1": [
                "5418477_0067",
                "5418477_0069",
                "5418477_0070",
                "5418477_0071",
                "5418477_0072",
                "5418477_0073",
                "5418477_0074",
                "5418477_0075",
                "5418477_0076",
                "5418477_0078",
                "5418477_0080",
                "5418477_0082",
                "5418477_0084",
                "5418477_0095",
                "5418477_0105"
            ],
            "iiib4": [
                "5418477_0069"
            ],
            "va1": [
                "5418477_0082",
                "5418477_0091"
            ],
            "iiia": [
                "5418477_0084",
                "5418477_0089",
                "5418477_0093"
            ],
            "iia2": [
                "5418477_0084"
            ],
            "ia3": [
                "5418477_0089"
            ],
            "iiib1": [
                "5418477_0091"
            ],
            "iiib2": [
                "5418477_0093",
                "5418477_0094",
                "5418477_0095"
            ],
            "iiib3a": [
                "5418477_0097",
                "5418477_0099",
                "5418477_0100",
                "5418477_0101"
            ]
        }],
    "values": [
        "albanian"
    ]
}