{
    "items": {
        "5418478_4_0113": {
            "codes": [
                "iib2a",
                "iiih"
            ],
            "content": [
                "At the beginning of this year one of the German members of the library board of directors wrote to Mr. Vojta Naprstek, eminent leader of the Czech national party in Prague, and asked him for a list of books in the Czech language most suited for the public library here. The attention of Mr. Naprstek was called to the fact that we intended to make our library a cosmopolitan one, containing especially the best literary works of the nationalities represented in Chicago. This was the first time that a public library in American was attempting to acquire Czech literature and it was to be hoped that the leader of the Czech national party would take part in it.",
                "The letter remained unanswered - as well as a second one mailed three months later to the same address and the deduction was justified that even such eminent Czech leaders as Mr. Naprstek were indifferent to the mental needs of their compatriots in this country.",
                "This deduction has lately been refuted through the arrival of a box of Czech books, which are stamped with the words, \"Vojta Naprstek Napamatku\" or \"Americk Klub.\" As this consignment was not accompanied by any written message, we are unable to say if it is the result of a collection or the gift of an individual. Many of the books are well bound and over nine tenths of them have been published since 1860, thus no old junk."
            ],
            "dateFull": "1874-07-31",
            "dateText": "July 31,1874",
            "dateYear": "1874",
            "groups": [
                "czech"
            ],
            "id": "5418478_4_0113",
            "title": "Czech Books.",
            "topTitle": "Illinois Staats-Zeitung"
        },
        "5418478_4_0125": {
            "codes": [
                "iib3"
            ],
            "content": [
                "There was an athletic entertainment at the Bohemian Turners' Hall, De Koven and Canal streets, which was attended by 1,000 persons. The program was opened by the Belmont brothers in an excellent horizontal bar performance. This was followed by a high jump contest, which was won by N. L. Wing, who jumped five feet six inches. Master Dan Moore, four years old, in club swinging, parallel bar performances, club juggling, sparring, wrestling and a tug-of-war contest for the champion of Illinois between the teams of the Sheridan Club of Pullman, Scottish Athletic Club, Bohemian Turners and Humboldt Athletic clubs. A dance concluded the evening's entertainment.",
                "The final tug was won by the Sheridan Club amidst great excitement, the Pullmanites taking one inch of rope from the Bohemian Athletic Club."
            ],
            "dateFull": "1892-04-10",
            "dateText": "April 10, 1892",
            "dateYear": "1892",
            "groups": [
                "czechoslovakian"
            ],
            "id": "5418478_4_0125",
            "title": "Bohemian Turner's Exhibition",
            "topTitle": "Chicago Tribune"
        },
        "5418478_6_0811": {
            "codes": [
                "iiia",
                "iib2d",
                "iib1a",
                "iia2",
                "iib3",
                "iid1",
                "iv"
            ],
            "content": [
                "There are 315,000 Czechs and Slovaks in Chicago. Three daily Bohemian papers and one Slovak, are published.",
                "There are over five hundred Czech societies, fraternal, building and loan, charitable, singing, gymnastic, with a membership of many thousands in metropolitan Chicago. Their activities are regularly noted in our papers, which, like the English papers, give all the news of a general character, both local and national, as well as special news both by cable and telegraph, together with local reports not carried in English language papers, concerning items of interest to all our people both young and old.",
                "Recently the Western Czechoslovak Fraternal Union held a convention to plan merging all our fraternal orders into one organization. Should this worthy object be accomplished the new society would then have a membership of almost 500,000 members and since Chicago is admitted to be the largest Czechoslovak city outside of Prague, Czechoslovakia, the membership in metropolitan Chicago would exceed 100,000 members.",
                "It is conceded by all students of building and loan associations that the Czechs have more building and loan societies than any other group in this city. We have 124 building and loan associations with a membership of 50,000, holding 550,000 shares which have a maturity value of $55,000,000.",
                "These are matters of record. This is another fact on which we base our estimate of our national strength. It also gives you an idea of the progressiveness of our group, their saving habits, property ownership, etc., all of which indicates high purchasing power.",
                "There are 573 grocery stores, 210 drug stores, about 2,500 meat markets, bakeries and other retail stores, many factories, wholesale and commission houses, and homes owned by citizens of Czech descent. On the southwest side of Chicago where Svornost is located, there are hundreds of blocks which are improved with thousands and thousands of residences, apartment and commercial buildings belonging to Czechoslovak-Americans. The large towns of Cicero, Berwyn, LaGrange, Lyons, Riverside, Brookfield, etc. are really a continuation of the great Southwest side. On these streets you hear Czech spoken as a rule."
            ],
            "dateFull": "1937-09-30",
            "dateText": "SEPTEMBER 30, 1937",
            "dateYear": "1937",
            "groups": [
                "czech"
            ],
            "id": "5418478_6_0811",
            "title": "",
            "topTitle": ""
        },
        "5418478_6_0814": {
            "codes": [
                "iiia",
                "ic",
                "va2"
            ],
            "content": [
                "Twenty-five years ago the Czechs in Chicago were concentrated along Twelfth Street between Canal and Douglas Park. Even in that period of storm and stress when the great mass of them were newcomers struggling for a foothold they began to put their impress upon the region. Douglas Park itself contains the first statue of a Bohemian ever erected in that state. It is a portrait in stone of the well-known Czech journalist, Karel Havlicek, the man who waged so heroic and desperate a fight for the independence of his people and who died after incarceration, a martyr to the cause of Bohemian freedom. His countrymen remembered him when they secured in America the blessings which he had struggled to win for them at home.",
                "Libussa Hall on Roosevelt Road in the heart of the district, is another landmark to remind the student of current history that this was once the home of the Czechs in Chicago. And although changing conditions have shifted the center of the population to other places, sentiment still draws the old inhabitant to the semi-weekly concerts given there, and Libussa Hail remains to this day a social focus for the race that built it.",
                "Pressure from newer immigrants long ago began to push the Czechs out of the region. They yield without resistance. Prosperity had come to them and with it a striving for higher standards. They willingly moved westward. Their progress was gradual. The first leg of the forward movement took them into the district around 14th Street. There, following the tradition set up by the earlier Americans they founded their \"city\" and named it Tabor, after the town in Czechoslovakia where John Zizka long ago assembled his forces in the Hussite wars. Sentiment likewise and filial affection for their Old World homeland, led them to rename various thoroughfares. Thus it happened that Chicago today has its Karlov Street, named after one of the picturesque summits of Prague; its Komensky Street, so called after the greatest of Czech educators, known to the world as Comenius; and its Kostner Street after J. Kostner the Bohemian philanthropist.",
                "Ten years now have passed since the Czechs and Slovaks began moving into America taking their place, that is in the general and progressive community life of their adopted country. More recently the younger and more ambitious new generation has taken another leap ahead.",
                "Suburbs like Cicero and Berwyn, offering opportunities for real homes, open spaces, gardens and a healthy community life, have attracted these native sons of the newcomers of yesterday, who were eager to get as far away from the tenement memories of their pioneer fathers as they could. Today these regions are beauty spots, gleaming with new brick and stucco dwellings, wholly detached or of the two-family type - a symbol suggesting that the Czechoslovak in America has arrived.",
                "Already the vicinity is acquiring a character of its own. In the past year a community house containing a theatre and the inevitable Sokol gymnasium has been built on an entire city block. In it are concentrated every species of social activitincluding the building and loan association, an institution well known, it may be mentioned in passing, to the Czecho-Slovak in their native country."
            ],
            "dateFull": "1936-06",
            "dateText": "June 1936",
            "dateYear": "1936",
            "groups": [
                "czech"
            ],
            "id": "5418478_6_0814",
            "title": "The Czechs in Chicago",
            "topTitle": "Interpreter"
        }
    },
    "dates": [
        {
            "1874": [
                "5418478_4_0113"
            ],
            "1892": [
                "5418478_4_0125"
            ],
            "1937": [
                "5418478_6_0811"
            ],
            "1936": [
                "5418478_6_0814"
            ]
        }
    ],
    "codes": [
        {
            "iib2a": [
                "5418478_4_0113"
            ],
            "iiih": [
                "5418478_4_0113"
            ],
            "iib3": [
                "5418478_4_0125",
                "5418478_6_0811"
            ],
            "iiia": [
                "5418478_6_0811",
                "5418478_6_0814"
            ],
            "iib2d": [
                "5418478_6_0811"
            ],
            "iib1a": [
                "5418478_6_0811"
            ],
            "iia2": [
                "5418478_6_0811"
            ],
            "iid1": [
                "5418478_6_0811"
            ],
            "iv": [
                "5418478_6_0811"
            ],
            "ic": [
                "5418478_6_0814"
            ],
            "va2": [
                "5418478_6_0814"
            ]
        }
    ],
    "values": [
        "czech",
        "czechoslovakian"
    ]
}