{
    "items": {
        "chicagoforeignl0chic_0036": {
            "codes": [
                "ia2a",
                "ic"
            ],
            "content": [
                "It came as a big surprise to people who know how hard it is to unite us\nSlavs, but it is the truth that in South Chicago we Slovenes and Croats\nwork shoulder to shoulder.",
                "As a result of such harmony, just a few weeks ago in South Chicago we\nopened a new school, which has already about 250 children enrolled. If\nonly our people come to their senses and forget their political, religious \nand national differences, this cooperation can be found in other ways, as \neconomics and education.",
                "This example can be followed by other colonies, for the benefit of their\nmembers. Why our children must travel so far to their schools, as has been\nthe case with children in South Chicago, who made daily trips to Calumet\nCity, or must enroll in a Catholic school, where religion is the major\nsubject."
            ],
            "dateFull": "1928-09-06",
            "dateText": "Sept. 6, 1928",
            "dateYear": "1928",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0036",
            "title": "School in South Chicago",
            "topTitle": "Amerikanski Slovenec"
        },
        "chicagoforeignl0chic_0037": {
            "codes": [
                "ia2a",
                "iib1c"
            ],
            "content": [
                "We all know well that without our support the Slovene Catholic schools\ncannot exist. We do not need to tell you, people, here that our schools\nin Chicago badly need our support, and that it is our duty to extend a\nhelping hand.",
                "Therefore we invite you all to come next Saturday to a Catholic carnival,\nwhere we will double our joy by entertainment and by enlisting in the\nlives of benefactors of our schools."
            ],
            "dateFull": "1926-10-02",
            "dateText": "October 2, 1926",
            "dateYear": "1926",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0037",
            "title": "Carnival of St. Stephan",
            "topTitle": "Amerikanski Slovenec"
        },
        "chicagoforeignl0chic_0038": {
            "codes": [
                "ia2a",
                "ia1a"
            ],
            "content": [
                "Our church holds itself responsible for the spiritual welfare of its\nmembers and insists that the same responsibility should be applied in\nthe religious relationship between Catholic parents and their children.\nPeople are the children of the Catholic Church, and why should not the\nchurch responsibility be followed in the case of parents and their off-\nspring? We believe that everybody understands the value of religious\neducation for our children.",
                "If it is true that only parents brought up in the spirit of the Catholic\nreligion can educate their children rightly, it is also true that only\nCatholic schools can give the children the right kind of education.",
                "The only objection against sending children to Catholic schools, as we\nknow, is the small fee of 50 cents a month which these schools charge.\nThis is the reason why Catholic parents send their children to public\nschools instead of Catholic schools. Public sohools are good in every\n\nrespect, but they do not offer the Catholic discipline which is of so\ngreat importance in building the child's character.",
                "There is no better place in the world to get religious education than\nthe Catholic schools.",
                "Parents. we warn you of your responsibilities\nas members of the Catholic Church, and hope that our voice will be heard\n and the church rules obeyed."
            ],
            "dateFull": "1925-08-26",
            "dateText": "Aug 26, 1925",
            "dateYear": "1925",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0038",
            "title": "Send Your Children to a Catholic School",
            "topTitle": "Amerikanski Slovenec"
        },
        "chicagoforeignl0chic_0040": {
            "codes": [
                "ia2a"
            ],
            "content": [
                "We, Slovenes in America, do not have so many cultural institutions. Next\nSunday, June 14, we can consider as a day of great importance for all\nSlovenes in America, and especially for our people living in the small\ntown of Lemont. Illinois.",
                "On this memorable day our people in this town will have a happy occasion\nto witness the brilliant celebration of the opening of the institution,\nthe only one of its kind in America, the new Catholic College of St.\nFrancis. We have not enough words to describe fully the great importance\nof this cultural institution, its role to be played in cultural life of\nour people, not only in Lamont, but in all places of this country where\nour people exist. We believe that the opening of this institution will\nstart a new era in our life.",
                "The main purpose of this college is to give our people highly educated\nspiritual leaders and priests. Also to build a center from where culture\n\nwill be radiating among our people. This institution has also other\nnoble ideals, as to guard our religious standard from our enemy, who\nis doing its destructive work from its nest in Lawndale Street, Chicago.\nReligion is a great power and necessity in our life, and everybody who\nworks against such power is really offering very bad service to our people."
            ],
            "dateFull": "1925-06-12",
            "dateText": "June 12, 1925",
            "dateYear": "1925",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0040",
            "title": "New Catholic College in Lemont, Illinois",
            "topTitle": "Amerikanski Slovenec"
        },
        "chicagoforeignl0chic_0043": {
            "codes": [
                "ia3",
                "iib2f",
                "iib2g"
            ],
            "content": [
                "The purpose and activities of the Educational Division of the Jugoslav Socialist\nFederation have been outlined a number of times before. Still there is that\nclamoring for more information from many of our friends. We have decided,\ntherefore, to give a brief and accurate account below, paying particular attention to the necessity of education to all the workers. and especially to the’\nJugoslavs.",
                "Education is the prime factor of all progress. If you go back into the dark\nages, you will find that those races that adopted newer, more practical methods\nas a result of many experiments, held the controling power of the earth. The\nearly centuries produced the forward looking elements of Greek and Roman philosophers who lifted their races above those of the barbarians. But leave what\nis gone, behind. Education today is a necessity. It is necessary that you\nstudy and learn daily because you may have work today, but tomorrow you might\nbe obliged to look for it elsewhere. You must know what you are doing because,\nafter all, you are selling for a small salary your ability, which in turn de-\npends upon your knowledge - that is your answer. Education is your means of\n\nsecuring food and shelter so that your body may live. It is just as essential\nas food and clothing.",
                "Not only should you know and learn more about your daily earning power; you must\nalso know and learn about the wonderful human mechanism, your system. What to\ndo and what not to do when sickness overtakes you; what is good and what is bad\nfor it.",
                "To keep in constant touch with the world, you must read and study periodicals,\nbooks, eto., just as most of you must follow the procedures of your fraternal\nsocieties to know what it is doing or what it contemplates to do.",
                "There are countless numbers of features about which we know very little. You\nmust know art to love it - song to admire it; but more attention to it together\nwith your incessant desire to know, to learn, will bring art closer to your eyes\nand song closer to your ears.",
                "It has been conceded so often that centralization of all groups and organization \nenables and permits them to function better, and that all such centralized work\nis less expensive. One group can do little, but one hundred groups united can\n\ndo much; because separate groups operating alone would gain less exerting the\n\nsame amount of energy than a centralized union of many such groups.",
                "The Jugoslav Socialist Federation under date of November of }921, organized this\n\nCentral Educational Division for the purpose of:",
                "First: (a) Supply such literature which would eventually persuade its readers to\n\nlook toward the future, even though we perish without securing that for which we\n\ncrave.",
                "(b) Literature which will describe the vast natural resources and the\n\npowers that now exploit it, with the tendency and argument that this world with\n\nall its beauty, power, and raw material, rightfully belongs to you, who work from\n\nday to day to make it bigger and better, as much as it does to those who have\n\ndone nothing, but still claim it.",
                "Second: (a) By elevating our social lives to greater heights; teaching and encouraging plays of meaning and benefit, as well as plays of amusement. For \n\nafter all, a worker needs to laugh to keep fit, much more than a non-producer.",
                "(b) Supporting those musically inclined to satisfy their hearts’ greatest desire to keep on singing merrily in spite of‘ our many hardships. Life with-\n\nout music - would there be any?",
                "Third: (a) To arrange and prepare lectures.",
                "(b) Discussions.",
                "(c) Debates.",
                "People of our race will much more readily comprehend our views when a fluent\n\nspeaker addresses them with knowledge and gesture - one who has a sincere desire\n\nto help people understand, giving everyone an equal opportunity to express his\n\nviewpoints on questions of vital importance.",
                "Fourth: To inspire, teach, and uphold the truth above everything else in spite\n\nof all our handicaps.",
                "The Educational Division of the Jugoslav Socialist Federation has supplied literature which is fit to read and has helped in the uplift of our social, dramatic,\n\nand musical lives. It has prepared lectures, discussions, and debates for the\n\npast seven years. and its membership grows each year; for as the work expands,\n\nit speaks for itself. It is self-evident that from the growth of about forty\n\n\n\norganizations, contributing the first year to one hundred and six organizations\n\nfor 1927, ours is a worthy cause deserving all the support you and your branch\n\ncan give it.",
                "While it is true that much of this material may be obtained at school, it is\n\nalso true that our Jugoslav race has had but an inkling of it. You are one of\n\nus; it is your duty to yourself and to your friends to work in behalf of this\n\neduoational division. It is not too late to enroll for 1928. Address all correspondence \nto Mr. Charles Pogarelec, 3639 W. 26th St., Chicago, Ill."
            ],
            "dateFull": "1928-04-26",
            "dateText": "April 26, 1928",
            "dateYear": "1928",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0043",
            "title": "Educational Department of Jugoslav Socialist Federation",
            "topTitle": "Proletarec"
        },
        "chicagoforeignl0chic_0049": {
            "codes": [
                "ib2"
            ],
            "content": [
                "For the past seven years the American people have been feeling the taste\nof prohibition. This law was enacted during the war and its enforcement\nis getting tougher. Prohibition is commonly known. as the Volsted Act;\nit acquired this name from Senator Volsted, who was the father of the\nAct.",
                "It is a known fact that this Act was not accepted so cheerfully by\nthe drinking public, and Volsted has been cursed by this class of people,\nbut still Volsted eagerly defended his Act. He sincerely believed that\nby enforcement of this Act, the country would greatly benefit by eliminating \nlots of evils. He also believed that his Act would cut down\nheavy drinking, but he overlooked the fact that prohibition developed\nsuch enormous corruptions that government and people really got to \nthinking which was better: corruption or free drinking.",
                "Seven years of prohibition experience shows us that despite strong\n\nenforcement of the Volsted Act, we in America have as many drunkards\nas it was registered before prohibition era. On another side it is\nalready a proven fact that thousands of innoceent people paid with\ntheir lives enjoying bootleg liquors of various kinds.",
                "During the prohibition era a great many enormous and small fortunes\nare made. \"Beer flats\" and \"big shots\" of lawbreaking organizations\ndeveloped the system of bribing police, and without any interference\nwere selling openly \"poison drinks\" for the prices from 25 to 75 cents.",
                "No wonder that a great many millionaires with an army of hoodlums were\nreaping profits.",
                "The Catholic Church teaches people to be humble. It preaches to its\nfollowers that being humble is the greatest asset in character. Over-\n\ndrinking can be considered as a debit in good character; it is a sin\nagainst religion.",
                "Our church leaders openly opposed prohibition, which become cow for\nnumberless politicians, officials and boot-leggers. Prohibition in a\nform as it exists nowadays, is nothing more than a sort of fanaticism\nand as such will not bear wholesome fruits. The people in their majority,\nespecially people of Slav extraction, are against prohibition."
            ],
            "dateFull": "1926-02-17",
            "dateText": "Feb. 17, 1926",
            "dateYear": "1926",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0049",
            "title": "People‘S Sentiment against Prohibition",
            "topTitle": "Amerikanski Slovenec"
        },
        "chicagoforeignl0chic_0053": {
            "codes": [
                "ic",
                "iiic",
                "ia2a"
            ],
            "content": [
                "It is pleasant to know that Croats and Slovenes united together in reli-\ngious and social work in South Chicago. As a result of this cooperation\nwe have a new church building with a school, which has over 250 children\nalready. Just a few blocks away we have another school of St. Patrick's\nChurch. This school has 320 children. There is also St. Jury's School, with\na large number of children enrolled. Our schools have, beside Slovenian\nand Croatian children, also Polish, Slovak and Italian. All those nationalities heartily support our church and school. This just shows that great\nwork can be done if all our people get together and forget their misunderstandings. At least our school problem is solved to a certain extent,\nso far as South Chicago is concerned.",
                "It was really hard for our children to walk or ride every day to the\nCalumet Public School, and now when we have three schools of our own.\nchildren will enjoy school work and save their energy."
            ],
            "dateFull": "1928-09-06",
            "dateText": "Sept. 6, 1928",
            "dateYear": "1928",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0053",
            "title": "[Croatian and Slovenian Schools]",
            "topTitle": "Amerikanski Slovenec"
        },
        "chicagoforeignl0chic_0055": {
            "codes": [
                "id2a",
                "ie"
            ],
            "content": [
                "The Daily Socialist issued an extra number for the benefit of tailors on strike\nin Chicago. The net profit from the sale of this extra issue, as well as moral\nsupport, will be offered to the strikers."
            ],
            "dateFull": "1910-12-13",
            "dateText": "December, 13, 1910",
            "dateYear": "1910",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0055",
            "title": "Help the Strike!",
            "topTitle": "Proletarec"
        },
        "chicagoforeignl0chic_0057": {
            "codes": [
                "id2b"
            ],
            "content": [
                "A charter for a South Slavic Cooperative Printing Establishment has been issued\nand registered in Cook County on the seventh day of September under No. 4824970.",
                "This charter shows that the aforenamed establishment will issue stock of one\nthousand dollars per share with a maximum capitalization of ten thousand dollars."
            ],
            "dateFull": "1911-10-03",
            "dateText": "Oct. 3. 1911",
            "dateYear": "1911",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0057",
            "title": "South Slavic Cooperative Printing Establishment",
            "topTitle": "Proletarec"
        },
        "chicagoforeignl0chic_0059": {
            "codes": [
                "id2c",
                "iid10"
            ],
            "content": [
                "Collections for the unemployed have been received in the church of St.\nStjefen, and brought a sum of $240. Gifts are received daily. Our relief\norganization is working hard in order to meet the great need. This organization is planning to open branches.",
                "Headquarters for this relief organization have been established at 1852\nW. 22nd Place, Chicago.",
                "Chicago and vicinity are showing deep interest in this noble action.",
                "Branch managers are asked to send their reports daily in order to coordinate\nthe fast growing and complicated work."
            ],
            "dateFull": "1928-01-26",
            "dateText": "Jan. 26, 1928",
            "dateYear": "1928",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0059",
            "title": "Slovenian Relief Organization",
            "topTitle": "Amerikanski Slovenec"
        },
        "chicagoforeignl0chic_0060": {
            "codes": [
                "id2c"
            ],
            "content": [
                "Unemployment nowadays is as bad with Slovenes as with a great many people\nin America. We Slovenes, it seems, have been hit harder than people of\nany other nationality for the simple reason that the majority of our \npeople are employed in two major industries: steel and coal mines. Both\nabove named industries are suffering hard from lack of production, so\nworkers get laid off daily and (are) thrown on the streets.",
                "The coming winter surely will bring a lot of sorrow, and even tragedy, to\nour people. Those who have been hit by the depression or suffer from\nlack of employment must be helped, and that help must come first from \nus. Last Saturday St. Stjefan Society invited all Slovenes in Chicago \nto be present on a special meeting, where plans for relief to the unemployed\nwill be discussed.",
                "We Slovenes always have been known as a people with kind hearts, and \nwe sincerely believe that on this occasion our help will come quickly and sufficiently."
            ],
            "dateFull": "1928-01-11",
            "dateText": "Jan. 11, 1928",
            "dateYear": "1928",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0060",
            "title": "Our Duty to the Unemployed",
            "topTitle": "Amerikanski Slovenec"
        },
        "chicagoforeignl0chic_0062": {
            "codes": [
                "ie",
                "ig"
            ],
            "content": [
                "Although it is impossible to forget, we can and should disregard our\ndiversified folly during the entire lifetime of the modern Socialist\nmovement throughout the world. By \"disregard\" I mean that we should\nlet bygones be bygones except for what we can learn from them, and\nthrow overboard all grudges we have accumulated against each other\nduring all these years in factional battles under different realms,\nwhile believing fundamentally, practically in the same principles as\nto what must be our future social order, to render equality, justice\nand international tranquillity to all mankind.\nThe main economic question is to change from private ownership of\nnatural and produced wealth to Socialism, under such regulations\nthat everyone from twenty to sixty years of age who is able-bodied\nand willing to work will have a position with enough earnings to\nbe able to acquire all the necessities of life, and the government\nwill take care of the disabled, sick, minors and the old and provide\n\nthem with sufficient income to be able to enjoy life.",
                "The machinery of production and transportation is at present so highly\ndeveloped that if properly applied to relieve the physical work of man,\na workday to produce the necessities of life would be only three or\nfour hours long.",
                "Since nothing is impossible, this will come in due time. But what will\nthe world do with it if it retains the present social order? Unemployment, \ncomparing our present state of things to the future highly\ndeveloped mechanism when man's physical endeavor will be spared, even\nbutton pressing will be replaced by telepathy, would increase to at\nleast ninety per cent of the entire population of the globe. That would\ncreate unbespeakable starvation on one side, and a wild search for\nmarkets by private capitalists on the other.",
                "Consequently, all capitalistic countries would be constantly engaged\n\nin hostile international strife; war after war would be declared by\nmasters to conquer new world markets, and all the fighting would be\ndone by the economically enslaved people that have nothing to fight\nfor. To escape such tragedy we must take in due time proper steps\nto eliminate all causes for international hate by expropriation of\n\npolitical power and economic wealth, and then establish the new social\n\norder of justice, peace and universal tranquillity. Thinking about\n\nthis I distinctly remember what our late comrade, E. V. Debs, in\n\na fiery speech in Chicago after his release from a federal prison\n\nbluntly and defiantly declared: \"I wouldn't go to a capitalistic\n\nwar at the point of a bayonet!\"",
                "Let that be well remembered by our younger generation. Fratricide\n\nin our schismatic political struggles is the worst curse we can\n\nindulge in in our organizational endeavor to unify mental and physical workers of the world.",
                "Let us discard this in favor of a new and more plausible motto: \"With\n\n\n\nmalice toward none who believe in our fuudamental principles of socialization and equal distribution of national income.\" In unifying the\n\nworking class we will be inconceivably more successful through fraternal\n\ntolerance than we have been heretofore by our condemnable schismatic\n\nquarreling in factional divisions, trying to impose on each other our\n\ndifferent petty opinions that should not, and in fact do not, change\n\nthe basic idea of the whole economic scheme on which the entire new\n\nsocial order will be built.",
                "Spread this doctrine by press and spoken word throughout the land,\n\nbuild up our newspapers and local organizations, and we will have\n\na unified international, fighting, political organization.",
                "Let us dedicate ourselves wholeheartedly to support the Socialist\n\nideals till our battle is won for all humanity. Let us shorten the\n\ndistance between now and the dawn of our emancipation by united action.",
                "Crush private capitalism and establish a new social order; this is\n\nour most pertinent task to accomplish during our lives.",
                "Frank S. Tauchar."
            ],
            "dateFull": "1937-05",
            "dateText": "May 1937",
            "dateYear": "1937",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0062",
            "title": "Our Past and Future",
            "topTitle": "Majski Glas (May Herald)"
        },
        "chicagoforeignl0chic_0067": {
            "codes": [
                "ie",
                "iib2d"
            ],
            "content": [
                "This year's issue of the May Herald is a jubilee number, dedicated to the 30th anniversary of our weekly, Proletarec.",
                "This occasion is rare, because very few Socialist paper were able to struggle along for such a length of time. Our paper succeeded. Now it goes into its fourth decade, young in its inspiration, full of pep and\nwith determination to continue its battle for the interest of the workers.",
                "Proletarec has witnessed a great number of publications succumb. Foreign language groups of the Socialist movement, with few exceptions, lost ground and some disappeared.",
                "The Slovenes, who are one of the smallest nationalities in thsi country and who in teh period after the war constituted 90% of the membership \n\nin the Jugoslav Socialist Federation, are relatively the strongest foreign language section in the American Socialist movement. Only the \nFinnish Federation could show a better picture than ours. After the \nWorld War the American Socialist Party was completely destroyed in many localities. Our branches then replaced the Socialist Party for \na few years in quite a few places, especially in Western Pennsylvania, Michigan, Northern Minnesota, Western Ohio, and even in Cleveland and\nDetroid, until the general movement was revived.",
                "It was not our ambition to play this leading part. This siutation affected our movement rather in a very harmful way, because the bulk\nof the membership was discouraged. If Americans don't care, why should \"we spent our money and time\" inquired many of our comrades.",
                "Here and there an American branch was established. Our comrades thought that they would be an encouragement to them, but instead they asked for\nsupport, mostly financial support.",
                "This situation gradually discouraged a great number of our members, who \nthen became passive or even withdrew from the movement. Others continued with their work, believing in the historical mission of the Socialist \nmovement so much that they would not resign from the task under any circumstances.",
                "Beside the Finns there is no other nationality in America in which the \nSocialist movement, proportionately, is as firmly established as in ours. That is the result of the 30-year work of our branches and their\npaper, Proletarec. In conclusion, let it be stated that we always worked for the unity of the labor movement. Our task is to help build a Socialist \nmovement, not quarreling factions. This is the purpose Proletarec and our federation are serving. We are in battle for a bigger and better Socialist\nparty, for building the Socialist press. This was the aim of Proletarec 30 years ago. It still is and it will be until our final victory.",
                "Frank Zaitz."
            ],
            "dateFull": "1935-05",
            "dateText": "May 1935",
            "dateYear": "1935",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0067",
            "title": "The 30th Anniversary",
            "topTitle": "Majski Glas (May Herald)"
        },
        "chicagoforeignl0chic_0070": {
            "codes": [
                "ie",
                "iib2d"
            ],
            "content": [
                "The American Socialist movement has great cause to send its heartiest \nfraternal greetings to Proletarec in its 30th year of publication.",
                "Through Proletarec the Socialist Party of the United States of America\ngreets the Jugoslave comrades who ahve shown such a great spirit of self-sacrifice, enthusiasm, devlotion and loyalty to the Socialist cause. In\na movement where sacrifices on the part of members are everywhere prevalent, it is still necessary to point out the special sacrifices made\nby the pioneers who founded Proletarec and kept it alive until it could stand on its own feet.",
                "The struggles of Proletarec reflected the struggles of the American-born Socialists to keep their organization alive in spite of war, post-war\nprosecutions, the insanity of Communist splits, and then the complacency of prosperity.",
                "Fortunately, the American movement is now coming of age and is throwing off the defeatism which its years of retreat brought.",
                "During 1934 more new recruits were taken into Socialist ranks than any\nother year since 19, with the exception of national campaign year 1932.",
                "More pamphlets and leaflets were distributed, more radio speeches were given, more outstanding speakers ranted, and more organizers toured\nthan in any other comparable years since the war.",
                "The American movement which for a long while had to lean heavily upon the arms of the foreign comrades, now is able to strike out ahead on its own strength and responsibility. Only five short years ago the foreign language federation of the party included fifty-five percent\nof its membership. Today the foreign language federations have increased\n\ntheir members, but because of a much greater increase in the English-speaking ranks \nthe foreign language federations represent only 18% of the Socialist Party's total membership.",
                "The party has three times as large a proportion of industrial workers in its ranks as the country as a whole. Increasingly, the farmers of\nAmerica are becoming interested in Socialism and enrolling under the \nSocialist banner. The outstanding work done by the party in the defense \nof the union strikers of Ohio and in the organization and defense of the \nsharecroppers organized in the Southern Tenant Farmers' Union have been\noutstanding instances of the party's farm work.",
                "The party is on the road to success. With the splendid cooperation that\nthe Jugoslav comrades have shown, with the heroic team work on the part\nof the thousands of new recruits that have come into the movement in\nthe past few years, we will have in America Socialism in our time.",
                "Clarence Senior."
            ],
            "dateFull": "1935-05",
            "dateText": "May 1935",
            "dateYear": "1935",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0070",
            "title": "Boldly Forward",
            "topTitle": "Majski Glas (May Herald)"
        },
        "chicagoforeignl0chic_0073": {
            "codes": [
                "ie",
                "ic"
            ],
            "content": [
                "It is a well known fact that our Slavic people is the hardest to agree\nwith other people's opinion. no matter what question is put up. We will\nstubbornly stick to our opinion. even if we perfectly understand that\nsuch opinion is wrong.",
                "The study of our people here, in America, convinces us that a great many\nchanges have been made under the moon, but our character and our nature\nof being stubborn remained unchanged, despite new customs, circumstances,\netc.",
                "Here is a plain illustration: Right here, in America, we have over\n200,000 people of our race, but believe it or not, a group of 700 Socialists want to rule our entire population. Of course, we will resist and\nwe will win our political freedom, but at the same time we are not surprised \nat all at the courage of the socialists when we see so much disagreement \nand deep misunderstanding existing among our leaders. This\n\ndisagreement has no base, and is nothing more than a result of a play of\n\"who will outsmart who?\" But the masses must, as usual, pay for this.",
                "We are sincerely warning our leaders that it will be in their interest\nas well, as it will bring lots of good to our community if they stop\nharmful egoistic propaganda; otherwise the undesirable Socialists will\nreally gain influence among our people."
            ],
            "dateFull": "1935-01-20",
            "dateText": "Jan. 20. 1935",
            "dateYear": "1935",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0073",
            "title": "American Slovenec against Socialism",
            "topTitle": "American Slovenec"
        },
        "chicagoforeignl0chic_0075": {
            "codes": [
                "ie",
                "if6",
                "id2c"
            ],
            "content": [
                "All over the world, except Russia, exists the most bitter economic and industrial depression in the history of mankind. Millions of workers have become\nvictims of want in lands of abundant foodstuffs and all other needs.",
                "In the United States alone, approximately 10,000,000 workers have no employment.\nOur governing powers make as adequate measures for relief as the situation\ngrows worse. Primary elections of the Republican and Democratic parties again\noonfirm the belief that politicians were not concerned about the vital issue\nof unemployment that is driving the people to desperation and starvation. Their\nobject was to get elected by exposing their opponents to graft, corruption, and \nshowing what bitter enemies they were to the working class.",
                "It is the old traditional game of mud-slinging; but when a third party arises,\nboth Republican and Democratic parties unite under a camouflage of non-partisanship and fight desperately against any movement of the working class.",
                "Within the next few weeks presidential candidates for the Fall election will be\nnominated. Every effort will be made to get the support of the people for the\ncrooked politicians. Huge sums of money will be squandered for campaign purposes.\n\nSome candidates spend ten times more money to get elected then the salary brings.\nWhat is the purpose of this mad scramble for office?",
                "Surely these would-be friends of labor are not going to serve the interests of the\npeople who contribute for the people who contribute nothing to their campaign\nchests, but instead will support their financial backers for the large donations\nand personal interests. This has proved to be a fact time and again; and when\nthe great mass of workers lose patience with one administration, they flock to\nsupport the other. Due to their inability to see, they do not realize that both\nthe old parties are owned and oontroled by the capitalist class.",
                "It is futile to hope for anything better while they are at the helm.",
                "\"Of all times, this is one time when every American Socialist should be on the\njob, building socialist circulation, socialist organization\", said a columnist\nin the American Guardian not long ago.",
                "We can not stress too highly this important work for our movement. In the midst\nof all misery and hardship that people must suffer under capitalism, they are\ntoday more willing to listen to our message; and the need is greater than ever\n\nfor such work in the coming elections.",
                "In some states the Socialist party is not a legal party, because laws have been\nenacted which demand an outrageous percentage of votes to get on the ballot.\nThis is another burden we must overcome. Petitions signed by citizens who did\nnot vote at primary elections are the only read open for us. Each and every\n\ncomrade will be called upon by the party to join this army of solicitors.",
                "With the cooperation of all, we look forward to a new society to replace the\n\npresent broken down regime, which benefits the few while millions of workers\n\nare left to look out for themselves. We will not only accomplish our goal, but\n\ndemonstrate an impressive demand upon the money lords that the people are well\n\naware of who are responsible for the existing conditions.",
                "Branches of J.S.F. will also find plenty to do in the next few months. Several\n\nof our comrades in different states have been nominated on the Socialist ticket.",
                "Plans will have to be arranged for public meetings and speakers.\n\nCirculars and leaflets will have to be distributed to call the attention of workers\nto our cause. Every comrade - yes, the young folks too, must volunteer for\n\n\nthis duty and help carry on the work. Victory for our cause will not be handed to us. We must organize, plan our campaign, and bring the issues to the\n\npublic.",
                "Socialist victories in Milwaukee, West Allis, Racine and other cities in Wisconsin \n\nwere by no means easy to attain. Opponents, financed by business enterprises, \nthe powerful press, representing the interests of capitalists. the radio.\n\nand all other agencies, used by politicians to uphold the system to benefit\n\ntheir masters, waged a bitter battle against the common people.",
                "This is a fine example of what can be done and must be done to bring about a\n\nchange in the society that will be of, for and by the working class.",
                "The present system of capitalism will destroy itself just as feudalism and chattel slavery passed out of existence, and a higher social order will take its\n\nplace. Only through effective political and industrial organization of all\n\npeople can we hasten its extinction. Comrades, let's face this task squarely,\n\ndo our duty so that we may have and enjoy Socialism in our time.",
                "Let's rally under its banners and join hands with the workers in the great cause\n\n\nfor the cooperative commonwealth. On this May-Day let us rejoice over what\n\nhas already been accomplished. and renew our enthusiasm for our work until the\n\ngoal is reached.",
                "John Rak."
            ],
            "dateFull": "1932-05-01",
            "dateText": "May-Day Issue, 1932",
            "dateYear": "1932",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0075",
            "title": "Our Job for Socialism",
            "topTitle": "Proletarec"
        },
        "chicagoforeignl0chic_0080": {
            "codes": [
                "ie",
                "iib2d"
            ],
            "content": [
                "The Jugoslav Socialist Federation had its beginning in 1900, when the first socialist \nbranch of Slovene workers was organized in Chicago. Its members took the\nleading part in establishing a corporation, starting with a paper, which was\nfriendly to the Socialist movement and mainly educational in purpose.",
                "The task for them at the time was too heavy and the result therefore a failure.\nThe branch was dissolved for two years. However, in 1903 the branch was restored\nand has been active ever since. With the appearance of Proletarec in 1906 and\neven before, because of the help of the weekly, Clas Svobade, other branches\nsprung up in various Slovene settlements.",
                "In 1906 and 1907 advanced workers of the Croat and Serb nationalities organized\nthemselves in the Socialist branches. In December 1909 a preparatory conference\nwas held in Chicago for the purpose of establishing a Jugoslav Socialist Federation.\nAll Jugoslav nationalities were represented (Slovene, Croat, Serb, and Bulgarian).\n\nThe first convention was held July 4 and 5, 1910 in Chicago, at which time the\nFederation was born.",
                "Mahlone Barnes represented the Socialist Party at this conference.",
                "The growth of the Federation after its inception was very fast. During and after\nthe war, however. many critica1 situations occurred. Our membership dwindled,\nbranches disappeared, and two publications were lost. One, because it changed to\na communistic paper, and the other was discontinued. Proletarec remained; advancing\nthe cause, represented by the Federation.",
                "It survived those stormy days and continued its struggle in the interest of the\nworkers. Its eighth regular convention will be held in Detroit, Michigan, May 30\nbeing the opening date. It will be in session three days.",
                "The future looks bright, because it belongs to the Socialist movement and Socialism."
            ],
            "dateFull": "1930-05-01",
            "dateText": "May 1. 1930",
            "dateYear": "1930",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0080",
            "title": "Jugoslav Federation",
            "topTitle": "Proletarec"
        },
        "chicagoforeignl0chic_0082": {
            "codes": [
                "ie",
                "id2c"
            ],
            "content": [
                "The Communists are trying hard to bring themselves close to the working\nclass and we must give them credit for being very unscrupulous every\ntime they want to pull a lie. We heard the confidential news that\nCommunists organized a new press bureau, whose aim is to propagate,\nprint, and distribute articles, with the keynote as to how the working\nclass in Russia enjoys heavenly privileges. In fact we and the majority\nof the world know that these stories and propaganda are ridiculous, full\nof lies, but still Communists are steadily pounding the same motive.",
                "As an example of this ridiculous propaganda we will ask the readers‘\nattention to a recently published article which was trying to employ\nstatistics as a convincing fact of the workers’ heavenly life in Russia.",
                "Among other things painting workers’ life we found that Communists\nproudly state that in Russia there are over 7,000,000 registered Communists. We must admit our skepticism concerning Communists‘ rights\n\nto rule and regulate the life of 165,000,000 Russians. We believe that\nthis country, with 120,000,000 population, will be a bit worried of\nhaving communistic rule or even influence, if we have 7,000,000 Communists here.",
                "Now comes the employment situation. This situation, no matter how much\ncolorful paint be spent by the govermnent-guided press, doesn't look\nso brilliant. Of course, very obliging Communist writers did not overlook the question of workers wages, which looks so big on paper but\ndo not mean very much in everyday life, if we just compare existing\nprices. With all will to believe that communistic workers‘ heaven\nreally exists, we hardly find trace of it, despite such bribes as\nthe Communist Press Bureau."
            ],
            "dateFull": "1926-04-09",
            "dateText": "April 9, 1926",
            "dateYear": "1926",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0082",
            "title": "Communists Are Bribing Workers' Press",
            "topTitle": "Amerikanski Slovenec"
        },
        "chicagoforeignl0chic_0084": {
            "codes": [
                "ie",
                "id1a"
            ],
            "content": [
                "The armistice between capitalists and workers did not last very long. The\nshort-lived peace came to an end. Strongly organized capitalism declared\nwar on the hard working class. which is trying to make an honest living.\nThis time capitalists found it necessary to put high pressure on the\nminers‘ union, and in all probability the capitalists will win again.\nThe disorganized working class will hardly resist the underground diplomatic\nwork of capitalists who do the best to employ the brightest brains\nin order to smash the workers‘ fully justified resistance and their fight\nfor honest existence.",
                "In this war a capitalist never overlooks even the dirtiest means to conquer the working class. The capitalist feel perfectly happy when they keep\nminers underground, where day is turned into night.",
                "It is time for the workers to realize the priceless value of workers‘ unity\nand solid organization, if they want to become winners instead of being\n\nalways the losers.",
                "Working conditions in all branches of industrial life, especially in the\nmining industry, is getting worse, and almost unbearable. Something has\nto be done, and this something, in our honest opinion, is the campaign\nfor unionization with strong support from the workers. Workers also must\nappeal to the government to stop giving support to capitalists."
            ],
            "dateFull": "1925-02-18",
            "dateText": "Feb. 18, 1925",
            "dateYear": "1925",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0084",
            "title": "Capitalists Again Declare War against Workers",
            "topTitle": "Amerikanski Slovenec"
        },
        "chicagoforeignl0chic_0086": {
            "codes": [
                "ie",
                "ia1a",
                "iiic"
            ],
            "content": [
                "Socialism is the main ideal which is to break down the great difference\nexisting between the capitalists and the working class. It must fight\nfor the equal education of the workers‘ children also.",
                "Capitalists are doing their best to provide the best education for their\nchildren, but the workers‘ children are obtaining education mostly from\npublic schools.",
                "Capitalistic schools are teaching their pupils Science and distributing\npractical knowledge, but the workers‘ children are \"fed\" with fairy stories\nfrom the Old Testament.",
                "A long time ago, People's schools became ineffective so far as their program\n\nwas concerned, and more and more adapted their program to serve the purpose \nof the capitalists‘, because, as the old proverb says: \"It is easier \nto rule the masses when they are ignorant.\"",
                "Socialism did not see children as future slaves of the capitalist regime,\nbut as full-fledged and equal members of society. Socialism is against\ncapitalistic culture, which is depriving the workers’ class of its rights to\nlive intelligently and comfortably.",
                "Schools in capitalistic countries are grooming reaction and military culture.",
                "Socialism, on the contrary, is striving to put the schools in the service of liberty\ndemocracy, and strives to make them free in all grades from grammar school\nto college.",
                "Socialism strives to make the present day schools Socialistic.\n\nFeudal masters in the Middle Ages kept the schools with the main idea of\ndeveloping good citizens of the feudal regime. Capitalistic governments of\ntoday have united their efforts with the church influence, and are doing\neverything possible to educate the masses to be obedient church followers,\ntireless workers, and soft material for exploitation. For this last reason,\ncapitalistic schools are in open war with the working class.",
                "The pious element should be entirely removed from the school program, because\nthe general purpose of the school is to teach Science, which will help us\nto improve our lives right here in this world, but not to prepare us for\nan imaginary life in the sky.",
                "The purpose of the school is to give the people practical knowledge, but\nthe schools of today are dominated with the idea of distributing theoretical\nand practically worthless information.",
                "Professional education is what the workers need badly. This type of\n\neducation will give us an opportunity to develop skill and gain knowledge\n\nin several lines, and make it easier for us to find jobs. In the situation\n\nas it exists now-a-days, a minority of skilled laborers and experts monopolize\n\nthe jobs. Socialist schools must develop in the pupils a sense of self-\n\nrespect and initiative, and open to them a new horizon for ambition, not\n\nhelpless slaves for capitalistic regime. Against the foolish theory of the\n\nsix days‘ creation of the world, we must place the Darwin theory. The modern\n\nschool, supported by scientists of reputation is exactly what we want.",
                "Capitalists should not rule the schools and make the system conform to their\n\nselfish desire to promote intellectual ignorance."
            ],
            "dateFull": "1919-03-27",
            "dateText": "Mar. 27, 1919",
            "dateYear": "1919",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0086",
            "title": "Socialism and Schools",
            "topTitle": "Proletarec"
        },
        "chicagoforeignl0chic_0090": {
            "codes": [
                "ie",
                "ic"
            ],
            "content": [
                "The Organizing Comittee of the United Jugoslav Socialist Organizations in Chicago\nannounced plans for a May-Day Manifestation, which will be held in co-operation\nwith Bohemian organizations on May 1.",
                "All organizations willing to participate in this manifestation should send their\nrepresentatives to Bohemian Hall, \"Spravedluost\" at Loomis Street and Blue Island\nAvenue, from which place the parade will begin to move.",
                "All organizations are urged to take part in the projected parade and to attend the\nmass-meeting following."
            ],
            "dateFull": "1916-04-25",
            "dateText": "April 25, 1916",
            "dateYear": "1916",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0090",
            "title": "May-Day Manifestation",
            "topTitle": "Proletarec"
        },
        "chicagoforeignl0chic_0091": {
            "codes": [
                "ie"
            ],
            "content": [],
            "dateFull": "1915-01-26",
            "dateText": "Jan. 26, 1915",
            "dateYear": "1915",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0091",
            "title": "Proletarec",
            "topTitle": ""
        },
        "chicagoforeignl0chic_0092": {
            "codes": [
                "ie"
            ],
            "content": [
                "The Slovenian Socialist Club No. 1 in Chicago organized a celebration in memory\nof the Paris Commune. This celebration took place Sunday, March 20 in the Grand\nHall on Central Avenue.",
                "The program was excellent. The Jugoslav Workers' Musical Bond and Jugoslav Workers'\nchoir offered numerous songs and other musical selections."
            ],
            "dateFull": "1910-03-22",
            "dateText": "March 22, 1910",
            "dateYear": "1910",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0092",
            "title": "Observance of Paris Commune",
            "topTitle": "Proletarec"
        },
        "chicagoforeignl0chic_0093": {
            "codes": [
                "ie",
                "iiia"
            ],
            "content": [
                "The principal aim of the Slovenian Socialist Organization in America is to organize \nall Slovenian workers into an International Socialist Party for the defense \nand interests of the working class, with no objection to religion or race;\nalso to work on a wide distribution of workers‘ literature and newspapers; to\norganize public lectures, meetings, etc.; also to advocate and help our workers\nbecome citizens of this country and enjoy the full rights of citizens; and help\nmembers with moral and financial support in case of need."
            ],
            "dateFull": "1909-09-14",
            "dateText": "Sept. 14, 1909",
            "dateYear": "1909",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0093",
            "title": "Aim of the Slovenian Socialist Organization in America",
            "topTitle": "Proletarec"
        },
        "chicagoforeignl0chic_0094": {
            "codes": [
                "ie"
            ],
            "content": [
                "The Slovenian Women's Socialist Club, \"Proletarka\", has been organized in Chicago.",
                "President: Berta Preshern",
                "Secretary: Mary Grilec",
                "Address: 674 W. 21st. Place, Chicago",
                "Monthly meetings: third week in month."
            ],
            "dateFull": "1908-03-10",
            "dateText": "March 10, 1908",
            "dateYear": "1908",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0094",
            "title": "Slovenian Women's Socialist Club",
            "topTitle": "Proletarec"
        },
        "chicagoforeignl0chic_0095": {
            "codes": [
                "ie"
            ],
            "content": [
                "Balance from June 20, 1907 -- $8.55",
                "Receipts",
                "Paid Out",
                "Fr. Podlipec, Pres.",
                "John Patrick. Treas."
            ],
            "dateFull": "1908-01-14",
            "dateText": "Jan. 14, 1908",
            "dateYear": "1908",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0095",
            "title": "Financial Statement of the Jugoslav Socialist Federation\nFrom June 20, To Dec. 1. 1907.",
            "topTitle": "Proletarec"
        },
        "chicagoforeignl0chic_0096": {
            "codes": [
                "ie"
            ],
            "content": [
                "The Jugoslav Socialist Club No. 1 has been\nestablished in Chicago. Its headquarters\nare at:",
                "Owner of the Premises: Fr. Mladieh",
                "587 S. Center Avenue. Chicago",
                "President: Anton Preshern",
                "Secretary: Frank Podlipec",
                "Meetings will be held on the last Saturday of every month."
            ],
            "dateFull": "1908-01-14",
            "dateText": "Jan, 14, 1908",
            "dateYear": "1908",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0096",
            "title": "Jugoslav Socialist Federation",
            "topTitle": "Proletarec"
        },
        "chicagoforeignl0chic_0097": {
            "codes": [
                "ie",
                "iib2d",
                "iiih"
            ],
            "content": [
                "At its last meeting, the Slovenian Socialist Club, in Chicago, drew up\nthe by-laws and regulations for the Slovenian Socialist Federation in\nAmerica, and asked that these by-laws be published in Proletarec for\nthe purpose of public acceptance. All comments pertaining to any\nchanges must be sent to Mr. Anton Preshern.",
                "The Slovenian Socialistic Federation in America is the propagator of\nthe socialist program of the Socialist Party in America.",
                "MEMBERSHIP",
                "Every person, male or female, of Slovenian descent, who is 18 years of\nage, and who recognizes the socialist teachings, will be gladly accepted\nas a member of this Federation. All members, active or inactive, of any\nsocialist lodge in America automatically become members of this Federation and may exercise their rights to vote.",
                "PURPOSES",
                "Purpose of this Federation is to spread socialist propaganda \neither in writing or in speech, and to spread socialist doctrines in\nAmerica and Jugoslavia.",
                "In order to fulfill these purposes, the Federation will organize\nlectures, and will print books, leaflets, pamphlets, newspapers, etc.",
                "BOARD OF DIRECTORS",
                "All affairs of the Federation will be supervised by the board of\ndirectors, which will consist of three branches: administration,\neditorial and controller.",
                "The administration branch will be supervised by six members: president,\nvice-president, financial secretary, editorial secretary, archive\nsecretary and his assistant. The editorial branch, as well as the\ncontroller branch, will be supervised by three members.",
                "ELECTION",
                "In December of each year the Federation will hold an election for a new\nboard of supervisors. For this election our first secretary will send\na printed ballot to all clubs in America. On distributed ballots,\nwill be printed the names of candidates. Because each club has its own\nelection rights it is permitted to elect its own candidate. In such an\ninstance the name of the candidate printed on the ballot can be scratched\nout and the candidate desired by the club may be substituted.",
                "The final decision in the election will depend on the majority of ballots\nreceived by the substituted candidate.",
                "In case of a tie in votes, a new election will be ordered.",
                "All ballots received after the month of December will be valid.",
                "Any changes desired pertaining to the election regulations must be\nnot later than the month of November.",
                "FEDERATION PRESS",
                "The official organ of the Slovenian Socialist Federation will be\nProletarec. The owner of this publication can be any member of the\nSocialist Party in America or Jugoslavia, who belongs to some club.\nThe editorial management is obliged to print any announcement,\narticle, debate, etc. , no matter what the critics say.",
                "In exceptional cases the editor has the right to request a correspondent's\nidentification as a member of the club.",
                "The treasurer of the Federation is requested to publish a financial\nstatement every fourth month in the official organ.",
                "SOCIALIST CLUBS",
                "In every town or city in America, where a substantial number of Socialists\nlive, they have the right to organize their own club and elect their\nboard or supervisors. Monthly reports of their doings will be accepted\n\nand published by Proletarec. Every Socialist living in Jugoslavia can \n\nbe a member of any club in America, no matter what nationality this\n\nclub represents.",
                "SOCIALIST COURT",
                "In case of a misunderstanding, or a quarrel between members of the Club,\n\nsuch affairs must be settled by the Club, or the Federation Honor Court.",
                "Each court consists of five members. In case of a tie in voting the\n\npresident's ballot will be the deciding vote.",
                "If any person in a case shows dissatisfaction with the court's decision,\n\nhe has a right to appeal to the Federation Court, whose decision will\n\nbe considered final.",
                "SUPERVISORS‘ DUTIES",
                "In case the board of supervisors shows lack of interest in fulfilling\n\n\n\ntheir duty, five members of the Federation can submit their complaint \n\nto the secretary-treasurer, who will ask the entire membership for its\n\nopinion by a vote of trust. In such cases the board of supervisors will\n\nbe suspended from their offices until the members‘ opinion is crystalized.",
                "In case of the resignation of any member of the board of supervisors, the\n\nsecretary will announce new elections.",
                "HEADQUARTERS OF THE FEDERATION",
                "The official headquarters of the Slovenian Socialist Federation is in\n\nChicago, Illinois."
            ],
            "dateFull": "1906-02",
            "dateText": "February 1906",
            "dateYear": "1906",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0097",
            "title": "By-Laws of the Slovenian Socialist Federation in America",
            "topTitle": "Proletarec"
        },
        "chicagoforeignl0chic_0104": {
            "codes": [
                "if2"
            ],
            "content": [
                "In regard to the resolution, which was accepted at a recent meeting of the \nRepublican organization and sent to several prominent leaders in Washington, we received the\nfollowing comments:",
                "United States Senate,",
                "Committee on Expenditures in the Department of State",
                "February 5. 1918.",
                "Mr. Charles Vosel, Chairman",
                "Mr. Frank Zaitz, Secretary S. R. Z.",
                "Chicago, Ill.",
                "Gentlemen:",
                "I am very much obliged to you for your communication of recent date, and I assure",
                "you that the views of your organization will have my most sincere consideration.",
                "Very Respectfully, Jas. Hamilton Lewis.",
                "2) Department of Justice,",
                "Washington, D. C.",
                "Frank Zaitz, Esq.",
                "Secretary of Local Organization S. R. Z.",
                "Chicago, Ill.",
                "Sir:",
                "The department is in receipt of a copy of the resolution adopted by the Slovenian",
                "Republican Alliance at a mass meeting held at Pulaski Hall on January 27, 1918, and",
                "thanks for transmitting the same.",
                "Respectfully,",
                "Charles Waren,",
                "Ass't. Attorney General",
                "For: The Attorney General"
            ],
            "dateFull": "1918-03-12",
            "dateText": "Mar. 12, 1918",
            "dateYear": "1918",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0104",
            "title": "Slovenian Republican Organization in Chicago",
            "topTitle": "Proletarec"
        },
        "chicagoforeignl0chic_0106": {
            "codes": [
                "if2"
            ],
            "content": [
                "Slovenian Republican Organization in Chicago is setting the stage for a concert\nand dance, to be held at 1709-15 S. Ashland Avenue, near 18th Street, Jan. 27.",
                "The program for entertainuent is varied and interesting, and we hope that our\nSlovenian people in Chicago and vicinity, who sympathize with Republican ideals,\nwill be present. Slovenians must show their solidarity in fight for social and\neconomic order in this land.",
                "Interest in the Republican Organization and its future is established by the fact,\nthat in a very short time after the Republican Organization opened a branch in\nChicago, we had over 800 members, with practically all Slovenian societies participating \nin the work of soliciting members. We are proud to announce the fact\nthat fifteen Slovenian societies have signed for membership of the Republican organization."
            ],
            "dateFull": "1918-01-15",
            "dateText": "Jan. 15, 1918",
            "dateYear": "1918",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0106",
            "title": "Concert",
            "topTitle": "Proletarec"
        },
        "chicagoforeignl0chic_0107": {
            "codes": [
                "if2"
            ],
            "content": [
                "Executive Board:",
                "Frank Bostich. Filip Godina, Martin Konda, Etlin Kristan, Frank Kerze, Anton\nTerlovec. Jose Zavortnik.",
                "Control Committee:",
                "Matt. Petrovich. Ludvik Benedik, Frank Verancich.",
                "Central Committee:",
                "John Ermec, Ivan A. Kaker, Ivan Kuzar, Anton Motz, Frank Mravlija, and others.",
                "Interest in Slovenian Republican Organization in America is growing so\nrapidly,\nthat members of this party in Chicago, found it necessary to aquaint our people\nhere with the aim of this organization, and decided therefore to organize a mass-\nmeeting on January 1. 1917 at 3 P.M. on the premises of \"Prosveta.\""
            ],
            "dateFull": "1917-12-25",
            "dateText": "Dec. 25. 1917",
            "dateYear": "1917",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0107",
            "title": "Slovenian Republican Organization.",
            "topTitle": "Proletarec"
        },
        "chicagoforeignl0chic_0109": {
            "codes": [
                "if6"
            ],
            "content": [
                "After receipt of the warrant for the arrest of M. Sullivan issued by Judge Horner,\nthe sheriff's office went on the trail of the former Clerk of the Probate Court in\nChicago.",
                "The sheriff is anxious to ask M. Sullivan a few questions concerning the disappearance \nof just $60,000 from the fund for orphaned children.",
                "Mr. Sullivan has been Clerk of this Court for the past seventeen years, and the\nshortage was discovered recently, after the accounts had been audited.",
                "Mr. Sullivan was given a considerable length of time to cover the shortage, but\nfailed to do so and the warrant was sworn for his imprisonment; but all efforts to\nfind him have failed and so the $60,000 is gone."
            ],
            "dateFull": "1915-07-13",
            "dateText": "July 13, 1915",
            "dateYear": "1915",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0109",
            "title": "Where Is $60,000?",
            "topTitle": "Proletarec"
        },
        "chicagoforeignl0chic_0111": {
            "codes": [
                "ig"
            ],
            "content": [
                "All Slovenian societies located and active in Chicago had a meeting, which took\nplace on September 21, 1918 at the hall, \"Little Bohemia\". The purpose of this\nmeeting was to organize subscriptions for \"Liberty Bonds\".",
                "The following societies were represented by their delegates:",
                "1) Women's Society 78",
                "2) Society: \"Neze\"",
                "3) Singing Society \"Lira\"",
                "4) Newspaper \"Proletarec\"",
                "5) Society: \"Slovenski Dom\"",
                "6) Society; \"Fr, Fekker\"",
                "7) Society: \"Slavia\"",
                "8) Society #17",
                "9) Newspaper: Cas",
                "10) Newspaper: Prosveta",
                "11) Society: \"Lincoln\"",
                "12) Society: \"Jugoslavia\"",
                "13) Society: \"Danica\"",
                "14) Society: \"St. Stefan\"",
                "15) Society #100",
                "16) Society: \"St. Deuzina\"",
                "17) Slovenian Worker's Sokol",
                "18) Society: \"St. Juraj\"",
                "19) Society: \"Narodin Vitezi\"",
                "20) Society: \"Woodrow Wilson\"",
                "This meeting showed the excellent spirit of Slovenian people and their hearty interest \nfor the welfare of their new fatherland, America."
            ],
            "dateFull": "1918-09-24",
            "dateText": "Sept. 24. 1918",
            "dateYear": "1918",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0111",
            "title": "Liberty Bonds and Slovenes in Chicago.",
            "topTitle": "Proletarec"
        },
        "chicagoforeignl0chic_0114": {
            "codes": [
                "iia2"
            ],
            "content": [
                "By Donald J. Lotrich",
                "For a good many years Building and Loan Associations have enjoyed the\nconfidence and good will of our people and have therefore played quite\nprominently in their lives. Particularly has that been true in localities \nwhere our people have settled more compactly and in larger numbers.\nSay what we will, these institutions have been used and are still being\nused by the progressive and thrifty elements as savings institutions.\nMany, many have used to advantage the credit and services of these\ninstitutions to acquire their homes. Some who were not so prudent or\nwho overestimated their earning ability and plunged too deeply into\ndebt, however, could not be rescued even by such institutions. Wherever\nthe management was wise and alert to the trends and conditions it can\nbe generally said that there the association was a great asset to the\npeople and to the community. The direct opposite is true wherever the\nmanagement ignored the principal factors of good business management\nand economic tendencies.",
                "The mere fact that we were able to survive the depression gives us\n\nassurance and courage to continue. But I know that mere words are\ninsufficient to assure anyone anything in the present capitalistic\nset-up. It's got to be more than that. Action must accompany words.",
                "Permit me to say, then, that the 1937 Board of Directors of the Jugoslav \nBuilding and Loan Association have adopted, among other things,\na goal of 160 new subscribers for 1937.",
                "Ten have already begun to pay their weekly allotments. Twenty two more\nhave pledged to do the same in a short time. We are intent on disposing\nof the real estate on hand and pay off the old obligations just as soon\nas conditions warrant.",
                "Incidentally, I might say that there is a brisk demand for homes and\nthat one property has already been sold and that a number of bids on\nother properties have been received.",
                "There can be no doubt but that the experiment of the Federal Government\n\nin providing mortgage credit through Associations like ours has proved\nsuccessful. Hence, there can be no doubt but that greater support and\na more definite desire to participate in the work of these Associations\nwill be the continued policy of the Federal institution.",
                "A nation's basic wealth is its land and homes and mineral deposits.",
                "With a well organized mortgage reserve system behind it, there is no\nsounder investment than the home mortgage cooperative units or mutual\nassociations give to the investor the maximum in returns. With management, \nforesight and vision there is every reason to believe that our\nassociations can still grow and prosper and give that service, both\nto investor and borrower, that was given in the past."
            ],
            "dateFull": "1937-05",
            "dateText": "May 1937",
            "dateYear": "1937",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0114",
            "title": "The Future of Building and Loan Associations",
            "topTitle": "Majski Glas (May Herald)"
        },
        "chicagoforeignl0chic_0117": {
            "codes": [
                "iia2",
                "iib2d",
                "iiib2",
                "iiic"
            ],
            "content": [
                "On the 15th of June the Catholic Printing Society \"Edinost\" held its regular\nconference of priests and shareholders of this society, from Chicago and\nvicinity.",
                "Rev. James Cerne, assisted by other priests, gave his blessing to the new\nprinting machinery and the premises occupied by the printing shop.",
                "After the blessing a banquet was given in honor of the guests and employees of\nthis shop. The premises had been decorated for this occasion. After supper\nthe president of the society, Mr. John Jerich, opened the program of music and\nsongs. Among the speakers we noticed a number of guests from Ohio, Wisconsin\nand Illinois. All speakers pointed out the great need of a Catholic press,\nand expressed the opinion that only through this press will the American\nSlovenes be successful in the political and religious fields.",
                "A comical interpretation of stories from Rev. Cerne's colorful life brought much\nlaughter. The speakers selected as their keynote the idea of propaganda for an\neducational campaign. All suggestions were accepted by the audience with applause.",
                "On this occasion we had the pleasure of hearing the brilliant voice of our well\nknown singer, Miss Kosmach, who gave an artistic touch to this meeting.",
                "In God we trust, and with His blessing upon our education work we strongly\nbelieve in our ability to carry on our national ideals with success, and\ngain dutiful recognition for our people here and abroad. Support, sympathy\nand recognition will be the best testimony that our ideals are accepted\nand are bringing happiness to our people.",
                "We rightfully call our society \"Edinost,\" which means \"unity”, and it means\nalso that we must strive to preserve this unity if we expect success and victory\nin our fight for existence as a Slovene nation. Such a noble goal as the\npreservation of national ideals is worth all the suffering, struggle and\nsacrifice in the world.",
                "Please do not refuse your support to our society, and the society will do its\nshare in building our national unity."
            ],
            "dateFull": "1925-06-18",
            "dateText": "June 18, 1925",
            "dateYear": "1925",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0117",
            "title": "Conference of the Catholic Printing Society Edinost",
            "topTitle": "Amerikanski Slovenec"
        },
        "chicagoforeignl0chic_0120": {
            "codes": [
                "iib1a"
            ],
            "content": [
                "In the year 1916 the Lira Singing Society was organized on the West Fide of\nChicago, in the Slovene community which has its center at Cermak Road and\nLincoln Street, as the Tamburica Society, taking its name from the popular\nJugo-Slav instrument. The organizers were William Prijatel and John Weble.\nThe club grew so rapidly that in a very short time it had eighty members.\nAt that time it had a number of sponsoring members, and so it was decided\nthat it was strong enough to add a singing group to the original instrumental \ngroup. The name of the club was changed, and it became the Lira Slovenian \nSinging and Tamburica Society.",
                "Its object was to promote Slovene singing and Slovene instrumental music.\nThe following persons were its officers at the time of its organization:\nJohn Weble, president, Adolph Misja, secretary, and Jack Muha, treasurer.",
                "The singing group was under the direction of Mr. Muha, while Mr. Weble directed \nthe tamburica-players. At this time both divisions advanced steadily, \nand the concerts which they gave were successful because the Lira was\nthen the only Slovene singing and tamburica society in Chicago.",
                "Since the World War had taken many of its members, the organization dropped\nthe tamburica division and continued as a singing society only. At present\nthe Lira Society has twenty active members, including three who have been\nwith the organization since the beginning, namely, Mrs. Lollie Nemanich,\nMr. John Weble. and Mr. Frank Kordesh. The Society for the last six years\nhas been without the financial aid of any sponsoring members and continues\nto maintain itself by giving concerts once or twice a year. In its repertoire \nare selections from various operas and operettas, such as Martha, The\nMinuet, Il Trovatore, and Madame Butterfly, and also many artistic Slovene\nsongs which had never before been introduced in Chicago.",
                "The fifteenth anniversary of the founding of the Lira Society was celebrated \non Sunday, April 3, 1932, by a concert in which some other Jugo-Slav\nsinging societies participated, among them two Slovene organizations, the\nAdrija and the Preseren, and one Croatian club, the Croatia. On various\nother occasions the Lira has cooperated with other Slavic singing societies.",
                "In the period of its existence the Lira Singing Society has had the following \ndirectors: Mr. Jack Muha, Mr. Arno M. Hess, Mr. Kindl, Mr. F. Kvederas,\nand Mr. Gabriel Chrzanowski. who has been our instructor since 1926.",
                "The officers at present are John Weble, president, Frank Kordesh, vice-president, \nEvelyn Fabian, secretary, Vera Kordesh, recording secretary, and\nLollie Nemanich, treasurer."
            ],
            "dateFull": "1934",
            "dateText": "1934",
            "dateYear": "1934",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0120",
            "title": "The Lira Slovene Singing Society",
            "topTitle": "Memorial Book of the First All-Slavic Singing Festival"
        },
        "chicagoforeignl0chic_0123": {
            "codes": [
                "iib1a",
                "iib2e",
                "va1",
                "iiic"
            ],
            "content": [
                "The name Adrija means Adriatic. The sky-blue Adriatic Sea has always been\nan object of tender affection and almost devout reverence for Slovenes, and\ntheir love for it is reflected in their songs. They share this feeling with\ntheir southern neighbors and kinsmen, the Croats. A number of Slovene and\nCroatian singing societies call themselves Adrija or Jadran.",
                "The Adrija Slovene Singing Society of Chicago is a mixed choir. Since its\norganization fourteen years ago the number of its members has fluctuated.\nThere have never been less than twenty-five nor more than forty-five active\nsingers.",
                "The Adrija choir is affiliated with the Slovene Roman Catholic Church of\nSt. Stephen, at Twenty-second Place and Lincoln Street in Chicago. Besides\nits liturgical singing in the aforesaid church the society gives one or two\nconcerts every year in the school hall adjacent to St. Stephen's Church,\n\nand it often renders programs for the lodges, clubs, and fraternities of the\nlocal community. It has also appeared on the concert programs of other Slovene \nsinging societies in Chicago, namely, the Lira, the Zarja, the Sava,\nand the Preseren, and at present it is cooperating; with the oldest and largest \nof them all, the Slovan. Adrija was the first Slovene choir in Chicago\nto attempt the radio field; it has appeared in four Slovene radio programs\nover Station WHFC and in one program over Station WCFL. A number of Slovene\nphonograph records are also included in its list of accomplishments. These\nlatter are characteristic sketches with dialogue and song, such as the Slovene \nWedding Festival, the Announcement of Spring (Advent of St. George),\nand others.",
                "The Adrija choir by its untiring efforts and commendable sacrifices was instrumental \nin securing a new electro-pheumatic two-manual organ for St.\nStephen's Church, installed February 19, 1928.",
                "The proceeds of the choir's various activities are turned over to the parochial \ntreasury, and its needs are provided for, and its expenses paid by the\nparish.",
                "New members for the Adrija choir are constantly being recruited from the\nranks of the local parochial grammar-school graduates.",
                "The director of the Adrija Singing Society is Mr. Ivan Racic, organist of\nSt. Stephen's Church. His connection with the choir goes back practically\nto its inception. Mr. Racic received some of his musical training in Europe\nand is now working for a degree in music at De Paul University in Chicago.\nHe was the unanimous choice for leader of the Slovene aggregation of singers \nat the First All-Slavic Singing Festival in Chicago."
            ],
            "dateFull": "1934",
            "dateText": "1934",
            "dateYear": "1934",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0123",
            "title": "Memorial Book of the First All-Slavic Singing Festival.",
            "topTitle": ""
        },
        "chicagoforeignl0chic_0126": {
            "codes": [
                "iib1a",
                "iib1c",
                "iib1c",
                "iid1",
                "iid2",
                "va1",
                "iiig",
                "ia1a",
                "id1b",
                "ib4",
                "ig",
                "ic",
                "iv"
            ],
            "content": [
                "Slovenes, like other Slavic nations, love and admire good music, vocal and instrumental. \nThey love to sing on every occasion - at picnics, parties, dances, weddings, \nand christenings. This racial characteristic was the potential reason for\nthe organization of the Slovan Singing Society twenty-nine years ago (1905) in \nSouth Chicago. Immigration to the United States was not restricted at that time, \nand thousands of young men and women from the former Austrian provinces of Carniola,\nCarinthia, and Lower Styria - all three included in Slovenia - crossed the Atlantic \nin the hope of earning a better living under Uncle Sam than under the Austrian\ndouble eagle. The group settling in South Chicago and the near-by Pullman district\nlost no time in organizing their fraternal lodges, for America, unlike Europe,\ndid not provide government insurance against loss by sickness or injury. They\nalso united to establish singing clubs in the early nineties.",
                "The Slovan Society was the first Slovene club organized with a single object - the\npreservation of Slovene song in Chicago. This purpose is still the only motive\nthat keeps the society in existence as years with their achievements roll by. At\npresent the Slovan is the oldest Slovene singing society in the United States; like\nother societies and clubs, it has had difficulties throughout its long career.\nFinancial problems, lack of proper instructors, the World War, emigration and\nimmigration restrictions were some of the obstacles which at times almost ruined\nthe organization. At present the Slovan has seventy active members, the majority\nof them men. Never before in its history has the Society had so large a membership.",
                "Throughout its twenty-nine years of existence the Slovan Society has regularly\ngiven one or more concerts a year; sometimes as a male chorus, sometimes as a mixed\nchorus, and as a male chorus at times including both choruses in its program. In\nformer years dramatic performances also were presented. The Slovan has at all times\nmaintained friendly relations with other Slovene singing societies, and on many\noccasions it has co-operated with Slovene, Croatian, Servian, and German clubs in\ngiving concerts. The outstanding events in the Society's history were the gala\nconcert performances on its twentieth and twenty-fifth anniversaries in 1925 and\n1930.",
                "An elaborate singing festival is contermolated for the thirtieth anniversary in\n1935. The Slovan is the only Slovene singing society on Chicago's greater South\nSide. Its present headquarters are in the Calumet Park field house. In the\ncourse of its existence the Slovan has had seven directors, and Mr. Mirko G. Kuhel,\n\nthe present director, has wielded the baton for the last nine and a half years.\n\nMr. Kuhel came to America fourteen years ago. He has been a student at St.\n\nStanislaus‘ College in Slovenia; he attended high school here and completed two\n\nyears of college-work. He was then appointed to an executive position in one of\n\nthe Slovene—American fraternal insurance corporations and since that time had very\n\nlittle leisure for other activities.",
                "Mr. Kuhel devotes his spare hours to directing the Slovan chorus because of his\n\nlove for Slovene song. Since he received his education on both continents, he is\n\nparticularly well adapted to give instruction in Slovene music both to immigrants\n\nand to American-born members of the choir. The Society has co-operated heartily\n\nin the movement to organize the United Slavic choral Societies of Chicago, and\n\nsincerely hopes that a permanent association will be founded."
            ],
            "dateFull": "1934",
            "dateText": "1934",
            "dateYear": "1934",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0126",
            "title": "Slovan Singing Society",
            "topTitle": "Memorial Book of First All - Slavic Singing Festival"
        },
        "chicagoforeignl0chic_0129": {
            "codes": [
                "iib1a"
            ],
            "content": [
                "Last Sunday our young singing society ‘Adria’ gave a very successful concert \nwith dance. On this occasion we noticed that our people got more and \nmore interested in that kind of entertainment. Many times we have called\nour public to support morally and financially our cultural institutions,\nand this call goes especially for the support of the singing society\n\"Adria,\" which in the short period of its existence already brought joy\nand happiness in the life of our colony.",
                "Our sincere thanks to all leaders and members\nof this organization."
            ],
            "dateFull": "1926-02-17",
            "dateText": "February 17, 1926",
            "dateYear": "1926",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0129",
            "title": "Concert by the Singing Society \"Adria\"",
            "topTitle": "Amerikanski Slovenec"
        },
        "chicagoforeignl0chic_0130": {
            "codes": [
                "iib1a"
            ],
            "content": [
                "Slovenes from Chicago and vicinity are cordially invited to a concert, to\nbe presented by our well-known Slovenian Workers‘ Singing Choir \"Orel.\" It\nwill be given on February 25, in the People's Hall, at Central Avenue and\n18th Street."
            ],
            "dateFull": "1911-02-21",
            "dateText": "Feb. 21, 1911",
            "dateYear": "1911",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0130",
            "title": "Slovenian Workers’ Singing Choir Orel",
            "topTitle": "Proletarec"
        },
        "chicagoforeignl0chic_0132": {
            "codes": [
                "iib1c",
                "ie"
            ],
            "content": [
                "The Dramatic Section, Club No. 1, of the Jugoalav Socialist Federation,\nis giving a play and social Sunday, March 27, in the C. S. P. S. Hall.\n18th and May Street, Chicago.",
                "They will present two plays: one in the Slovenian language, 'Lokalna\nZeljeznica\" (Local Train), in three acts, followed by \"The Family Exit,\"\nin English.",
                "The show starts at 3 P. M. A dance follows."
            ],
            "dateFull": "1927-03-24",
            "dateText": "March 24, 1927",
            "dateYear": "1927",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0132",
            "title": "Novi Svijet",
            "topTitle": ""
        },
        "chicagoforeignl0chic_0133": {
            "codes": [
                "iib1c"
            ],
            "content": [
                "November 14th is marked in memory of our people in Chicago as a night\nof excellent entertainment. Our society No. 16, D. S. D., gave a \ndramatic play, \"Sin,\" with the well known cast from the Catholic Dramatic \nClub. Despite the very poor employment situation which prevails\namong our people, the premises were filled up to the last inch and\ntickets were practically all sold.",
                "After the dramatic performance young and old joined in dancing, which\ncontinued up to the early hours of the morning."
            ],
            "dateFull": "1926-11-12",
            "dateText": "Nov 12, 1926",
            "dateYear": "1926",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0133",
            "title": "Night of Entertainment",
            "topTitle": "Amerikanski Slovenec"
        },
        "chicagoforeignl0chic_0134": {
            "codes": [
                "iib1c"
            ],
            "content": [
                "We say it is news! Our newly organized Slovenian Catholic Dramatic Club\ngave us its first performance, and it was good! For a long time we did\nnot have such opportunity to enjoy our native plays and hear our songs\nsung and we left the premises with a feeling that we spent a few delightful \nhours in our dear old country.",
                "This performance brought us so close together that even our deadly enemies \nforgot their bad feelings. We felt that we were brothers and belonged\nto the same race and nation."
            ],
            "dateFull": "1926-05-18",
            "dateText": "May 18, 1926",
            "dateYear": "1926",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0134",
            "title": "New Slovenian Catholic Dramatic Club",
            "topTitle": "Amerikanski Slovenec"
        },
        "chicagoforeignl0chic_0135": {
            "codes": [
                "iib1c"
            ],
            "content": [
                "The last winter season in Chicago was very joyful. Concerts, carnivals,\nbazaars, and all kinds of entertainment took place.",
                "The Catholic Dramatic Club of Chicago is especially showing great activity, \nand each time when some of our societies decide to hold a meeting\nor amuse the public, the Catholic Dramatic Club gladly accepts the invitation.",
                "We are requested by the management of the above named club to inform\nour societies that in case any of them desire to select their own play,\nit will be played by club members under one condition: That the society\nsend a request and the name of the play in written form to the secretary \nof the Catholic Dramatic Club, Mr. Ludurg Skaja, 2118 W. 21 st Pl.",
                "They also advise giving the club at least two weeks time in order to\nrehearse the play and be ready for a performance. We have also informed that the present staff of players is not (large) enough to cover some\nof the plays and we, with all our hearts, recommend those of our young girls and boys, who feel able to play, to enroll in the club immediately.\nIt really will be a pity for all of us if such a big colony as Chicago's,\nwith thousands of our people, would not be able to supply the necessary\nnumber of players and (thus) handicap the activities of this most important organization.d"
            ],
            "dateFull": "1926-07-15",
            "dateText": "July 15, 1926",
            "dateYear": "1926",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0135",
            "title": "Catholic Dramatic Club in Chicago",
            "topTitle": "Amerikanski Slovenec"
        },
        "chicagoforeignl0chic_0138": {
            "codes": [
                "iib1c",
                "iiie",
                "ie"
            ],
            "content": [
                "The League of Socialist Youth is arranging a bazaar to raise funds for\nthe support of the Daily Socialist newspaper. It will be held April\n27, 28, 29, and 30, in Schweitzer Hall, at Clark and Kinzie Sts. Tickets\nwill cost fifteen cents."
            ],
            "dateFull": "1911-04-18",
            "dateText": "Apr. 18, 1911",
            "dateYear": "1911",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0138",
            "title": "League of Socialist Youth Bazaar",
            "topTitle": "Proletarec"
        },
        "chicagoforeignl0chic_0140": {
            "codes": [
                "iib2a",
                "ie"
            ],
            "content": [
                "The Slovenian Library in Chicago organized by the Socialist Club No. 1, has become \nmore and more popular and can be considered as a public institution of high \nvalue. The management of this library does not spare efforts nor money in order\nto fill its shelves with books, magazines, periodicals, etc., printed in the\nSlovenian language. The greatest part of this reading material is ordered from\nLubljana, Jugoslavia.",
                "The library also has a large selection of books and periodicals printed in English\nfor those who know or want to learn English thoroughly. It is true that our\npeople help this institution, especially since we know that the fees are as low\nas $.15 per month.",
                "The library is open every evening from 7:30 to 9 P.M., and is located at 1830 S.\nCenter Street on the premises of the Croatian Library."
            ],
            "dateFull": "1912-11-05",
            "dateText": "Nov. 5, 1912",
            "dateYear": "1912",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0140",
            "title": "Slovenian Library in Chicago",
            "topTitle": "Proletarec"
        },
        "chicagoforeignl0chic_0142": {
            "codes": [
                "iib2d",
                "iib2d"
            ],
            "content": [
                "The Slovenian people in America are represented by more newspapers in\nAmerica than any other nationality, proportionally. We do not see any\nreason to describe the great influence and importance of this press.\nbut will name these existing publications. daily or weekly. They are\nas follows:",
                "(1) Amerikanski Slovenec, Catholic organ; (2) Ave Maria, Church organ;\n(3) Glasilo Kskj, Catholic people organ; (4) American Country, Independent;\n(5) Glas Naroda, Anti-religious; (6) Enakopravnost, Anti-Church and Socialist; \n(7) Gas, Anti-Church; (8) Prosveta, Organ of the Slovenian National\nBenefit Society; (9) Proletarec, Radical; (10) Me. List SNP, Prosveta\nbranch of Youth organization; (11) Glas Svoboda, Radical; (12) Delavska\nSlovenia, Workers' organ; (13) Nas Doni, Independent; (14) Nova Doba,\nIndependent."
            ],
            "dateFull": "1925-09-10",
            "dateText": "Sept. 10, 1925",
            "dateYear": "1925",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0142",
            "title": "[Slovenian Newspapers]",
            "topTitle": "Amerikanski Slovenec"
        },
        "chicagoforeignl0chic_0143": {
            "codes": [
                "iib2d"
            ],
            "content": [
                "We notice that our friends and supporters accepted with great satisfaction\nthe enlarged size of our newspaper. We are receiving daily thousands of\nletters from all parts of this country, congratulating us on our efforts\nto improve the reading, matter and enlarge the size of our daily. This makes\nus happy and gives us energy to continue such policy.",
                "But in order to fulfill the already made promises to give our readers a\nnewspaper of high standard and quality, as well as to meet the growing\nexpenses incurred with newspaper expansion, we must have additional capital.\nWe are in great need of a new and modern printing machinery to speed up\nwork on a higher rate circulation. New appearance of the newspaper enlarged\nsize, increase in reading matter, all these require more capital which, we\nare sorry to say, we are unable to secure from any other sources except\nfrom the reading public. Our plan to secure additional capital is plain,\n\nwe figure that the increased expenses can be covered by securing from\n700 to 800 new subscribers, and we are strongly appealing to our readers\nand friends for this support.",
                "We do not need go further with an explanation why our Slovenes need their\nown and the only Catholic newspaper, nor what benefits they are getting\nby reading its very interesting and highly educational pages. We hope that\nsuch reasons already have been printed on many pages of this paper, but\nthe only opinion we do express is that it would not be nice of Slovenes\nif, in this critical hour for our newspaper's existence, they will withdraw \ntheir helping hand. We do not have other means to provide additional\ncapital, and we must assure you that without sufficient capital this paper\ncannot be published in an enlarged form or have better reading material.",
                "Now that we have laid down our problem, it is up to you, friends and\nreaders, to help us with solicitation of a few hundred new subscribers,\nand if you succeed in this work we will keep our promises of going to\nthe limit.",
                "All Catholic organizations are requested to organize their work on solicitation, \nand as soon as we have the required number of new subscribers\nfilled, our work on developing the newspaper will be fast."
            ],
            "dateFull": "1925-06-05",
            "dateText": "June 5, 1925",
            "dateYear": "1925",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0143",
            "title": "We Must Support Our Newspaper",
            "topTitle": "Amerikanski Slovenec"
        },
        "chicagoforeignl0chic_0146": {
            "codes": [
                "iib2d"
            ],
            "content": [
                "This year, 1926, is the 35th anniversary of the first Slovenian newspaper\nin America. Our great joy is fully justified and we believe it will be\nshared by all our friends in America.",
                "We know what help we all got from Amerikanski Slovenec during many years\nof its existence. Friendly advice, interesting news concerning our life\nhere and the people in the old country, educational and religious guarding; \nmoral, and in many cases, even financial help: all what we are\nsupposed to expect from a native publication we got, and got plenty of\nit. There is no doubt in our mind that we could not live without our newspaper. \nOur newspaper is our history; its power cannot be easily overlooked.\nAsk our old pioneers and leaders, our successful business people; all will\nconfess that Amerikanski Slovenec played an important part in their life's\nstruggles, in fights towards accomplishment.",
                "Our newspaper was the strong cement that united our divided opinion, our\n\nideal of native unity.",
                "It is true that our newspaper fulfills the ideal of native apostles.\nThirty-five years ago the voice of a small newspaper told to our people the\nfirst truth, that there is hope for all of us in America to become solid in our\nideas, economically powerful and a highly organized and respected nationality.\nFrom the Atlantic to the Pacific this friendly voice announced great news.",
                "For years and years Amerikanski Slovenec has filled its pages with stories\nillustrating our life and it will be the truth and nothing else if we claim\nthat this newspaper is a living history of our people in this country.",
                "Amerikanski Slovenec was established Sept. 3. 1891. The first issue of this\nnewspaper was printed on Racine Avenue, Chicago. The first issue and the\nothers which followed during six months were a thing looking paper of two\nsmall pages. Even in this size Amerikanski Slovenec could not exist very\nlong on account of chronical lack of money. For non-payment of rent it was\nevicted from its printing shop and forced to move to the Northside of Chicago.\nThe only way to save the paper was to find someone who would have enough\n\nmoney to finance it until subscriptions could cover the overhead. This\nsolution was found in a deal which brought about the sale of Amerikanski\nSlovenec to an ex-priest from Tower, Minn., Father Buh, who paid $600\nfor it. The man who started it and owned it is our Chicago Slovenian\nMr. Anton Murnik.",
                "Success came very soon, not through the financial standing of Father Buh,\n\nbut through his hard work and influence. There never were enough subscribers \nto pay expenses, but Father Buh found the friendly support of\n\na few sympathizers. This fact is convincing that it is not money that\n\nwill keep a publication in existence, but the personal influence and \n\nenergy of its managers.",
                "Amerikanski Slovenec moved to Tower. Minn., where Father Buh held a position\n\nas pastor in St. Martin's Church.",
                "The worst problem in the existence of‘ this newspaper was lack of good\n\nSlovenian writers. Reporters from small towns were not skilled in editorial\n\nwork. Translated articles sounded so funny in the Slovene language that\n\n\n\nmany readers complained that they could not understand clearly the meaning\n\nof the articles.",
                "At that time Amerikanski Slovenec had already 600 subscribers and more than\n\n200 copies were distributed free of charge. In spite of that, financial\n\ndifficulties were pressing so hard that Father Buh was forced to sell it.\n\nThis time, it seems, luck was on the side of Amerikanski Slovenec. The\n\nnew owner, Tiskovna Druzba, Joliet, Ill., put the publication on a paying\n\nbasis, but its normal existence came to an end on account of the transfer \nof its chief stockholder, Rev. Susterich, who went to Europe. Then\n\ncame the joke of a lifetime: the Slovenian newspaper passed into German\n\nownership. This period was fatal for the newspaper, but salvation came\n\nagain when Amerikanski Slovenec was bought by its present owner, Tiskovna\n\nDruzba Edinost.",
                "We must repeat again that for over 35 years our Amerikanski Slovenec has\n\nbeen the beginning of everything in Slovenian life in America. We simply\n\ncannot imagine the existence of our social, cultural and benevolent societies \nwithout Amerikanski Slovenec. We are proud of being owners of\n\nour own and oldest newspaper, and intend to support it to the end."
            ],
            "dateFull": "1925-01-27",
            "dateText": "Jan. 27, 1925",
            "dateYear": "1925",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0146",
            "title": "35Th Anniversary of the First Slovenian Newspaper in America",
            "topTitle": "Amerikanski Slovenec"
        },
        "chicagoforeignl0chic_0150": {
            "codes": [
                "iib2d",
                "ic"
            ],
            "content": [
                "We recommend to Slovenian workers the newspaper Delavska Slovenija (The\nWorking Slovenia), which is the property of the Jugoslav Cultural Club\nof Milwaukee. The address is: Delavska Slovenija, 383 First Avenue,\nMilwaukee, Wisconsin. Subscription $2.50 per year.",
                "Today that is the only Slovenian paper in the hands of Slovenian workers,\nwhich will represent the interests of the workinj class in the spirit of\nour times.",
                "We call on Croatian and Serbian workers to recommend said paper to Slovenian \nworkers, wherever they meet them. With this paper Slovenians have\nfilled a gap which existed for a long time, not having a paper for\nSlovenian workers."
            ],
            "dateFull": "1921-12-24",
            "dateText": "Dec. 24, 1921",
            "dateYear": "1921",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0150",
            "title": "For Slovenian Workers",
            "topTitle": "Znanje"
        },
        "chicagoforeignl0chic_0151": {
            "codes": [
                "iib2d",
                "ie"
            ],
            "content": [
                "Published weekly in Chicago, Illinois. Statement required by the Act of August\n24, 1914.",
                "Editor: Frank Skof. 4006 W. 31st Street, Chicago, Ill.",
                "Managing Editor: Fr. Skof, 4006 W. 31st Street, Chicago. Ill.",
                "Publisher: Jugoslovenska Delavska",
                "Jiskovna Druzba. 4006 W. 31st Street, Chicago, Ill.",
                "Owner: Slovenian Section of So. Slavic Socailist Federation.",
                "Frank Podlipec, Trustee."
            ],
            "dateFull": "1913-09-23",
            "dateText": "Sept. 23, 1913",
            "dateYear": "1913",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0151",
            "title": "Statement of Ownership, Management, Circulation, Etc. of Proletarec.",
            "topTitle": "Proletarec"
        },
        "chicagoforeignl0chic_0152": {
            "codes": [
                "iib2d",
                "ie"
            ],
            "content": [
                "The Delegate Committee of the Socialist Party of Cook County, session held\nJune 13, 1909, at 180 S. Washington St., Chicago, Ill., endorsed the following\nresolution:",
                "To the Cook County Delegate Committee, Grievance Committee Report in the case\nof 10th and 11th Ward Branches of the South Slovenian organization vs. Glas\nSvobode.",
                "The evidence submitted to the grievance committee is to the effect that the\npaper, Glas Svobode, is not a socialist paper.",
                "Its manager and owner, Martin Konda, admitted that it is an independent and free\nthought advocate, and that he is not a member of the socialist party.",
                "Now, therefore, as said, Glas Svobode has been listed by other well established\nparty organs, and also supported by and through party commendation, and in view\nof the above unquestioned evidence, we, the Grievance Committee, find that said\npaper is not a socialist paper in the sense that other papers of the Socialist\nParty are (although it has in the past shown an apparent friendship and support\n\nto the Socialist Party). We, therefore, recommend that the county secretary be\ninstructed to send a copy of this resolution to the national secretary of the\nSocialist Party, who will submit it to the socialist press.",
                "Fraternally submitted,",
                "L. W. Hardy, J. N. Born, A. Fishman. A. A. Patterson, Jas. P. Larsen, Committee.",
                "Indorsed and accepted by the Delegate Committee, Socialist Party of Cook County,\nsession held June 13, 1909.",
                "G. T. Fraenckel, Sec'y."
            ],
            "dateFull": "1909-06-22",
            "dateText": "June 22, 1909",
            "dateYear": "1909",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0152",
            "title": "Resolution Condemning Glas Svobode",
            "topTitle": "Proletarec"
        },
        "chicagoforeignl0chic_0154": {
            "codes": [
                "iib2d",
                "ie"
            ],
            "content": [
                "On Dec. 26, 1908. the Slovenian Socialistic Club No. 1 in Chicago, issued a \nresolution condemning false representation by Glas Svobode and discriminating\nagainst its owner, M. Konda.",
                "The resolution reads as follows:- Whereas Glas Svobode, the so-called socialist\nnewspaper published at 597 W. 20th St., Chicago, Ill., in the Slovenian language\nand owned by Martin Konda, proved itself through many articles, notes and paragraphs \n- especially through a certain article published in its issue, No. 43,\ndated Oct. 23, 1908, in which it recommended a Democratic candidate for election\nas non-socialistic and treasonable to the socialist principles and platform, and\nto the Socialist Party at large; whereas Glas Svobode admitted in issue No. 43\ndated Oct. 23, 1908, frankly with the words: \"We never said that Glas Svobode\nwould be a Socialist paper\", as a non-socialistic action before the English\nSocialist Party, unfamiliar with the language and character of the paper and\nyet seeks financial aid from the Party; whereas, the said paper, Glas Svobode,\ndeclared itself in issue No. 43 dated Oct. 23, 1908, as a free-thinking and progressive \npaper, but still tells its readers how good a friend it is to the working \npeople, so that the workers will buy the paper and thereby help fill the\n\npockets of its owner, Martin Konda.",
                "Therefore, be it resolved by members of South Slovenian Socialist Branch, Tenth\nWard, Chicago, Cook County, Ill., at a regular meeting assembled Dec. 26, 1908,\nthat said Glas Svobode is no more worthy of any moral or financial support from\nany existing socialist party or from socialists at large, and therefore is put \non the unfair list of all socialists and class-conscious workers; and be it\nfurther",
                "Resolved, that a copy of this resolution be sent to the Executive Committee of the \nCook County Socialist Party for adoption and to the national secretary of the\nSocialist Party of the U. S. for distribution to every socialist paper or magazine, \nto be given as wide a publication as possible.",
                "Chicago, Ill., Dec. 26, 1908.",
                "Chairman - Mike Kuloveo",
                "Secretary - Frank Podlipec"
            ],
            "dateFull": "1909-06-22",
            "dateText": "June 22, 1909",
            "dateYear": "1909",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0154",
            "title": "Discrimination against Glas Svobode and its Owner",
            "topTitle": "Proletarec"
        },
        "chicagoforeignl0chic_0156": {
            "codes": [
                "iib2d",
                "ie"
            ],
            "content": [
                "The Executive Branch of the Socialist Party in Cook County, Illinois decided\nto publish a resolution, as follows:",
                "Slovenian Comrades, Attention!",
                "Whereas, it has been made known to the County Central Committee of Cook County,\nIll., on complaint of the Slovenian comrades composing the South Slovenian\nBranch No. 11, that the Glas Svobode, owned by one, M. V. Konda, and published\nin this city (Chicago), is preaching openly against socialism in its columns,\nand",
                "Whereas. this paper was at one time used by the Slovenian comrades as their official \norgan, and on account of its open attacks on socialism, it has ceased to\nbe such, and",
                "Whereas. the said M. V. Konda has been, but is not now, a member of the Socialist \nparty, and",
                "Whereas, the Slovenian comrades have now a paper named Proletarec, owned collectively \nby them, published in the city of Chicago, and printed in the Slovenian\nand Croatian languages; be it therefore",
                "Resolved, that we condemn the action of M. V. Konda and consider as unfair and\nunjust his attacks against the Socialist movement and its noble aim in behalf of\noppressed and down-trodden humanity; and we, therefore, call upon all Slovenian\ncomrades to give to Proletarec their loyal and financial support; be it further",
                "Resolved, that a copy of these resolutions be printed in the Chicago Socialist,\na copy transmitted to the national office. and also that we ask the socialist\npress of America to publish same with a view to giving these resolutions as wide\npublicity as possible.",
                "Published by order of Cook County Central Committee."
            ],
            "dateFull": "1906-08",
            "dateText": "August, 1906",
            "dateYear": "1906",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0156",
            "title": "To All Slovene and Crdatian Leaders of the Socialist Federation",
            "topTitle": "Proletarec"
        },
        "chicagoforeignl0chic_0158": {
            "codes": [
                "iib2d",
                "ie"
            ],
            "content": [
                "With this first issue of the Proletarec, Slovenes of the working class came into\nthe intellectual world with their own publication. This step toward mass organization \ncan be considered a real accomplishment of the working class, which never\nhas the opportunity to express its socialistic opinion.",
                "Until today Slovene workers did not own or publish their own newspaper; therefore\nit was impossible to openly state their opinion. All existing Slovene newspapers\nwere owned and published by people who were against the workers' interests. With\nthe aid of the Proletarec we hope that workers will understand that this publication \nis the only powerful and sincere means of gaining knowledge of our social,\neconomic, and religious statute, as well as to learn the whole truth that the\ncapitalists are the most dangerous enemies of the working class.",
                "Proletarec pages will always be wide open to workers for criticism. Workers need\nnot be afraid that their correspondence or articles will be thrown into the waste-\nbasket, because their contents are not favorable to the capitalistically inclined\n\nnewspaper owners.",
                "Proletarec will offer select and rich reading material, which will consist of:\nextracts from American newspapers, magazines, etc.; humorous stories; economic\nand social references; and the strict policy of defending working class interests.\nIt will keep workers posted and well informed about international and local happenings \nand will depict our socialistic fight for workers’ rights.",
                "For the time being the Proletarec will be issued only once a month and will be\nprinted on eight pages. Subscriptions will be only fifty cents for one year,\nremittance to be sent to the address of our comrade, Anton Peshern, 678 W. 17th Street,\nChicago, Ill.",
                "Articles and all correspondence should be addressed to 483 Loomis Street, Chicago,",
                "Signed:",
                "Andrey Popravne, President."
            ],
            "dateFull": "1906-01",
            "dateText": "Jan. 1906",
            "dateYear": "1906",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0158",
            "title": "Editor's Notice.",
            "topTitle": "Proletarec"
        },
        "chicagoforeignl0chic_0161": {
            "codes": [
                "iib2g",
                "ie"
            ],
            "content": [
                "The Jugoslav Socialist club No. 1 in Chicago has shown its educational\nactivity during the winter of this year by organizing a few very interesting\nlectures, one of which is on the subject, \"Socialism\". This lecture proved\nhow little our people knew about Socialism, and how badly they need to be\neducated in Social Science."
            ],
            "dateFull": "1917-01-02",
            "dateText": "Jan. 2, 1917",
            "dateYear": "1917",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0161",
            "title": "Lecture on Socialism",
            "topTitle": "Proletarec"
        },
        "chicagoforeignl0chic_0162": {
            "codes": [
                "iib2g",
                "ie"
            ],
            "content": [
                "The Jugoslav Socialist Club No. 1 in Chicago has shown its educational activity\nduring the winter of this year, by organizing a few very interesting lectures, one\nof which is on the subject, \"Socialism\". This lecture proved how little our people\nknow about Socialism, and how badly they need to be educated in Social Science."
            ],
            "dateFull": "1917-01-02",
            "dateText": "Jan. 2, 1917",
            "dateYear": "1917",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0162",
            "title": "Lecture on Socialism",
            "topTitle": "Proletarec"
        },
        "chicagoforeignl0chic_0164": {
            "codes": [
                "iid1",
                "iid2",
                "ie"
            ],
            "content": [
                "Progressive Slovene Fraternal Benefit societies in this country today, among\nwhich the Slovene National Benefit Society is the largest, are the work of\npioneer Socialists, who had foresight, men who realized that the workers\nare left to shift for themselves and are exploited on every hand unless they\nare strongly organized. Therefore, the Socialists were pioneering the ground\nfor the unions, for the cooperative movement, for educational work and at the\nsame time were fighting for old age pensions and other types of social insurance.",
                "That was the work they were doing thirty years ago. At that time private\ninsurance companies were the only type of insurance companies in the field.\nSocialists realized at that time that private insurance companies were in the\nfield to reap as much profit for their owners as possible. Today it is well\nknown that they are a legalized racket.",
                "To the Jugoslav Socialist Federation and its official publication, Proletarec\n\nwe owe a debt of gratitude for the noble work it has been carrying on among\nthe old generation of Slovenes in America and the American-born Slovenes\nfor over three decades in the political, economic and industrial fields."
            ],
            "dateFull": "1937-05",
            "dateText": "May 1937",
            "dateYear": "1937",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0164",
            "title": "In the Vanguard",
            "topTitle": "Majski Glas (May Herald)"
        },
        "chicagoforeignl0chic_0166": {
            "codes": [
                "iid1",
                "iid2",
                "ie"
            ],
            "content": [
                "Progressive Slovene Fraternal Benefit Societies in this country today,\namong which the Slovene National Benefit Society is the largest, are the\nwork of pioneer Socialists, who had foresight, men who realized that\nthe workers are left to shift for themselves and are exploited on every\nhand unless they are strongly organized. Therefore the Socialists were\npioneering the ground for the unions, for the cooperative movement,\nfor educational work and at the same time were fighting for old age\npensions and other types of social insurance.",
                "That was the work they were doing thirty years ago. At that time private \ninsurance companies were the only type of insurance companies in\nthe field. Socialists realized at that time that private insurance\ncompanies were in the field to reap as much profits for their owners\nas possible. Today it is well known that they are a legalized racket.",
                "To the Jugoslav Socialist Federation and its official publication, Proletarec, \nwe owe a debt of gratitude for the noble work it has been\ncarrying on among the old generation of Slovenes in America and the\nAmerican-born Slovenes for over three decades in the political, economic\nand industrial fields."
            ],
            "dateFull": "1937-05",
            "dateText": "May 1937",
            "dateYear": "1937",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0166",
            "title": "In the Vanguard",
            "topTitle": "Majski Glas (May Herald)"
        },
        "chicagoforeignl0chic_0168": {
            "codes": [
                "iid1",
                "iiib2"
            ],
            "content": [
                "It had long been the desire of our people in Chicago that all small organizations, \nthe existence of which, it seems, always have been endangered by\nlack of members and financial conditions, to be united in one strong\nsociety. It took a long time to come to actual amalgamation, but at last\nit was accomplished to the satisfaction of all.",
                "We, Slovenians in Chicago, had over fifteen small benevolent lodges. Upkeep\nof such number of lodges with members of same nationality, with similar\nrules and regulations, looks just foolish. People wasted money on so many\nrents, secretaries, etc., and if we are to take into consideration personal\njealousy among officials of those small lodges, here we have a clear picture\nof the handicap which holds the activities down.",
                "No wonder that a great number of members of various lodges started protesting \nagainst such doings, and after quite a fierce fight, they succeeded\nin bringing unification and amalgamation.",
                "The new society was named United Lodges of Chicago K. S. K. Jednote. The\ngeneral idea of this new united organization is as follows: To keep the\norganization's expenses down as much as possible; to increase sick benefit\nfor outstanding members; strong representation on national conventions;\npromotion of good will among former members of small lodges; stronger support \nof our church St. Stjefan, etc.",
                "We all must admit the great importance of such unity and are sincerely\ncongratulating the individuals on the hard work which brought this excellent \nidea to life."
            ],
            "dateFull": "1928-11-27",
            "dateText": "Nov. 27, 1928",
            "dateYear": "1928",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0168",
            "title": "Amerikanski Slovenec",
            "topTitle": ""
        },
        "chicagoforeignl0chic_0170": {
            "codes": [
                "iid1",
                "iib2d",
                "iib2d",
                "iiia",
                "iiie",
                "iib3"
            ],
            "content": [
                "New thoughts and ideas develop every day. These new thoughts and\nideas must find new outlets in the same manner as any mechanical\nimplement or device. New implements, new thoughts and ideas are rarely\naccepted unanimously, and until they are accepted, they must struggle\nfor their existence.",
                "The young generation in the Slovene National Benefit Society has\ndeveloped new conceptions. To put these into operation under the\nold system would be impossible, so nothing more desirable could have\nhappened than to have them branch into separate lodges in accordance\nwith their new ideas.",
                "These new thoughts could not possibly be of any value to the parent\nlodges; yet when they were properly assembled in their new forms\nand put into operation, they met with surprising success. Unheard\n\nof events, houses filled to capacity, things done just a little\ndifferent from the others. From the way these events were received,\nwe must feel that they were welcome wholeheartedly. It is our\ndesire and our purpose to keep building the fraternal spirit and\nto keep pace with the most up-to-date styles of entertainment.",
                "But even today, after proving unusually successful (functioning for\nover a year and a half) some people still question the right of\nyoung English-speaking Slovenes to organize into subordinate lodges.\nNevertheless, we must say that a big majority of the membership,\nas well as the main body of officials, have given the movement\nconsiderable support. In the main, however, it is not our purpose\nnor is it proper for any participant or sympathizer to denounce\nthose not actually in favor of the movement, but rather to produce\nevidence and proof to convince them that the policies pursued are\nsafe, sound, and justifiable. All claims that the young generation\ncould not exist and function should be banished immediately, for\n\nthe performances of the past year well verify our statement that\nmore life and energy in the subordinate lodges has never been\nbrought to light. Of course, reference is made to the seventeen\nEnglish-speaking lodges of the SNPJ. Baseball and other sports\n\ndid not materialize as many predicted. Instead, membership campaigns, \ndances, picnics, and other means of obtaining funds to \n\nbolster the locals were instituted. One could venture to say that\n\nthese newly organized people are considerably more interested in\n\nthe affairs of their respective lodges than can be said of the\n\nmajority of the elders.",
                "We don't doubt a bit that it was likewise with our parent lodges.\n\nGood will, plenty of life and enthusiasm, and mainly excellent\n\nresults were obtainable when they were founded. But goodness how\n\nthis has diminished! Solely for the reason that the discussions\n\nand thoughts concurred in were of the plain repeated style. What\n\nwe propose to do, however, is to use variety, by giving the young\n\ngeneration the most modern disposition and meaning of fraternalism;\n\n\nthe most up-to-date kind of amusement and entertainment; and the most\n\nsincere cooperation and friendship.",
                "Experience is the best instructor. And while a few profess to have\n\nan exceptionally rare collection of knowledge, the membership is\n\nlearning from day to day; correcting the inaccuracies of previous\n\nmornings. As time passes, a better system will be instituted as\n\nthe result of a better understanding of the fraternal situation.\n\nAs a general rule most of the young element is fairly well situated\n\nin other English fraternal organizations, so that our task of\n\ninteresting them is somewhat difficult. Other fraternal organizations\n\nhave more to offer in the way of recreation than the SNPJ. Consequently \nthe above is true. Organizers must use precaution and good\n\njudgment, because the disposition of those of the age limit is very\n\nindefinite and quite obscure. We must not only talk fraternalism\n\nto them; no, that will never do. It is essential that we mention\n\nsocial functions as well, until they have sufficiently mastered\n\n\nthe scope of our field. You elders - your tasks were hard. Ours are\n\nnone the easier. Lend us your support; especially in the localities\n\nwhere the population is widely scattered. The future of any Slovene\n\nfraternal organization lies in the hands of the offspring. Similar\n\nexpressions are heard and read frequently. But it is not sufficient\n\nto merely speak and write these words. It is necessary that these\n\nremarks be backed with moral and financial support. And what about\n\nthe Slovene language? What effect will these new organizations\n\nhave upon it? Heated discussions on the subject are witnessed\n\nregularly. From the most timid tales to the most capable defensive\n\narguments one is able to pick statements that would astonish even\n\nthe most unconcerned bystander. Some fear that the Slovene fraternal\n\norganizations have reached their limit; that the English subsidiary\n\nis their only salvation. Others quite differently proclaim no fear \n\nfor the language, even for the distant future. And so we conceive\n\nthe opinion that no immediate change is to take place in our\n\ngeneration because within the rank and file there exist a large\n\npercentage of those favorable to the organization of these English\nlodges yet willing to sacrifice time and money for the development\nof the Slovene language.",
                "It is true that the official business of these lodges is transacted\n\nin the English language, but it is also true that a greater percentage\n\nof these youngsters attempt in either speak, read, write, or sing\n\nin the Slovene language now more than heretofore. Prosveta is read\n\nwith delight, for it is convenient to glance from its pages to the\n\nother sections for various announcements and suggestions. What is\n\nmore, magazines such as Mladinski List and Proletarec, while not\n\nin the limelight, bear great watching. Perfected to a higher degree\n\nof satisfaction, such magazines will be of great assistance in\n\npartially keeping up the nationality. However, if the Slovene language \nis destined to extinction in this country, the English-speaking \nlodges will not be the cause nor will such lodges bear the responsibility. \nBesides being a well-balanced fraternal organization, the\n\nSlovene National Benefit Society is known to be a powerful weapon\n\n\n\nwhen used in defense of the workers.",
                "Without question it must be said that conditions, both working and\n\nliving, have been improved. Organizations such as our fraternal\n\norder have been responsible, at least in part, in bringing about\n\nsuch improvement. You might consider such action as entering\n\npolitics, but politics or otherwise, if the steps taken will\n\nbring about better living and working conditions, I deem it essential\n\nand necessary to say that our fraternal societies continue pursuing\n\nsuch tactics as long as the prevailing system of plundering the\n\nmasses last. The Jugoslav Socialist Federation and its educational\n\ndepartment is another institution which is also active in all such\n\nstruggles, as is the League for Industrial Democracy. Knowing this,\n\nhow can we fail to support them? Remembering that the years will\n\ntell the story of your present behavior, let us make history as\n\nit has never been made before.",
                "In conclusion it is necessary to appeal to the Jugoslavs of this\n\n\ncountry to help build up their race by organizing new English-speaking\n\nlodges, to keep and uphold the race by bringing up their offspring\n\nso they can speak the Jugoslav language and to support such institutions \n\nfrom whom most benefit is derived. If you do this, we can\n\nassure you that our language will not die; that the movement will\n\ngrow and prosper and will not astonish or amaze anyone.",
                "Donald J. Lotrich."
            ],
            "dateFull": "1927-05-01",
            "dateText": "May Day 1927",
            "dateYear": "1927",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0170",
            "title": "Youth in the Slovene Fraternal Societies",
            "topTitle": "Proletarec"
        },
        "chicagoforeignl0chic_0178": {
            "codes": [
                "iid1"
            ],
            "content": [
                "It has been said quite often that Pioneer Lodge No. 559, S.N.P.J., (Slovenia\nNational Benefit Society) originated Nov. 13, 1925. The charter bears the inscription \nof twenty young men and women who gathered on that day to plant the\nseed which has flourished and blossomed into success in the field of activities\nand membership.",
                "Nature has planted us amidst a pleasing environment and atmosphere, in which we\nhave found sparkling life and social activities aplenty. Good will and contentment \nhas reigned with us always, and what we did not inherit we procured for ourselves.",
                "The whole wide world should know that the Pioneers were the first English speaking \nfraternal lodge of any Jugoslav fraternal society in the world. Is this\nboasting? Well, not exactly; but we wish to bring out the importance and significance \nof - \"the first in the entire world\". That phrase has probably more\nmeaning than any consideration you have ever given it. Have not the Pioneers\nreason to feel proud? We can safely say that our relations with the parent organization \nhave always been most respectful, and as we have often said, it is\ntheir existence and their comfort which has necessitated such actions as we have\nundertaken. A bright and unsurpassed future can be visualized. We can see the\nPioneer Lodge of 1942, the largest of any lodge under the fold of the Slovenska\n\nNarodna Potporna Jednota. Its membership must reach one thousand. Do you know \nwhy this is possible? Because we have adopted a broadminded program which will\nreach everyone; because of our willingness to cooperate to the fullest extent; \nand because we have the spirit and the knowledge of our power. We shall carry \non until we reach our goal.",
                "We all realize the importance of the struggle, likewise its handicaps; but by\nturning every opportunity into a reality and favoring those who labor to make\nour very existence easier, we shall eventually surpass our prediction."
            ],
            "dateFull": "1927",
            "dateText": "1927",
            "dateYear": "1927",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0178",
            "title": "The Pioneers - Their Possibilities",
            "topTitle": "Proletarec"
        },
        "chicagoforeignl0chic_0180": {
            "codes": [
                "iid1"
            ],
            "content": [
                "The best answer we can offer to Slovenian National Benefit Society with\nregard to the accusation that our organization is progressing slowly,\nis the recent statistic. Our organization, as it can be found in the last\nfinancial report, has a capital of $1,535,000, which divided on 30,000\nwidow members that are being cared for by our society, will give 9. sum\nof $51.16 to each member, as benefit. Now, the official organ of SNPJ,\nin its last report shows that the benefit for a member amounts to only\n$42.46.",
                "Another part in SNPJ's ﬁnancial report shows that the organization's\ncapitalization is valued $42.46 per member, whereas our valuation shows\n$51.16 per member.",
                "With this information we are offering to the people of the Slovenian\nnation the right my to find out whether there exist any ground for the\nabove mentioned accusation. It seems to us that the people from SNPJ\nlost all sense of right judgment."
            ],
            "dateFull": "1926-06-09",
            "dateText": "June 9, 1926",
            "dateYear": "1926",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0180",
            "title": "The Richest Slovenian Benevolent Society",
            "topTitle": "Amerikanski Slovenec"
        },
        "chicagoforeignl0chic_0181": {
            "codes": [
                "iid1",
                "iib1a",
                "iiie"
            ],
            "content": [
                "All Slovenian Benefit Societies located in Chicago and vicinity were invited to\nsend their authorized representatives to a conference to be held on December 13.",
                "The following societies answered this request:",
                "\"Narodni Vitezi\" No.39",
                "\"Slavia\" No. 1",
                "\"Slovenski Dom\" No. 86",
                "\"Nada\" No. 102",
                "\"Francisco Ferrer\" No. 131",
                "\"Modern Woodmen\"",
                "\"Slovenski Delavski Sokol\"",
                "\"Slovenia\" (Bohemian)",
                "\"Society No. 47\"",
                "\"Society No. 1\"",
                "\"Socialist Club No. 1\"",
                "\"Singing Society--Zora\"",
                "Jugoslaven No. 104\"",
                "\"Slovenian Youth Society--Danica--No. 70\""
            ],
            "dateFull": "1917-12-18",
            "dateText": "Dec. 18, 1917",
            "dateYear": "1917",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0181",
            "title": "Conference of Slovenian Benevolent Societies in Chicago",
            "topTitle": "Proletarec"
        },
        "chicagoforeignl0chic_0182": {
            "codes": [
                "iid1",
                "iiib4"
            ],
            "content": [
                "The SLOVENSKA NARODNA PODPORNA JEDNOTA (Slovenian National Benefit Union)\ndecided at its fifth Convention, which was held in Milwaukee, Wisconsin to\nwork for socialistic principles.  Delegates of 10,000 members, who are scattered\nall over the United States will try to influence these Members to work for the\nSocialist party and to join it or the Jugoslav Socialist branches or where such\ndo not exist to organize them.",
                "At the convention there were 130 delegates present, among them two from\nMexico. Out of them 80 were members of some Socialist organization, while the rest of them side with socialism.",
                "At the contention as the main speaker was Comrad ETRINKRISTAN. His speech\nwas well as of other Socialist speakers was received with great enthusiasm."
            ],
            "dateFull": "1912-10-03",
            "dateText": "October 3rd, 1912",
            "dateYear": "1912",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0182",
            "title": "A Socialist Convention",
            "topTitle": "Radnicka Straza"
        },
        "chicagoforeignl0chic_0183": {
            "codes": [
                "iid1"
            ],
            "content": [
                "The Slovenian women in Chicago have organized a new benevolent society called\n\"Nada\" (hope). Last Sunday, March 15th, twenty women signed applications for\nmembership to this newly organized society.",
                "A membership card costs $1.00. Monthly dues are $.50. The society will pay $3\na week for sick benefit, and $50 in case of death.",
                "The Executive Board consists of:- Mary Jelich, President; Mary Grileo, Vice-\nPresident; Angela Norvat, Treasurer.",
                "Controling Committee:- Ursula Koshnik, Mary Sottar, Anna Krizanich.",
                "The Committee for the sick includes Mrs. Zavitnik and Mrs. Neden."
            ],
            "dateFull": "1908-03-31",
            "dateText": "March 31, 1908",
            "dateYear": "1908",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0183",
            "title": "Slovenian Benevolent Society \"Nada\"",
            "topTitle": "Proletarec"
        },
        "chicagoforeignl0chic_0185": {
            "codes": [
                "iid6",
                "iib2d",
                "iiig",
                "iiie",
                "ie"
            ],
            "content": [
                "The Jugoslav Socialist Federation and its official publication, Proletarec, \nthe Educational Bureau of the Federation, the American Family\nAlmanac (Druzinski Koledar), the May Herald and the Home of the\nFederation, the Slovene Labor Center.",
                "We cannot escape the fact that the old generation of Slovenes will not\nbe with us forever, but their work, the institutions they built, are\nwith us to stay and are today facing a brighter future than ever.",
                "The new generation of American-born Slovenes is gradually stepping\ninto the work which has up to the present time been carried on by\nthe old pioneers in the Socialist movement. This change, because of its\nvery nature, is bound to be slow at first, but as the young comrades\nare gradually drawn into the movement and begin to take up the work\n\nand responsibility connected with it, interest will develop at a faster\ntempo than it has up to the present time.",
                "The record back of the Jugoslav Socialist Federation is one of which\nwe can feel justly proud. The official organ of the Federation, Proletarec, \nhas survived all the storms of the last thirty-three years,\nmany of which were terrific ones, and is today carrying on nobly. The\nEnglish section of Proletarec is open to our youth and is gradually\nbecoming more and more interesting as new contributors are being\nadded to the list. The rapid tempo with which changes are taking place\ntoday among the working masses gives us hundreds of new topics to\ndiscuss and we should do so through our publication and in that way\nmake it interesting enough to be able to attract new subscribers from\nthe ranks of the youth.",
                "The Educational Bureau of the Jugoslav Socialist Federation has, according \nto its secretary's report for the last year, more units affiliated\nwith it than ever before in the history of the Bureau.",
                "New material is being constantly added to the bureau's files, more and\nmore calls for plays, declamations, etc. are being efficiently and\nsatisfactorily handled from month to month, and the future for the\nEducational Bureau looks bright and prosperous. The Bureau, with its\nfine and large collection of material, is today in a position whereby\nit is able to be of great service to its affiliated units. Fraternal\nand cultural organizations throughout the country are beginning to\nrealize this and new organizations are being added to the membership\nlist right along. English speaking units affiliated with the Bureau\n\nwill soon be furnished with a complete new list, which is now being\n\n\ncompiled of all the English material in the files of the Bureau.",
                "Our annual publication, the May Herald, dedicated to labor's international holiday, \nMay Day, is being improved and enlarged from year to\n\nyear, this issue being one of which we are all proud and one which should\n\nenjoy a large circulation.",
                "The American Family Almanac, (Druzinski Koledar), is in its twenty-third\n\nyear with the 1937 issue. The contents and general make-up of the\n\nAlmanac have been improved with each issue and the circulation records\n\nshow that its list of readers is growing constantly. The research work\n\nand gathering and publishing of statistics by its editor, dealing with\n\nSlovenes and their activities in America, have made the Almanac a\n\nvaluable reference book much in demand by libraries and people doing\n\nresearch work throughout the country.",
                "The most recent and probably the best accomplishment of our Federation\n\n\n\nwas the purchase, a few years ago, of the building which is now known\n\nas the Slovene Labor Center, or the Center, as it is known among the\n\nChicago Slovenes. The business office of Proletarec is located in\n\nthe building, as is the Proletarec Library and book shop. The Slovene\n\nsocial Center Club, which has about three hundred members, is also\n\nlocated at the Center. The building is located in a residential section,\n\naway from the hustle and bustle of the city's traffic and industry, and\n\nis the meeting place of all Jugoslav Socialist Federation members in\n\nChicago and of the out-of-town visitors. It is the Slovene Labor\n\nCenter in the full sense of the word.",
                "Our movement has a home which can be called its own and of which we \n\ncan all feel justly proud.",
                "The biggest and most important problems before the Federation today\n\n\nare: First, to increase our membership; this increase will have to come\n\nfrom the ranks of youth; and second, to build up the circulation of our\n\nofficial organ, Proletarec. The field in which we will have to do most\n\nof our work is in and among the labor unions.",
                "The most vital movement on the American scene today is the giant stirring \nof the workers in the basic industries. To guide this gigantic\n\nforce into really progressive channels among our people is the most\n\nimmediate task before the members of our Federation and its sympathizers."
            ],
            "dateFull": "1937-05",
            "dateText": "May 1937",
            "dateYear": "1937",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0185",
            "title": "Our Institutions and Their Future",
            "topTitle": "Majski Glas, (May Herald)"
        },
        "chicagoforeignl0chic_0191": {
            "codes": [
                "iid6"
            ],
            "content": [
                "The management of our highly praised national institution Slovenski Dom\ninforms all organizations in Chicago that on account of low financial\nconditions of this institution, it will be advisable to use its premises\nfor all kinds of celebrations, bazaars, theatrical performances, etc.,\nwhich societies and lodges are planning to do.",
                "With rent paid anywhere, we are lowering our support to this such helpful\nimportant and altruistic institution, of which we have all be proud."
            ],
            "dateFull": "1928-12-11",
            "dateText": "Dec. 11, 1928",
            "dateYear": "1928",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0191",
            "title": "Slovenski Dom",
            "topTitle": "Amerikanski Slovenec"
        },
        "chicagoforeignl0chic_0192": {
            "codes": [
                "iid6"
            ],
            "content": [
                "Life of our colony in Chicago is getting into a new tempo. The cause of\nthis is that our new Slovenian Hall has been opened. Very soon this hall\nwill become a real center of our colony, where friends and relatives\nwill meet. This hall is located on the second floor of our St. Stephano's\nchurch building. Its modern premises offer excellent surroundings for\nsocial meetings. The hall is big enough to accommodate nearly 1,500 persons\nand is always filled to the limit whenever some colonial gathering occurs.\nIn the basement of this building we can find two bowling alleys, where\nhundreds of young and old people find enjoyment every evening, but especially \non Sundays. All seats are occupied by the spectators. The church\ntreasury found an excellent source of steady income from this enterprise.\nNext to the bowling room there is a pool room with a few brand new pool\ntables. Our young people find there a good place to amuse themselves\nunder the guidance of clergyman. The parents do not have to worry about\ntheir children's conduct as long as they are closely watched by our\npriests.",
                "Children must have amusement and if they do not have it at home, they\nwill soon be looking for it in some other places, where we never know\nthat may happen to them. This very important problem in the way of\nprotecting our children's morals is solved entirely by the opening of\nour hall, vhich provides wholesoma entertainments under the watchful\neyes of the priest and his assistants. We can say that St. Stephan's\nHall is really a blessing for the old and young in our colony."
            ],
            "dateFull": "1926-04-21",
            "dateText": "April 21, 1926",
            "dateYear": "1926",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0192",
            "title": "New Slovenian Hall in Chicago",
            "topTitle": "Amerikanski Slovenec"
        },
        "chicagoforeignl0chic_0194": {
            "codes": [
                "iid6"
            ],
            "content": [
                "At last we got good news that our hope came true, our Community House is\nalmost ready to be open. We all know the great importance of having such\na house. Our children will have airy rooms to play in; we will enjoy\nmeetings with our friends; and at this house we will attend performances\nof our musical, singing and dramatic societies.",
                "It is really a surprising fact that so many of our people cannot realize\nthe priceless value of such enterprise and are refusing to subscribe to\nthe Building Fund. We cannot improve our life unless we will readily donate\nfor the educational organizations."
            ],
            "dateFull": "1925-02-05",
            "dateText": "Feb. 5, 1925",
            "dateYear": "1925",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0194",
            "title": "Slovene Community House",
            "topTitle": "Amerikanski Slovenec"
        },
        "chicagoforeignl0chic_0196": {
            "codes": [
                "iiia",
                "ic",
                "ie"
            ],
            "content": [
                "Often we glance back into the early days of childhood, dreaming of\nhow we used to run about as free as the air. Comparing those never-to-be-forgotten \ndays with the present, we say to ourselves, What\na change! For well do we remember the old Slovene settlement at\nTwenty-second and Wood streets, when that settlement was in its prime,\nwhen the industries were flourishing in the car shops, the lumber\nyards, etc. The noon factory whistles would blow and a mass of \nhumanity would dash across Blue Island avenue into their favored\nplaces with a pail called ‘pint.’ Today the noon whistles still\nblow, but not nearly as many humans scamper across the street; the\nstores of the avenue look deserted.",
                "What a change in so short a time! Of course, the war came and out\nof the war many hardships. Many disabled boys, many new millionaires\nand a period of depression. That hit our people hard, no doubt.",
                "Yes, new machinery, too, has been invented displacing men. Many\nhave moved to the west of the city; some to the north, others to\nthe south. Yet, the flow of Slovenes from other cities and places\nin the most part from the mining districts, has refilled the\nterritory. As one leaves another comes.",
                "Fifteen to twenty years is a long period of time, too. Within such\na period much can be accomplished. But it is regrettable that the\nSlovenes in this vast metropolis have nothing outstanding to which\none might point with pride. They have fostered fraternal societies, \na church and church hall. Outside of a few small business undertakings, \nwe have little to show.",
                "Our people have not been interested in politics, although they are\nbecoming more conscious politically each year. Those that did participate \nin politics, for the most part always favored the Democratic\nand Republican administrations. Each year taxes would rise, jobs\n\nwould be fewer and harder to secure. Living necessities do not balance\nwith the meager pay envelopes. So we struggle along just barely\nmaking both ends meet. Yet, our Slovene race as a whole is a progressive \nrace. However, when you scrutinize their achievements, we\nare outspoken. We have no big DOM to which we might point with\npride; no large business establishments; no cooperatives. Perhaps\nwe did not need them as bad as other large Slovene settlements.\nIt is because we have too many factions and let jealousy control\nour progress. Or is it because we always leave it to the other\nfellow to do the work? Whatever it may be, the fact remains that\nmuch more could be accomplished if the slogan of cooperation was\n\ninbedded in the mind and heart of our people.",
                "Isn't it a fact that jealousy has been responsible for so small\n\na degree of success? Time and again folks would tell us about our\n\nfraternal life; about the friction caused by mere jealousy - and\n\nthe organization of a new order wherein the years following. They\n\nhad witnessed the same jealousy segregate subordinate groups. The\n\n\nsame jealousy retards the growth of any group and ours is no exception.",
                "Chicago has had a Slovene Socialist Club for a long time. During all\n\nthese years and especially in the past fifteen years cultural work\n\nhas been progressing at very slow rate. But a large percentage of \n\nwhat has been done in this field can be attributed to the efforts\n\nof the Socialist club. The club just naturally tackled the work and\n\nknowing the responsibility of such action, it marched along as best\n\nit could under our conditions. Plays of all descriptions have been\n\nproduced, lectures on vital questions are held at frequent intervals, \nliterature of all kinds is distributed, devotees of music\n\nand song display their wares with the club's choir.",
                "Young friends, if you are at all active, or wish to become so, there\n\nis no better time than now to join the ranks of active Socialist\n\nworkers. There is no need for you to remain outside of our ranks\n\nany longer and pass away the fleeting years in the mere satisfaction\n\n\n\nof doing only what you must. Think of being able to help others.\n\nYou will find more satisfaction in that. Your ability and your\n\nearnestness is wasted unless you give the world the best you\n\npossess. We would like to see you learn more about the economical\n\nconditions which have so much bearing on your environment.",
                "It is possible to do more in the next fifteen years than in the\n\nlast fifteen. We believe so. We believe there are at least three\n\nhundred Slovenes in Chicago who should rightfully be attached to\n\nthe Socialist club. It is possible with proper judgment and unity\n\nto do something to which you can point with pride and satisfaction\n\nin years to come.",
                "Donald J. Lotrich."
            ],
            "dateFull": "1929-04-25",
            "dateText": "April 25, 1929",
            "dateYear": "1929",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0196",
            "title": "Here and There Among Us in Chicago",
            "topTitle": "Proletarec"
        },
        "chicagoforeignl0chic_0201": {
            "codes": [
                "iiia",
                "iib2f",
                "ia3"
            ],
            "content": [
                "In last week's issue, readers of Amerikanski Slovenec can notice a very\nimportant announcement regarding a new citizenship school to be opened\nvery soon in South Chicago. The organizing committee invites all Slovenian \nwomen and men in our colony to be present at the meeting, October\n18, where plans for opening this school will be discussed. The main\nobject of this long needed school is to educate people in ways and means\nof becoming citizens of this country.",
                "A great number of articles have been printed dealing with the important\nquestion of becoming citizens. Sincere and sensible advice has been passed\non how to take part in political life in this country, but still the fact\nremains that our people are the most ignorant people of this country so\nfar as politics are concerned. They accept bills, taxes, assessments, \netc., without questioning their rightfulness or the size of their bills.\nThey will be more careful if they had their citizenship and political\neducation."
            ],
            "dateFull": "1928-10-18",
            "dateText": "Oct. 18, 1928",
            "dateYear": "1928",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0201",
            "title": "Citizenship School in South Chicago",
            "topTitle": "Amerikanski Slovenec"
        },
        "chicagoforeignl0chic_0202": {
            "codes": [
                "iiia",
                "if3"
            ],
            "content": [
                "The greatest right of every citizen of this democratic country is the\nvote. We are sorry to state that the majority of our people do not recognize \nthe value of this right and fail to exercise this most important\nduty. The result of this failure is political mischief. The public pays\na heavy penalty having the wrong kind or politicians and by lack of\nunderstanding how important it is to vote. A great number of our Slovenians \nused to say, \"I do not care for politics.\" This attitude is entirely\nwrong and should be changed by political education.",
                "People cannot have the right kind of goverment and cannot govern themselves\nunless they take part in electing their political leaders, which in this\ncountry oan be accomplished only by a majority vote. Political influence\nis so important in the life of every citizen that it is a crime to neglect\nthe duty of controling this widespread influence. We strongly advice our\npeople to get away from political lethargy and fully exercise their first\nand chief duty as American citizens by voting."
            ],
            "dateFull": "1928-09-08",
            "dateText": "Sept. 8, 1928",
            "dateYear": "1928",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0202",
            "title": "First Duty of Citizen",
            "topTitle": "Amerikanski Slovenec"
        },
        "chicagoforeignl0chic_0203": {
            "codes": [
                "iiia"
            ],
            "content": [
                "Our colony in Chicago is growing very fast. Reason for this is increasing\nindustrial activity. Daily we see some new faces.",
                "Since we built a new church hall, every week some new entertainment is\noffered to people of our colony. Singing societies, dramatic clubs, etc.,\nare giving weekly performances with choices of programs. This hall\nproved to be the best place to meet friends and relatives. It can\neasily accommodate over 1,500 persons.",
                "The opening of this modern hall is really a convincing fact of how\nbadly we needed such premises. In the basement of the hall we have\ntwo bowling alleys and every evening you can find hundreds of people\nwatching the play. The church has a pretty good income from this\nenterprise. In the room close to the bowling alleys we find a pool\ntable, which also serves as a means for additional income to the\nchurch.\n\nDue to the improvement in working conditions we notice great building\nand remodeling activities; new beautiful homes built by our people;\nold ones are remodeled to such an extent that you hardly can recognize\nthem; new furniture is bought, and we see that our people are getting\nthe best from civilized life, to which they hardly have been accustomed\nbefore their arrival in this country."
            ],
            "dateFull": "1926-04-21",
            "dateText": "April 21, 1926",
            "dateYear": "1926",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0203",
            "title": "Slovenian Settlement Life",
            "topTitle": "Amerikanski Slovenec"
        },
        "chicagoforeignl0chic_0205": {
            "codes": [
                "iiia",
                "iiig"
            ],
            "content": [
                "The Slovenian colony in Chicago is growing surprising fast. For the last few months more than 100 new families have settled. The reason is the lack of opportunity for new and young generations in small towns. Chicago, with its vast industries, offers an excellent chance for ambitious young persons. Old Slovenian people, of course, feel badly in new surroundings and find it very hard to adjust themselves, being mine workers practically all their life.",
                "The Slovenian colony has good schools, recreation ahlls, etc. All this provides for good life."
            ],
            "dateFull": "1926-01-08",
            "dateText": "Jan. 8, 1926",
            "dateYear": "1926",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0205",
            "title": "Chicago Colony Is Growing Fast",
            "topTitle": "Amerikanski Slovenec"
        },
        "chicagoforeignl0chic_0207": {
            "codes": [
                "iiib2"
            ],
            "content": [
                "May the 6th was a memorable day for members of the society \"Knights of\nSt. Florian.\" On this day this oldest society in America celebrated its\n35th anniversary.",
                "Due to the wide influence of this society, the celebration turned to be\na mass meeting of thousands of members, sympathizers and other Slovenians\nfrom Chicago and vicinity. We must admit that the celebration was a brilliant \naffair in our colony.",
                "The banquet, with a selected menu, was beyond our expectation; the artistic\nprogram of the singing society \"Sarja\"; recital, given by the young members\nof this society and interesting speeches dealing with the colorful history\nof this society. We are not writing history and therefore, in this article\nwe will omit details of the Society's activities during the period of 35\nyears; even if we felt that it would be of great benefit to our new generation \nto learn how to work and create glory for our nationality."
            ],
            "dateFull": "1928-05-24",
            "dateText": "May 24, 1928",
            "dateYear": "1928",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0207",
            "title": "35Th Anniversary of the Society \"Knights of St. Florian\"",
            "topTitle": "Amerikanski Slovenec"
        },
        "chicagoforeignl0chic_0208": {
            "codes": [
                "iiib2",
                "ik"
            ],
            "content": [
                "December 1, 1926, will be memorable day in the life of our Slovenian\nwomen. On that date the Slovenian Women's Society opens its branch in\nChicago. Not long ago our people just laughed at the idea of their\nwomen being organized and show men's activity. It seems to be a very\nhard job for our men to imagine their wives taking part in social and\ncultural life, of our people. So, our women got out from their kitchens\nand are new active in the colony's affairs.",
                "On that day at 8 P. M. the first meeting was held in the premises of our\nschool. On this occasion over 35 members signed applications.",
                "You should see the joy on their faces. The board of directors has been\nelected and will consist of: President, Mrs. Fannie Jazbec; Secretary,\nMrs. Majda Brishar; Treasurer. Mrs. Jennie Stayer.",
                "Decision has been passed that on day of December 19, they will call mass\nmeeting on which should be invited all women from our colony in Chicago\nand vicinity. Rules and regulations of this society as well as plans for\nfuture work will be worked out at the next meeting."
            ],
            "dateFull": "1926-12-04",
            "dateText": "Dec. 4, 1926",
            "dateYear": "1926",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0208",
            "title": "Branch of the Slovenian Women's Society",
            "topTitle": "Amerikanski Slovenec"
        },
        "chicagoforeignl0chic_0210": {
            "codes": [
                "iiic"
            ],
            "content": [
                "The Slovenian Section 28th International Eucharistic Congress in Chicago\nheld a meeting on July 22nd in the School Hall of St. Stjefan. More than\n300 representatives from numberless Slovenian colonies in America were\npresent.",
                "The chairman of this Section, Rev. K. Zakrajshek, opened the meeting\nwith a selected speech, in which he openly accused our Slovenian\nclergy of being selfish and of exploiting the church for their own\npurposes. \"These priests‘ attitude,\" he said, \"will rain good relationship \nand respect toward church leaders and cease religious feelings\nin their parishes.\"",
                "He advises all clergyman to pay more attention to the economic life\nof their church members; work on their welfare, education, etc., and\nbear in mind that the members of the church are already overcharged\nwith assessments. The church must be a place for peace of mind, not\nfor political or financial activities."
            ],
            "dateFull": "1926-07-16",
            "dateText": "July 16, l926",
            "dateYear": "1926",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0210",
            "title": "Slovenian Section 28Th International Eucharistic Congress in Chicago",
            "topTitle": "Amerikanski Slovenec"
        },
        "chicagoforeignl0chic_0211": {
            "codes": [
                "iiic",
                "iiia"
            ],
            "content": [
                "Last Sunday, the 20th of September, should live a long time in our memory.\nIn that day our South Chicago was the place where the Slovenes' Catholic\nconference held its inauguration. Thousands of members and friends of our\nCatholic organizations came here and brought other thousands of their\nrelatives with them to be present and witness this great celebration. Such\nor similar occasions, when people of our race gather together, is of great\nimportanoce to our life in this country. Long time friends, missing for\nyears or living apart in different places of America, found great joy in\nseeing each other. Valuable for their existence informations concerning\nworking conditions, customs, etc., have been exchanged. New acquaintances\nand friendships have been developed. This occasion manifests our strong\ndesire for unity and has been marked by colorful celebrations which will\nbe remembered for a long time."
            ],
            "dateFull": "1925-09-18",
            "dateText": "Sept. 18, 1925",
            "dateYear": "1925",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0211",
            "title": "Slovene Catholic Conference in South Chicago",
            "topTitle": "Amerikanski Slovenec"
        },
        "chicagoforeignl0chic_0212": {
            "codes": [
                "iiic",
                "iib2d"
            ],
            "content": [
                "The other day Martin Zeleznikar, president of the Slovenian National\nBenefit Society, issued a certain statement which is not as correct as it\nshould be.",
                "He plainly announced that their organization is the biggest of its kind\nin this country. We are not interested in his opinion nor jealous of their\norganization's business or growth, but what really interests us and brought\nhis statement to our attention is his accusation of our fanaticism, as well\nas his advice not to believe in the Roman God. We are not against religious\ntolerance because, living in this free country, we are used to that, but\na broadcast of this nature coming from a person of the Catholic faith, is\nreally surprising. Furthermore, we believe in everybody's liberty to\nbelieve or not to believe in certain doctrines, and cannot approve Mr.\nZeleznikar's unholy propaganda, just to reject religion or faith in God\nas something worthless and unnecessary for the life of our Slovene people.",
                "Mr. Zeleznikar and his followers from the Slovenian National Benefit Society\nmay believe that their society is really as big as the whole world, but this\nopinion does not give them right to muscle into other people's faith, nor\nhave they the authority to question the masses's belief in God. Being\nmembers or even leaders of a big national organization does not make them\nbig enough to absorb or fully understand religious ideals and doctrines.",
                "Amerikanski Slovenec and its followers will guard their unbroken faith\nand will fight for their religious ideas to the last limit."
            ],
            "dateFull": "1925-09-01",
            "dateText": "Sept. 1, 1925",
            "dateYear": "1925",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0212",
            "title": "Is That What You Call Honesty?",
            "topTitle": "Amerikanski Slovenec"
        },
        "chicagoforeignl0chic_0214": {
            "codes": [
                "iiic"
            ],
            "content": [
                "Religious sentiment is not very deeply rooted in the human soul, but a certain\nclass of people is trying its best to develop this feeling in order to exploit\nit. Often churches are built, religious customs invented, babies baptized, not\nto create by all this a religious pious feeling, but in most cases to provide\na fine living for priests, popes, clerics, rabbis, etc.",
                "Clerics are using this pious sentiment as a means of gaining power over the\npeople's souls as well as a means of dominating their pocketbooks. An unholy\ndesire to live well, and a rebellion against progress is cleverly hidden under\nthe robes of the church attendants, by banners, a church press, tokens, ceremonies, \nobservance of customs, etc.",
                "Clerics do not even hesitate to use political power by organizing, or supporting,\npolitical organizations. To live well is the secret desire of clericalism, by\n\nnow a most powerful organization. Anyone who feels deep down in his heart \na cultural and moral responsibility must resist this unholy power.",
                "It is the fast growing and firm opinion of the thinking classes that clericalism\nis nothing more than an open wound on the body of cultural and intellectual\nlife. This wound has become infected by now, and anybody serving the purpose\nof clericalism is nothing but a parasite.",
                "We find a number of reasons cited by the anti-clerical front in its fight on\nclericalism. Some of these are false pretenses of being pious by the clerics,\na strong but masked desire go achieve power over the souls of the people, with\nthe purpose of collecting for a comfortable living.",
                "On the other hand, we find the argument advanced that Rome, together with the\nrest of clericalism, is the worst enemy of our people's church.",
                "Finally, the worst misrepresentation of Christ's teachings is seen in the\n\nclerical life, customs, ceremonies, etc.",
                "There seems to be a strong fundamental truth in each one of these opinions."
            ],
            "dateFull": "1918-12-11",
            "dateText": "Dec. 11, 1918",
            "dateYear": "1918",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0214",
            "title": "Pious Clericalism",
            "topTitle": "Proletarec"
        },
        "chicagoforeignl0chic_0218": {
            "codes": [
                "iiie",
                "iib3",
                "iiib2",
                "ic"
            ],
            "content": [
                "The Slovenian Eagles form our largest colony in America, Cleveland, Ohio,\narrived here today under the leadership of their spiritual leader, Rev.\nFather H. Jager, assistant pastor in the Slovenian church there.",
                "This evening in Czech-American Hall, 1440 W. 18th St., they will meet \nand exhibit their drills and other calisthenics, which will interest all.\nIt is needless to say that we expect all Slovenes, young and old, to be\npresent and our cordial invitation is extended.",
                "An especially hearty welcome to our Cleveland visitors who are honoring \nus with their contribution.",
                "The Slovenian Orel (Eagles) have had no better chance to show their\naccomplishments than they have today in Chicago, and tomorrow at the\n\nall-Slavic congress at Lemont, Ill. never before had the American Slovenes an \nopportunity to witness such a glorious performance in their adopted country.",
                "The Slovenian Orel is a purely Slovenian institution. The Orel organization\nis a Slovenian national school out of which the people and church may get something mighty and\nof great significance.",
                "We need a pure, simple character here as well as in the old country. The \nold country needs it to surpress a continuous wall of foreign propaganda\nwhich is denationalizing and irreligious, and which aims to swallow us\nwhen we are nationally and politically weak.",
                "More than ever, here in America, we need a national Catholic Slovenian \ncharacter. Anybody that wants to, can see how anti-Slovenian evangelists\nare misleading (us). Here is where we need a revival of our characteristics!\nHow?",
                "The American-Slovenian generation, born and raised in America, is getting\nmore numerous from year to year. This young generation is here and \nready to take over our organizations, lodges, clubs, parishes in fact\nall that is ours. In ten years this new generation will reach maturity\nand our American-Slovenian institutions will naturally fall on their shoulders.",
                "Now the question is How much is this young generation Slovenian in\nnational and religious spirit? How are the families and individuals? Responsibility lies with leadership.",
                "Against Americanization there is no remedy; that we are in the melting \npot there is no question, but there is no sufficient reason why we go\nso fast.",
                "A great help to preserve our national and religious spirit is derived \nfrom Slovenian organizations. Among the first ones is the Orel (Eagles)\n\norganization. The purpose of the organization is obvious. It wants to \nraise strong national and religious characters. With athletics and physical\neducation, Catholic in spirit, raising them in a Christian faith, \nleading them regularly to receive sacraments, where Orels with faith \nin God are prepared for the fullest life, and are the most competent for leadership."
            ],
            "dateFull": "1929-07-06",
            "dateText": "Date Unknown",
            "dateYear": 0,
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0218",
            "title": "",
            "topTitle": "Amerikanski Slovenec"
        },
        "chicagoforeignl0chic_0223": {
            "codes": [
                "iiih",
                "ic"
            ],
            "content": [
                "Following an invitation from the president of K. S. K., Mr. Anton Grdina,\nthousands of our people in Chicago came to hear speakers on the 18th of\nJanuary, 1926. The general purpose of this call was to send a protest\nagainst the injustice done in Jugoslavia to our people in Slovenia. A committee \nto collect means to help our people in the old country has been\nformed from distinguished members of this colony.",
                "In this noble action our Slovenian women's organizations show great success, \nby organizing all kinds of entertainments and contributing large\nsums of money to support the above mentioned action. Last Sunday our\nSlovenian Women's Benefit Society held its annual carnival, which is\nalready pronounced a great success from moral and material standpoints.",
                "Such attitude toward problems of our needy people deserves high praise\nand encouragement. We people of Slovenian extraction, must help each\nother if we want to survive the hard times."
            ],
            "dateFull": "1926-01-22",
            "dateText": "Jan. 22, 1926",
            "dateYear": "1926",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0223",
            "title": "Protest Meeting",
            "topTitle": "Amerikanski Slovenec"
        },
        "chicagoforeignl0chic_0224": {
            "codes": [
                "iiih",
                "iiib1",
                "ig"
            ],
            "content": [
                "The Central Committee of the Slovenian Republican Organization (Slovenian Republican \nZveza) sent the following telegram to President Wilson:",
                "United States President, Woodrow Wilson",
                "Paris, France.",
                "The Slovenian Republican Alliance, representing an overwhelming majority of Slovenes \nin America, who faithfully followed your standard and have with untold sacrifice \nsupported your principles, appeal to you at the request of hundreds of Slovenian \nsocieties for protection of the Jugoslav rights at the peace conference.",
                "To hand over visibly Slovene and Croatian regions to a foreign rule would mean a\npainful injustice and great danger for the future. Jugoslavs, who admire your\ndemocratic consistency, believe in you and appeal in this critical hour for justice.\nExceedingly grateful to you for everything you have done for the rights of nations,\nand with the fact in mind that million of eyes are cast upon you, we, the Jugoslavs\n\nbeg you not to forget them in this hour of determination.",
                "Ethin Kristan, Chairman",
                "A. J. Terbovec, Secretary",
                "Monsieur Clemenceau",
                "President de la Conference",
                "Du Paix,",
                "Paris. France.",
                "The Slovenian Republican Alliance, representing an overwhelming majority of Slovenes \nliving in America, who have at all times truly and with great sacrifices\nsupported the cause of democracy, appeal at the request of hundreds of organizations \nto the peace conference for the consideration of the Jugoslav rights with\njustice.",
                "To yield regions inhabited by a visibly Jugoslav population to a foreign government \nwould hew into the Jugoslavs a burning wound and establish great danger for\nthe future. In the name of democracy, in the name of peace, and in the name of\nliberty, brotherhood, and equality, we beg of you, justice.",
                "Ethin Kristan, Chairman",
                "A. J. Terbovec, Secretary"
            ],
            "dateFull": "1919-02-12",
            "dateText": "Feb. 12, 1919",
            "dateYear": "1919",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0224",
            "title": "Slovenian Appeals",
            "topTitle": "Proletarec"
        },
        "chicagoforeignl0chic_0226": {
            "codes": [
                "iiih"
            ],
            "content": [
                "At the regular meeting of the Central Commitee of the Slovenian Republican Organization \nit has been decided to organize a subscription and collect donations\nfor a Million Dollar Fund, with which our people can be freed from the Italian\nannexation. The figure of a million dollars may sound enormous and alarming, but\nafter all. It is worth the cause we are fighting for; and if we can judge from\nthe number of sympathizers, we believe the figure will be easily attained.",
                "The following emblems will be distributed among subscribers:\nFive dollars will have an emblem bearing the initials S. R. Z.\nFrom five dollars to ten dollars, a similar emblem witn one star.\nFrom ten to twenty-five dollars, an emblem with two stars.\nFrom twenty-five to fifty dollars, an emblem with three stars.",
                "Artistic Diplomas will also be awarded to those who will subscribe from twenty-\nfive to fifty dollars."
            ],
            "dateFull": "1919-01-01",
            "dateText": "Jan. 1, 1919",
            "dateYear": "1919",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0226",
            "title": "Million Dollar Fund for Slavic Liberty.",
            "topTitle": "Proletarec"
        },
        "chicagoforeignl0chic_0227": {
            "codes": [
                "iiih"
            ],
            "content": [
                "On November 28, 1918 several of the Slovenian organizations, such as the Slovenes\nRepublican Organization and branches of Slovenian women organizations, called a\nmass meeting at Pilsen Auditorium.",
                "The main purpose of this meeting was to protest against the Italian aspiration to\nannex Jugoslavian sea-borders.",
                "The meeting was called to order by Frank Zaitz, who explained the purpose of the\nmeeting and read the resolution, which was signed by thirty thousand Slovenians\nand will be transmitted to President Wilson.",
                "A few excellent speakers offered lectures on the question of Slovenian and Jugoslavian \nintegrity and their right to decide the future of their people, living on\nthe Jugoslavian border, which the present Italian government is trying to occupy.\nAll speakers pointed out the strong wish of the Slovenian people abroad to keep\ntheir independence. They expressed their hope that America, in accordance with the\n\nPeace Conference Policy, will protect the minority.",
                "F. Zaitz also read an appeal, which has been transmitted to a number of administrative \nand political bodies, asking support in the Slovenian resistance to annexation.\nThe Slovenes from all political factions agreed to work shoulder to shoulder on this\nimportant question of Slovene liberty.",
                "The Slovenes, who attended this meeting expressed their strong protest against the\nLondon Pact, which permitted the Italians to occupy the Jugoslavian border.",
                "In order to cover expenses to transmit the appeals and pay rent for the hall, the\npeople collected the sum of $63.30.",
                "Great hope for President Wilson's intervention in this grave situation prevailed."
            ],
            "dateFull": "1918-12-04",
            "dateText": "Dec. 4, 1918",
            "dateYear": "1918",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0227",
            "title": "Manifest Meeting of Chicago Slovenes.",
            "topTitle": "Proletarec"
        },
        "chicagoforeignl0chic_0230": {
            "codes": [
                "iv",
                "iia1"
            ],
            "content": [
                "Dr. Otis M. Walter, one of the most prominent Slovenian physicians\nand surgeons on the West Side of Chicago, will celebrate a rare\naccomplishment. It was exactly twenty years ago May 1, that the\ndoctor established his office on Twenty-sixth Street and Crawford\nAvenue.",
                "At that time, the vicinity was not developed to the extent that it\nis today. One little room comprised his whole office. As the years\nrolled on, the doctor annexed larger quarters and installed modern\nmedical equipment. All types and nationalities of people trekked to\nhim, and his fame as a surgeon spread rapidly, as one after another\nof the many patients successfully overcame the most serious complications \nand illnesses, and his ability as a surgeon became known.",
                "From that same location, the doctor has been serving the people of this\ncommunity continuously during these twenty years. No worker, unable\nto pay for treatment or surgery work, has ever been turned away.",
                "The doctor has been an instructor in schools and colleges prior to the\nbeginning of his present professional career, and even after entry\ninto private business, he has been experimenting and developing new\nand modern methods of surgical and medical procedures. For the past\nthirteen years he has been a member of the surgical staff of the Francis\nWillard Hospital, and for the past ten years a member of the surgical\nstaff of the North Chicago Hospital. Dr. O. M. Walter is well-known\namong the Jugo-Slavs of this city. When asked to what he attributes\nhis success, he is firm in saying \"to the Slavic people.\"",
                "It is indeed a coincidence that the doctor should have reason, to celebrate \non the day of all days, May 1, and it is our hope that he may live \nmany more years, and assist the workers as he has heretofore."
            ],
            "dateFull": "1932-04-28",
            "dateText": "Apr. 28, 1932",
            "dateYear": "1932",
            "groups": [
                "slovene"
            ],
            "id": "chicagoforeignl0chic_0230",
            "title": "Dr. Otis M. Walter",
            "topTitle": "Proletarec"
        }
    },
    "dates": [
        {
            "1928": [
                "chicagoforeignl0chic_0036",
                "chicagoforeignl0chic_0043",
                "chicagoforeignl0chic_0053",
                "chicagoforeignl0chic_0059",
                "chicagoforeignl0chic_0060",
                "chicagoforeignl0chic_0168",
                "chicagoforeignl0chic_0191",
                "chicagoforeignl0chic_0201",
                "chicagoforeignl0chic_0202",
                "chicagoforeignl0chic_0207"
            ],
            "1926": [
                "chicagoforeignl0chic_0037",
                "chicagoforeignl0chic_0049",
                "chicagoforeignl0chic_0082",
                "chicagoforeignl0chic_0129",
                "chicagoforeignl0chic_0133",
                "chicagoforeignl0chic_0134",
                "chicagoforeignl0chic_0135",
                "chicagoforeignl0chic_0180",
                "chicagoforeignl0chic_0192",
                "chicagoforeignl0chic_0203",
                "chicagoforeignl0chic_0205",
                "chicagoforeignl0chic_0208",
                "chicagoforeignl0chic_0210",
                "chicagoforeignl0chic_0223"
            ],
            "1925": [
                "chicagoforeignl0chic_0038",
                "chicagoforeignl0chic_0040",
                "chicagoforeignl0chic_0084",
                "chicagoforeignl0chic_0117",
                "chicagoforeignl0chic_0142",
                "chicagoforeignl0chic_0143",
                "chicagoforeignl0chic_0146",
                "chicagoforeignl0chic_0194",
                "chicagoforeignl0chic_0211",
                "chicagoforeignl0chic_0212"
            ],
            "1910": [
                "chicagoforeignl0chic_0055",
                "chicagoforeignl0chic_0092"
            ],
            "1911": [
                "chicagoforeignl0chic_0057",
                "chicagoforeignl0chic_0130",
                "chicagoforeignl0chic_0138"
            ],
            "1937": [
                "chicagoforeignl0chic_0062",
                "chicagoforeignl0chic_0114",
                "chicagoforeignl0chic_0164",
                "chicagoforeignl0chic_0166",
                "chicagoforeignl0chic_0185"
            ],
            "1935": [
                "chicagoforeignl0chic_0067",
                "chicagoforeignl0chic_0070",
                "chicagoforeignl0chic_0073"
            ],
            "1932": [
                "chicagoforeignl0chic_0075",
                "chicagoforeignl0chic_0230"
            ],
            "1930": [
                "chicagoforeignl0chic_0080"
            ],
            "1919": [
                "chicagoforeignl0chic_0086",
                "chicagoforeignl0chic_0224",
                "chicagoforeignl0chic_0226"
            ],
            "1916": [
                "chicagoforeignl0chic_0090"
            ],
            "1915": [
                "chicagoforeignl0chic_0091",
                "chicagoforeignl0chic_0109"
            ],
            "1909": [
                "chicagoforeignl0chic_0093",
                "chicagoforeignl0chic_0152",
                "chicagoforeignl0chic_0154"
            ],
            "1908": [
                "chicagoforeignl0chic_0094",
                "chicagoforeignl0chic_0095",
                "chicagoforeignl0chic_0096",
                "chicagoforeignl0chic_0183"
            ],
            "1906": [
                "chicagoforeignl0chic_0097",
                "chicagoforeignl0chic_0156",
                "chicagoforeignl0chic_0158"
            ],
            "1918": [
                "chicagoforeignl0chic_0104",
                "chicagoforeignl0chic_0106",
                "chicagoforeignl0chic_0111",
                "chicagoforeignl0chic_0214",
                "chicagoforeignl0chic_0227"
            ],
            "1917": [
                "chicagoforeignl0chic_0107",
                "chicagoforeignl0chic_0161",
                "chicagoforeignl0chic_0162",
                "chicagoforeignl0chic_0181"
            ],
            "1934": [
                "chicagoforeignl0chic_0120",
                "chicagoforeignl0chic_0123",
                "chicagoforeignl0chic_0126"
            ],
            "1927": [
                "chicagoforeignl0chic_0132",
                "chicagoforeignl0chic_0170",
                "chicagoforeignl0chic_0178"
            ],
            "1912": [
                "chicagoforeignl0chic_0140",
                "chicagoforeignl0chic_0182"
            ],
            "1921": [
                "chicagoforeignl0chic_0150"
            ],
            "1913": [
                "chicagoforeignl0chic_0151"
            ],
            "1929": [
                "chicagoforeignl0chic_0196"
            ],
            "0": [
                "chicagoforeignl0chic_0218"
            ]
        }
    ],
    "codes": [
        {
            "ia2a": [
                "chicagoforeignl0chic_0036",
                "chicagoforeignl0chic_0037",
                "chicagoforeignl0chic_0038",
                "chicagoforeignl0chic_0040",
                "chicagoforeignl0chic_0053"
            ],
            "ic": [
                "chicagoforeignl0chic_0036",
                "chicagoforeignl0chic_0053",
                "chicagoforeignl0chic_0073",
                "chicagoforeignl0chic_0090",
                "chicagoforeignl0chic_0126",
                "chicagoforeignl0chic_0150",
                "chicagoforeignl0chic_0196",
                "chicagoforeignl0chic_0218",
                "chicagoforeignl0chic_0223"
            ],
            "iib1c": [
                "chicagoforeignl0chic_0037",
                "chicagoforeignl0chic_0126",
                "chicagoforeignl0chic_0126",
                "chicagoforeignl0chic_0132",
                "chicagoforeignl0chic_0133",
                "chicagoforeignl0chic_0134",
                "chicagoforeignl0chic_0135",
                "chicagoforeignl0chic_0138"
            ],
            "ia1a": [
                "chicagoforeignl0chic_0038",
                "chicagoforeignl0chic_0086",
                "chicagoforeignl0chic_0126"
            ],
            "ia3": [
                "chicagoforeignl0chic_0043",
                "chicagoforeignl0chic_0201"
            ],
            "iib2f": [
                "chicagoforeignl0chic_0043",
                "chicagoforeignl0chic_0201"
            ],
            "iib2g": [
                "chicagoforeignl0chic_0043",
                "chicagoforeignl0chic_0161",
                "chicagoforeignl0chic_0162"
            ],
            "ib2": [
                "chicagoforeignl0chic_0049"
            ],
            "iiic": [
                "chicagoforeignl0chic_0053",
                "chicagoforeignl0chic_0086",
                "chicagoforeignl0chic_0117",
                "chicagoforeignl0chic_0123",
                "chicagoforeignl0chic_0210",
                "chicagoforeignl0chic_0211",
                "chicagoforeignl0chic_0212",
                "chicagoforeignl0chic_0214"
            ],
            "id2a": [
                "chicagoforeignl0chic_0055"
            ],
            "ie": [
                "chicagoforeignl0chic_0055",
                "chicagoforeignl0chic_0062",
                "chicagoforeignl0chic_0067",
                "chicagoforeignl0chic_0070",
                "chicagoforeignl0chic_0073",
                "chicagoforeignl0chic_0075",
                "chicagoforeignl0chic_0080",
                "chicagoforeignl0chic_0082",
                "chicagoforeignl0chic_0084",
                "chicagoforeignl0chic_0086",
                "chicagoforeignl0chic_0090",
                "chicagoforeignl0chic_0091",
                "chicagoforeignl0chic_0092",
                "chicagoforeignl0chic_0093",
                "chicagoforeignl0chic_0094",
                "chicagoforeignl0chic_0095",
                "chicagoforeignl0chic_0096",
                "chicagoforeignl0chic_0097",
                "chicagoforeignl0chic_0132",
                "chicagoforeignl0chic_0138",
                "chicagoforeignl0chic_0140",
                "chicagoforeignl0chic_0151",
                "chicagoforeignl0chic_0152",
                "chicagoforeignl0chic_0154",
                "chicagoforeignl0chic_0156",
                "chicagoforeignl0chic_0158",
                "chicagoforeignl0chic_0161",
                "chicagoforeignl0chic_0162",
                "chicagoforeignl0chic_0164",
                "chicagoforeignl0chic_0166",
                "chicagoforeignl0chic_0185",
                "chicagoforeignl0chic_0196"
            ],
            "id2b": [
                "chicagoforeignl0chic_0057"
            ],
            "id2c": [
                "chicagoforeignl0chic_0059",
                "chicagoforeignl0chic_0060",
                "chicagoforeignl0chic_0075",
                "chicagoforeignl0chic_0082"
            ],
            "iid10": [
                "chicagoforeignl0chic_0059"
            ],
            "ig": [
                "chicagoforeignl0chic_0062",
                "chicagoforeignl0chic_0111",
                "chicagoforeignl0chic_0126",
                "chicagoforeignl0chic_0224"
            ],
            "iib2d": [
                "chicagoforeignl0chic_0067",
                "chicagoforeignl0chic_0070",
                "chicagoforeignl0chic_0080",
                "chicagoforeignl0chic_0097",
                "chicagoforeignl0chic_0117",
                "chicagoforeignl0chic_0142",
                "chicagoforeignl0chic_0142",
                "chicagoforeignl0chic_0143",
                "chicagoforeignl0chic_0146",
                "chicagoforeignl0chic_0150",
                "chicagoforeignl0chic_0151",
                "chicagoforeignl0chic_0152",
                "chicagoforeignl0chic_0154",
                "chicagoforeignl0chic_0156",
                "chicagoforeignl0chic_0158",
                "chicagoforeignl0chic_0170",
                "chicagoforeignl0chic_0170",
                "chicagoforeignl0chic_0185",
                "chicagoforeignl0chic_0212"
            ],
            "if6": [
                "chicagoforeignl0chic_0075",
                "chicagoforeignl0chic_0109"
            ],
            "id1a": [
                "chicagoforeignl0chic_0084"
            ],
            "iiia": [
                "chicagoforeignl0chic_0093",
                "chicagoforeignl0chic_0170",
                "chicagoforeignl0chic_0196",
                "chicagoforeignl0chic_0201",
                "chicagoforeignl0chic_0202",
                "chicagoforeignl0chic_0203",
                "chicagoforeignl0chic_0205",
                "chicagoforeignl0chic_0211"
            ],
            "iiih": [
                "chicagoforeignl0chic_0097",
                "chicagoforeignl0chic_0223",
                "chicagoforeignl0chic_0224",
                "chicagoforeignl0chic_0226",
                "chicagoforeignl0chic_0227"
            ],
            "if2": [
                "chicagoforeignl0chic_0104",
                "chicagoforeignl0chic_0106",
                "chicagoforeignl0chic_0107"
            ],
            "iia2": [
                "chicagoforeignl0chic_0114",
                "chicagoforeignl0chic_0117"
            ],
            "iiib2": [
                "chicagoforeignl0chic_0117",
                "chicagoforeignl0chic_0168",
                "chicagoforeignl0chic_0207",
                "chicagoforeignl0chic_0208",
                "chicagoforeignl0chic_0218"
            ],
            "iib1a": [
                "chicagoforeignl0chic_0120",
                "chicagoforeignl0chic_0123",
                "chicagoforeignl0chic_0126",
                "chicagoforeignl0chic_0129",
                "chicagoforeignl0chic_0130",
                "chicagoforeignl0chic_0181"
            ],
            "iib2e": [
                "chicagoforeignl0chic_0123"
            ],
            "va1": [
                "chicagoforeignl0chic_0123",
                "chicagoforeignl0chic_0126"
            ],
            "iid1": [
                "chicagoforeignl0chic_0126",
                "chicagoforeignl0chic_0164",
                "chicagoforeignl0chic_0166",
                "chicagoforeignl0chic_0168",
                "chicagoforeignl0chic_0170",
                "chicagoforeignl0chic_0178",
                "chicagoforeignl0chic_0180",
                "chicagoforeignl0chic_0181",
                "chicagoforeignl0chic_0182",
                "chicagoforeignl0chic_0183"
            ],
            "iid2": [
                "chicagoforeignl0chic_0126",
                "chicagoforeignl0chic_0164",
                "chicagoforeignl0chic_0166"
            ],
            "iiig": [
                "chicagoforeignl0chic_0126",
                "chicagoforeignl0chic_0185",
                "chicagoforeignl0chic_0205"
            ],
            "id1b": [
                "chicagoforeignl0chic_0126"
            ],
            "ib4": [
                "chicagoforeignl0chic_0126"
            ],
            "iv": [
                "chicagoforeignl0chic_0126",
                "chicagoforeignl0chic_0230"
            ],
            "iiie": [
                "chicagoforeignl0chic_0138",
                "chicagoforeignl0chic_0170",
                "chicagoforeignl0chic_0181",
                "chicagoforeignl0chic_0185",
                "chicagoforeignl0chic_0218"
            ],
            "iib2a": [
                "chicagoforeignl0chic_0140"
            ],
            "iib3": [
                "chicagoforeignl0chic_0170",
                "chicagoforeignl0chic_0218"
            ],
            "iiib4": [
                "chicagoforeignl0chic_0182"
            ],
            "iid6": [
                "chicagoforeignl0chic_0185",
                "chicagoforeignl0chic_0191",
                "chicagoforeignl0chic_0192",
                "chicagoforeignl0chic_0194"
            ],
            "if3": [
                "chicagoforeignl0chic_0202"
            ],
            "ik": [
                "chicagoforeignl0chic_0208"
            ],
            "iiib1": [
                "chicagoforeignl0chic_0224"
            ],
            "iia1": [
                "chicagoforeignl0chic_0230"
            ]
        }
    ],
    "values": [
        "slovene"
    ]
}