{
    "items": {
        "5423405_1_0705": {
            "codes": [
                "iid1"
            ],
            "content": [
                "There is no doubt that the consolidation of Croatian benevolent societies in the Croatian Fraternal Union influenced the Serbian workers to be interested in the consolidation of Serbian benevolent societies, but the main factor was the material situation and pressure of political facts.",
                "There were more resolutions in this direction. Lately a society of Ohio sent to other organizations a stronger resolution, which we will bring to our readers for consideration and eventually for action.",
                "The resolution reads: \"To all Serbian benevolent societies and organizations of America. Dear Brethren and Sisters: The situation of our Serbian benevolent associations of America is, to put it mildly, unfavorable. The great, rich insurance companies put obstacles in the way of every benevolent society, also of ours, in the form of claims to have a large reserve fund and other things.",
                "\"After the war in America, through organizations or certain persons, laws are introduced to burden the foreigner regarding his movements and work. To prohibit or limit the organization of foreigners, and to limit and censor the foreign press.",
                "\"Immigration laws are adopted. Many bills are introduced for registration, fingerprinting and photographing of immigrant workers. These bills are before the United States Congress and may become laws at any time.",
                "\"It can easily happen that the right to organize benevolent societies will be taken away. All such actions are directed against immigrant workers, also Serbians.",
                "\"The divergence of our benevolent societies, caused by inimical politics of the old country, the confidence in them lost because of malversations, demand a consolidation.",
                "\"The consolidation of Srbobran (Serb Defender), Union of Freedom, of the union of conscious Serbians is possible, if all these organizations take the idea in hand and act according to the following points.",
                "\"1. The constitution of a committee of three members for each participating organization.",
                "\"2. That the candidates for such a committee be named by June 1st.",
                "\"3. That the candidates be nominated at regular meetings.",
                "\"4. Elected at the above time.",
                "\"5. The majority of votes decides.",
                "\"6. The committee elected has to (a) examine the standing of each organization, (b) call a convention, (c) prepare everything necessary for such a convention.",
                "\"7. That the elected committee have full freedom of action.",
                "\"8. That the decisions of this committee be valid for each represented organization.",
                "\"Adopted unanimously at the regular meeting on April 11, 1926, by the Society of St. George, No. 80, at Canton, Ohio.",
                "The coming convention of Serbian organizations must act seriously for the consolidation of all."
            ],
            "dateFull": "1937-06-07",
            "dateText": "June 7, 1937",
            "dateYear": "1937",
            "groups": [
                "serbian"
            ],
            "id": "5423405_1_0705",
            "title": "About the Consolidation of Serbian Benevolent Societies",
            "topTitle": "Radnik"
        },
        "5423966_0037": {
            "codes": [
                "iib1a",
                "iib1c",
                "iib2e",
                "ic"
            ],
            "content": [
                "If there were a nation of which it can be said that it sings morning, noon, and night, undoubtedly that would be the Serbian nation. Ever since migrating down to the Balkan Peninsula, the ancestors of the Serbian people of to-day started their very life with singing. Whether it was while offering a sacrifice to the deity of that time, or from joy at the birth of an heir to the family, or any other significant event in their lives, they sang always! Even during the period of five centuries of life in slavery under the Turkish yoke, the song never left the lips of those brave southern Slavs, who, even in moments of tragedy, found singing their only consolation. And therein lies the answer to the world-famous, limitless treasure of Serbian national folklore, of which so highly spoke the great Goethe, the famous Grimm Brothers, and many other noted writers of the world.",
                "Guslar, with his one string instrument gusle, sang the songs of heroism, of bravery, of sublime sacrifices undergone by his forefathers and even by his contemporaries.",
                "And even at the present time when symphonies and choirs of the world delight and awe highly polished audiences, the old bard, Guslar, can still move the hearts of the Serbian people to tears, listening to the sad, heart-rendering tales of bravery and sacrifices on Kosovo Polje.",
                "Being among the latest immigrants to this country, the Serbians found other Slavs already settled here, engaged in their livelihood. And what little they carried with them, Serbians brought also their songs, their undying desire to sing.",
                "And Karageorge is one of the early pioneers in the field of national music.",
                "What intention the early members had, it has always remained as the prime goal, that is, to spread the Serbian songs in every corner where ever a Serbian soul can be found.",
                "Twenty-one years ago, while the brave soldiers of little Serbia, under the glorious guidance of the late King Peter Karageorgevich and his equally famous and illustrious son, the late King Alexander Karageorgevich, were led from victory to victory, a few Serbians who were among the early settlers met together and the Karageorge Society was born. All these Serbians were from the territory under the political reign of Austro-Hungary, and seeing the famous dynasty of Karageorgevich slowly liberating the enslaved Serbians in the South from under Turkish yoke, they wanted their society to be named Karageorge, in honor of the dynasty which they knew was going to free them, too, from another yoke - that of Austro-Hungary.",
                "To-day when their fatherland is free, when the famous dynasty of Karageorge is guiding the destinies of their families left behind in Europe, Karageorge members are continuing their singing and their cultural work for the betterment of human education among their own people, and they are continuing to be ambassadors of good will and interpreters of the soul of a new, united nation, Jugoslavia. While in this friendly country, Karageorge members will strive to keep high the ideal that some day all Slavs can come together and fulfil the dreams of poets and the prophecies of many, many centuries.",
                "In twenty-one years of its existance Karageorge has presented many concerts and many plays with musical background, never with mercenary purposes in mind.",
                "Due to the length of time and changes, the society has had several teachers. It has had its officials - president, and secretary - changed almost annually."
            ],
            "dateFull": "1934-12-09",
            "dateText": "Dec. 9, 1934",
            "dateYear": "1934",
            "groups": [
                "serbian"
            ],
            "id": "5423966_0037",
            "title": "From Memorial Book, \"Serbian Singing Society, Karageorge.\"",
            "topTitle": ""
        },
        "5423966_0041": {
            "codes": [
                "ia1a",
                "iib2d"
            ],
            "content": [
                "On the initiative of John R. Palandech, leaders of the foreign language press, a \"dinner-meeting\" was held at the Hamilton Club for the representatives of the foreign language press to devise the right means to avoid the danger of closing the schools.",
                "Introduced by Mr. Polandech, various speakers addressed the audience and Mr. Bogan, Superintendent of Schools, exposed in detail the reasons why the schools must not be closed. It would be a shame for a cosmopolitan city like Chicago.",
                "A moving picture demonstrated that Chicago spends less than any other city for public education.",
                "The expense for education in Chicago amounts to 2.40 per cent and that for the criminal element to 8 per cent of the taxes.",
                "The assembly resolved to try every means to reach a solution of the problem of not neglecting the most important branch of social life, the education of the children who represent the future generation."
            ],
            "dateFull": "1929-06",
            "dateText": "June, 1929",
            "dateYear": "1929",
            "groups": [
                "serbian"
            ],
            "id": "5423966_0041",
            "title": "Against the Menace of Closing the Public Schools",
            "topTitle": "Vita Nuova"
        },
        "5423966_0043": {
            "codes": [
                "ia1a",
                "ic"
            ],
            "content": [
                "The Carnegie Foundation issued a booklet: \"Directions for foreign students in the U. S. of A.\"",
                "Foreigners coming to American higher schools find it difficult on account of difference in educational systems. The purpose of said booklet will be to inform the students how to overcome these difficulties of a different educational system.",
                "According to statistics there were in the school year 1919-1920 in the higher schools of our U. S. of A. not less than 10,000 students from foreign lands. Most of them are Chinese, about 1,000.",
                "From Jugoslavia they were as follows:",
                "(1) From Croatia; 2 in the state of Pennsylvania",
                "(2) From Jugoslavia; 1 in the State of New York",
                "(3) From Servia; 24--5 in Florida, 2 in Illinois, 3 in Indiana, 1 in Iowa, 2 in Minnesora, 2 in Nebraska, 1 in Pennsylvania, 2 in South Carolina, 1 in Texas, 5 in Virginia, 4 from Slovenia 18 in the State of Iowa."
            ],
            "dateFull": "1923-05-02",
            "dateText": "May 2, 1923",
            "dateYear": "1923",
            "groups": [
                "serbian"
            ],
            "id": "5423966_0043",
            "title": "Jugoslav Students in Schools of Higher Learning in Chicago",
            "topTitle": "Ujedinjeno Srbstvo"
        },
        "5423966_0046": {
            "codes": [
                "ia3",
                "iiia"
            ],
            "content": [
                "Why do you not learn? Why do you not open your mouth and your eyes? Why do you stay all alone, like a stranger along the sea, where anybody knowns how to swim except you?",
                "You suffer, despair, because the road is hard, so you progress very slowly.",
                "Look around. Open your eyes, thousands of opportunities are here, why do you not seize one? Read newspapers and advertisements, listen to what is said around you, go in society, where our word is not spoken. It does not matter even if they laugh at you, you will never make the same mistake again.",
                "You will have difficulties, you will get exhausted in the struggle of thoughts and words, but every day you will get nearer to your goal. It makes no difference if you are not understood at first. You are not to blame. Many others do not know the English language. Many have only rudimentary knowledge of it, and they have to learn it too.",
                "Do you want to earn money and to get a good position? There are no prospects",
                "for you until you learn the English language. That is your admission ticket. Every one has to pay the same price. For a career free tickets are not given.",
                "There is so much talk about success. But what is success? Success is the ability to do better than the average man.",
                "Don't do things just well. Perform things better, but to do that you must learn - English"
            ],
            "dateFull": "1922-10-31",
            "dateText": "Oct. 31, 1922",
            "dateYear": "1922",
            "groups": [
                "serbian"
            ],
            "id": "5423966_0046",
            "title": "Learn the English Language.",
            "topTitle": "Ujedinjeno Srbstvo"
        },
        "5423966_0049": {
            "codes": [
                "ib4",
                "iiic"
            ],
            "content": [
                "It is a very seldom practiced custom for our colonies to dedicate church banners.",
                "In the early part of our colonial life this custom was observed, but later it became a rarity. Church banners are emblems of Serbian religious unity. But nowadays you hardly can see those banners carried out of the church.",
                "Banner-carriers usually were selected from the ranks of highly respectable members in the colony, and it was considered as a sign of high respect and honor to be a banner-carrier.",
                "Serbians in Chicago, through many efforts and sacrifices, became the proud owners of the most beautiful church in America, and on Sunday, March 11th, with joy and happiness had a pompous ceremony, the dedication of the new church banner.",
                "This banner was donated by Mrs. Helen Schysler, who is of German descent but through her marriage has become a devoted member of our church. This banner has been made from very expensive material and represents a beautiful piece of artistic work.",
                "The dedication took place in a particularly pompous church ceremony, with hundreds of Serbs present.",
                "Rev. Styachich made a very interesting speech, explaining the meaning of this banner and ceremony.",
                "A banquet held in the church hall followed the dedication ceremony. Members of the church showed great enthusiasm about the restoration of this almost forgotten custom, still dear to their hearts. Chairman of this banquet was Simo Shakota, president of the church organization.",
                "The Serbian banner is the emblem of the people's struggle, bloody fights and suffering. Through centuries the Serbs have been fighting for their liberty and national unity, always carrying around the banners which they collected from rebellious fighters. Now when their ideal is fulfilled, the banners are stored in churches, and stay as the memory of a very sad past, a silent monument to national heroism.",
                "(Signed) Simo Shakota."
            ],
            "dateFull": "1934-03-20",
            "dateText": "March 20, 1934",
            "dateYear": "1934",
            "groups": [
                "serbian"
            ],
            "id": "5423966_0049",
            "title": "Dedication of Church Banner",
            "topTitle": "United Serbians"
        },
        "5423966_0053": {
            "codes": [
                "ic",
                "iiib2"
            ],
            "content": [
                "Our greatest ideal of strong unity among Serbians, Croatians and Slovenes never has been accomplished. It seems that the cement which we need to bring complete unity was lacking, and it was mutual understanding between not the race, but different classes. This grave problem at least was solved, as it concerns Chicago colonies, by organizing a Jugoslav club, which has just recently opened the door to members and friends, and is already showing noticeable progress.",
                "The first meeting, which the organized group held in the Morrison Hotel, brought a great number of our people. We are happy to advise our people that as far as we can remember, there was not a single occasion where people of different social, business, or professional standing met together, as it was seen on this meeting of the Jugoslav club.",
                "Doctors, engineers, priests, businessmen small and big, common laborers, etc., all united by the great problem of national unity, mixed together and showed most desirable equality.",
                "The main object of this club, as we already announced, is promotion of national unity, but as we have been informed, the club will have quite a large activity in the way of organizing our groups in the way of financial, political, educational cooperation.",
                "Ugljeska Pupich, Secretary."
            ],
            "dateFull": "1930-07-03",
            "dateText": "July 3, 1930",
            "dateYear": "1930",
            "groups": [
                "serbian",
                "montenegrin"
            ],
            "id": "5423966_0053",
            "title": "Jugoslav Club in Chicago",
            "topTitle": "Pravda"
        },
        "5423966_0056": {
            "codes": [
                "if1",
                "iv"
            ],
            "content": [
                "Among candidates in coming primaries April 11th, on the Republican ticket for County Commissioner, of whom will be ten elected, you will find our editor Mr. Ivan R. Palandech.",
                "Vote for him if you vote the Republican Ticket."
            ],
            "dateFull": "1923-02",
            "dateText": "Feb. 1923",
            "dateYear": "1923",
            "groups": [
                "serbian"
            ],
            "id": "5423966_0056",
            "title": "Candidate in Primaries",
            "topTitle": "Ujedinjeno Srbstvo"
        },
        "5423966_0058": {
            "codes": [
                "iib1a"
            ],
            "content": [
                "The Serbian singing society, Sloboda, of South Chicago, was organized in the year 1927. At the beginning it had only 32 members, male and female singers.",
                "For the past ten years the choir of Sloboda has made its own name and reputation among Serbians in America.",
                "Sloboda's concerts in Chicago, Detroit, Akron, and other places, were a bright part in colonial life and brought joy and happiness to their people.",
                "These concerts also brought excellent understanding and admiration among people of other nationalities in America for Serbian motives and songs.",
                "Today Sloboda celebrates the tenth anniversary of its noble work of propaganda for Serbian music with a grand concert to be given under the direction of their organizer, director, teacher and composer, Mr. Adam Popovich.",
                "From 1927 to 1936 its director was Professor Joseph Kindl."
            ],
            "dateFull": "1937-05-16",
            "dateText": "May 16, 1937",
            "dateYear": "1937",
            "groups": [
                "serbian"
            ],
            "id": "5423966_0058",
            "title": "Tenth Anniversary of the Society Sloboda",
            "topTitle": "Memorial Book"
        },
        "5423966_0060": {
            "codes": [
                "iib1a"
            ],
            "content": [
                "The Jugoslav Song Festival, which was held on April 18, 1937, at 5 P. M. at the church, 1905 W. Schiller (formerly Fowler) street, Chicago, Ill., was a huge success.",
                "Jugoslav music lovers and leaders of our colony were present and many out-of-town came here for the occasion. Participating were soloists from the Chicago Civic Opera and the Savine Vocal Ensemble."
            ],
            "dateFull": "1937-05-01",
            "dateText": "May 1, 1937",
            "dateYear": "1937",
            "groups": [
                "serbian"
            ],
            "id": "5423966_0060",
            "title": "Jugoslav Song Festival",
            "topTitle": "Yugoslavia"
        },
        "5423966_0061": {
            "codes": [
                "iib1a"
            ],
            "content": [
                "In the early days of Serbian migration to this country we find in every city, whether large or small, the formation of different colonies. In a similar way a Serbian colony was established on the North Side of Chicago in the first decade of the 20th century. In the autumn of 1906, a group of Serbians on the North Side of Chicago organized the first Serbian Singing Society in the United States of America, with the name of a great and immortal Serbian poet, Branko Radichevich.",
                "The society was organized on November 14, 1906. The following were the ones who brought about this organization: Simo Providzalo, Manoylo Yovanovich, George Miloyevich and Petar O. Stiyacich (present Serbian priest of Chicago). The aim of this society was to promote Serbian songs, produce theatrical acts from Serbian life, and do other cultural work among the Serbs here.",
                "The first instructor of the Singing Society Branko Radichevich was Risto Baltich; also, the first song mentioned on the records was \"Sharp Swords\";",
                "the first theatrical performance was \"The Peasant Scamp,\" which was given in the year 1908. In the same year the society affiliated with the first Serbian string (tamburitza) orchestra.",
                "During the 30 years of the society's existence, hundreds of different songs were sung and over forty theatrical acts were played, some of them numerous times at the request of the Serbian people, not only in Chicago but in adjoining cities as far as Milwaukee, Wis., or Detroit, Mich., and always were successful morally and materially. By competing in contests, the society received three trophies: from the Slovenian Singing Society 'Lira,' 'Nitranska Slovak's Sokol,' and the Croatian Singing Society 'Preradovich' of Gary, Ind.",
                "On September 4, 1916, the society celebrated its 10th anniversary, and also blessed its flag. In the year 1924 the society celebrated the 100th birthday of their patron, Branko Radichevich, with the participation of many other Slavic singing societies, and the net proceeds were sent abroad for the erection of a monument to Branko Radichevich. The society worked in harmony with the Serbian Eastern Orthodox Church, Holy Resurrection of Chicago. Since its beginning it was very active in the erection of the new church and hall. It also participated in many national and religious movements. It gave donations to the Red Cross here and abroad during the Balkan and World wars, and sent volunteers from the society.",
                "On March 29, 1931, the Serbian Singing Federation of America was organized in which many of our members had taken active part in the work. The Serbian Singing Society 'Branko Radichevich' is classed in the Federation as No. 1.",
                "The 4th of October, 1931, the society celebrated its 25th anniversary, in which many other singing societies participated.",
                "For the particular celebration a memorial book was published with a brief history, and on that occasion they honored many of our prominent men as honorary members of the Singing Society 'Branko Radichevich'.",
                "Before that time the society had honored Prof. M. I. Papin, Dr. Anton Bjankini, Ivan Vuchetich, John R. Palandech, etc.",
                "In 1933 the society was reorganized and now the Serbian youth, boys and girls, take an active part as regular members. The society has ninety active members and many sponsoring members. Their headquarters are at the new Serbian church hall, 1905 Fowler Street, Chicago.",
                "On February 17, 1935, the Serbian Singing Society 'Obilich' affiliated with the Serbian Singing Society 'Branko Radichevich' under the name of Serbian Singing Society 'Branko Radichevich.' Now they have no competition, as it is the only Serbian singing society in the Chicago Serbian Orthodox parish. As their new instructor they have elected Prof. Alexander Savine, a prominent and well known vocal and musical instructor, who takes a very active interest in the society. Their first success came to them in the summer of 1935 during a convention of the Serbian National Federation in Milwaukee, Wis. The entire society took an active part in the church services and later attended the banquet.",
                "The second great event came in the spring of this year when the Middle West Serbian singing societies entered in a contest given at Gary, Ind. They were awarded first prize, free transportation for all members to Akron, Ohio, and participation in the Serbian singers' contest on May 29, 30 and 31, 1936. They were selected as one of the best and awarded first prize, a silver cup, donated by Mrs. Varvara (Smith) Papin, daughter of the late Prof. Michael Papin, honorary member of the Serbian Singing Society \"Branko Radichevich.'",
                "Our society is proud to be the first possessor of the trophy.",
                "The following are benefactor members: Serbian Orphan Society, S. B. Society \"Obilich,\" United Serbian Society \"Jedinstvo,\" and \"Kolo Srpskih Sestara.\"",
                "By Very Rev. Petar O. Stiyachich."
            ],
            "dateFull": "1936-11-08",
            "dateText": "Nov. 8, 1936",
            "dateYear": "1936",
            "groups": [
                "serbian"
            ],
            "id": "5423966_0061",
            "title": "Serbian Singing Society 'Branko Radichevich'",
            "topTitle": "Souvenir Book of the Serbian Singing Society 'Branko Radichevich'"
        },
        "5423966_0066": {
            "codes": [
                "iib1a"
            ],
            "content": [
                "The society of Princess Zorka, well known among the Serbians in South Chicago, held a concert last Sunday.",
                "Croatian Hall, especially rented for this concert, was filled with guests who came not only from South Chicago, but even as far as 100 miles from Chicago.",
                "Two orchestras rendered the musical program. The people present showed real enjoyment and uttered very high comments concerning their complete satisfaction."
            ],
            "dateFull": "1936-10-08",
            "dateText": "Oct. 8, 1936",
            "dateYear": "1936",
            "groups": [
                "serbian"
            ],
            "id": "5423966_0066",
            "title": "Concert Society Princess Zorka",
            "topTitle": "United Serbians"
        },
        "5423966_0067": {
            "codes": [
                "iib1a",
                "iiie"
            ],
            "content": [
                "Serbia's songs are full of the sharp ecstacy, gloom of life and Serbian mountains and valleys. Their motifs are the cries of a spirit that has had truth suddenly revealed to it - a truth so all-significant that it can be felt only passionately and unrestrainedly.",
                "Serbian laughter and Serbian sorrow, as revealed in the songs, is never superficial. It is always so madly profound and representatively Serbian that even the American Serb who has never seen Jugoslavia must experience a sort of nostalgia.",
                "The Serbian Singing Society, Sloboda, of South Chicago, is made up almost entirely of Serbians of the second and third generation, who have never been to Jugoslavia, and these powerful songs affect them so deeply that seventy of them attend weekly society meetings, to catch, in a phrase here and there, a glimpse of the passionate land from which their parents came.",
                "Organized in 1927 under the leadership of George Lalich, and with a membership of rather elderly men, Sloboda has since then attracted the youth of South Chicago to such extent that it became necessary in 1932 to organize a junior choir of youngsters between the ages of 10 and 16.",
                "The junior choir is made up of some fifty members, promising material for the future of Sloboda.",
                "During its seven years of existence, Sloboda has appeared in its own concerts on the average of twice a year, and it has, in addition, participated in the programs of other Jugoslav societies. On the more important holidays, Sloboda sings the holy liturgy in St. Michael Serbian Orthodox Church. In 1929 Sloboda won second prize in a choral contest of all Jugoslav societies sponsored by the Preradovich Society of Gary, Indiana.",
                "In the spring of 1934 Sloboda gave a concert in Detroit, Michigan, and it has been invited to sing in Akron, Ohio, in the spring of 1935. Under the able leadership of Adam Popovich, its president, the society has kept clear of a deficit during the entire depression. Mr. Popovich's aides this year are Joseph Grba, vice-president; Christine Cuculjevich, secretary; Samuel Pejovich, treasurer; Mildred Dragash, financial secretary. Ever since its founding Sloboda has been under the direction of Dr. Joseph Kindl, well-known pianist and graduate of the Praha Conservatory of Music."
            ],
            "dateFull": "1931",
            "dateText": "Date Unknown",
            "dateYear": 0,
            "groups": [
                "serbian"
            ],
            "id": "5423966_0067",
            "title": "(From Memorial Book) ()",
            "topTitle": "History of the Serbian Choir, Sloboda"
        },
        "5423966_0070": {
            "codes": [
                "iib1a",
                "iib3"
            ],
            "content": [
                "The Serbian Church Choir, Ravanica, will sponsor a spring festival beginning with church services and including a concert of choral music in a two-day programme Saturday and Sunday. The Serbian Choir, Sloboda (Liberty), a mixed choir of sixty voices, directed by A. Kindl, will arrive on Saturday afternoon at the church where the local choir will honor them with a banquet at 7:30 P:M.",
                "Adam Popovich, president of the choir, will be the guest of honor and principal speaker. Representatives of local Serbian fraternal and cultural societies will speak.",
                "Both choirs will sing at the church services, which will begin at 10 A:M and at which the Very Rev. D. Trbulovich, will officiate.",
                "Beginning at 1:30 P:M a baseball game will be played between the Serbian Eagles of South Chicago, and the local team of the Rumanian Junior League.",
                "Following the ball game the teams and fans will parade to the Serbian Hall, where a choral concert will be given at 7:30 P:M at which the Sloboda will sing an all-Mocranjac programme honoring the great composer of Serbian choral music.",
                "Mr. B. Cuculjevich, vice-president of the Serbian National Singing Federation and the founder of the visiting choir, will be the principal speaker on the evening programme which will be followed by dancing.",
                "William J. Cameron of the Ford Motor Company will be the guest speaker Sunday eveing at the Presbyterian Church.",
                "The pastor of this church, Carl E. Kircher, also will speak on the subject:",
                "\"The Human Tongue - Its Uses and Abuses\"."
            ],
            "dateFull": "1932",
            "dateText": "1932",
            "dateYear": "1932",
            "groups": [
                "serbian"
            ],
            "id": "5423966_0070",
            "title": "(From Scrap Book - Adam Popovich)",
            "topTitle": "Serbian Choir, Sloboda, at Festival"
        },
        "5423966_0072": {
            "codes": [
                "iib1a"
            ],
            "content": [
                "The Serbian Choir, Sloboda (Liberty), of South Chicago, a mixed chorus of sixty voices directed by A. Kindl, will sing with the choir, Ravanica, of the Detroit Serbian Orthodox Church in the annual spring festival of the latter choir today and Sunday.",
                "The local choir will give a banquet for the Chicago singers in the church tonight; Adam Popovich, president of the visiting choir, will be the principal speaker.",
                "Sunday morning both choirs will sing at services in the church.",
                "Sunday afternoon there will be a ball game at Goldberg Field.",
                "In the evening the Chicago choir will give a concert of compositions by Mokranjac, and the Detroit choir, directed by John T. Fill, will sing compositions of Binichki.",
                "B. Cuculjevich, vice-president of the Serbian National Singing Federation, and founder of the visiting choir, will speak."
            ],
            "dateFull": "1931",
            "dateText": "1931",
            "dateYear": "1931",
            "groups": [
                "serbian"
            ],
            "id": "5423966_0072",
            "title": "Chicago Serbian Choir, Sloboda",
            "topTitle": "(From Scrap Book - Adam Popovich)"
        },
        "5423966_0073": {
            "codes": [
                "iib1a"
            ],
            "content": [
                "In a two-day program Saturday and Sunday, the Serbian Church choir, Ravanica, will sponsor a spring festival that will include religious services, a choral concert, banquet and baseball game.",
                "The Serbian Choir, Sloboda, of Chicago, will be guest singers."
            ],
            "dateFull": "1931",
            "dateText": "1931",
            "dateYear": "1931",
            "groups": [
                "serbian"
            ],
            "id": "5423966_0073",
            "title": "Chicago Serbian Choir, Ravanica",
            "topTitle": "(From Scrap Book - Adam Popovich)"
        },
        "5423966_0075": {
            "codes": [
                "iib1c"
            ],
            "content": [
                "Our society Obilich announced its annual ball, which will be held on Dec. 28th in Colonial Hall, at 1800 Center Avenue.",
                "On this occasion our Serbians will have an opportunity to see the performance of the well-known Dramatic Club in a play entitled, \"The Montenegro Dream in America.\"",
                "We strongly recommend a visit to this national gathering."
            ],
            "dateFull": "1909-12-14",
            "dateText": "Dec. 14, 1909",
            "dateYear": "1909",
            "groups": [
                "serbian"
            ],
            "id": "5423966_0075",
            "title": "Society Obilich",
            "topTitle": "Balkan"
        },
        "5423966_0077": {
            "codes": [
                "iib1c",
                "ia3"
            ],
            "content": [
                "His Excellency Dr. Konstantin Fotich, Yugoslav Minister in Washington, has conferred a high honor on the special committee of the Yugoslav Song Festival by accepting their request, namely, that this musical event shall be under his distinguished patronage.",
                "The announcement of the forthcoming musical production has created vivid interest among the leading American experts in music and drama to such an extent, that a number of the high officials are expected to attend the performance.",
                "They will represent the University of Chicago, Northwestern University, the Board of Education, leading Conservatories of Music in Chicago, actors, painters, sculptors, playrights, composers, conductors, etc. The complete list of their names will be published shortly.",
                "Yugoslav music lovers and leaders of our colony will be present and many out of town folks will especially come here for that occasion.",
                "The participating soloists from the Chicago Civic Opera and Savine's Vocal Ensemble are rehearsing daily under the personal direction of our famous composer Alexander Savine. The variety of the program, as well as the quality of the production, promises to be of the highest order.",
                "Yugoslav Song Festival will be held on April 18, 1937, at 5 P.M. at the Auditorium of the Serbian Church, 1905 W. Fowler St., Chicago, Ill.",
                "Samuel G. Milnovich."
            ],
            "dateFull": "1937-04",
            "dateText": "April 1937",
            "dateYear": "1937",
            "groups": [
                "serbian"
            ],
            "id": "5423966_0077",
            "title": "[Yugoslav Song Festival]",
            "topTitle": "Record Books of the Yugoslav Song Festival"
        },
        "5423966_0079": {
            "codes": [
                "iib1c",
                "iib1a",
                "iia3c",
                "iiib2",
                "iib3",
                "iiie",
                "iv"
            ],
            "content": [
                "More than 20,000 Jugo-Slavs filled the west stands of Soldier Field at the Jugo-Slav Day festivities yesterday.",
                "Prior to the program a parade half a mile long marched to the monument created by Dr. Meshtrovich, which stands, at Congress street and Michigan avenue, and the statue was unveiled.",
                "Adam Popovich, a young man of South Deering, directed the hundred-piece tamburica orchestra. Folk-songs were rendered by the United Jugo-Slav Society. Choral societies from Detroit, St. Louis, and Cleveland also sang.",
                "The national folk-costume was everywhere in evidence. Only four Croatian girls of this district attended in folk-costume.",
                "Joseph W. Bazdavich, physical director of the Jugo-Slav Sokol Federation, supervised the gymnastic exercises.",
                "John Tilkovich, prominent Jugo-Slav composer and director of Detroit, directed the choral music, and Vaclav Husa led the band.",
                "American Legion Band 175 of the Woodlawn Post, Peoples Gas Company American Legion Post 310, Commonwealth Edison American Legion Post (champions of Illinois), and Semsley American Legion Post thrilled the vast crowd with army formations and musical numbers.",
                "The Jugo-Slav Children's Sokol and the Ladies' Auxiliary were reviewed on parade, followed by the Serbian Sisters.",
                "The Slovenian Ladies, headed by girls and youths, paraded in folk-costumes.",
                "The South Chicago Eagles were much in evidence.",
                "Radmila Govedarica was declared Jugo-Slav World's Fair queen. She will receive a trip to Jugo-Slavia.",
                "Concluding the extensive program, Mrs. Brayak led the assembly in singing \"My Country.\" Several thousand Jugo-Slav Day guests then visited the Century of Progress exposition."
            ],
            "dateFull": "1933",
            "dateText": "1933",
            "dateYear": "1933",
            "groups": [
                "serbian"
            ],
            "id": "5423966_0079",
            "title": "Twenty Thousand Jugo-Slavs Attend Festivities Sunday at Century of Progress Exposition",
            "topTitle": "Daily Calumet"
        },
        "5423966_0083": {
            "codes": [
                "iib2d",
                "ie"
            ],
            "content": [
                "After the careful work of many months the Serbian Workers of Chicago have succeeded in issuing their Serbian Socialist newspaper, Narodni Glas, for the first time. This paper will inform Serbian workers about class struggle and Socialism.",
                "The Narodni Glas (People's Voice) was founded by workers and is written by workers; therefore the paper is recommended.",
                "We call upon the comrades who support our journal with all their might to support also this, the latest pioneer of the Jugoslav Socialist movement, and to try to spread Narodni Glas among Serbian workers.",
                "Subscription, one year, one dollar.",
                "Address: Narodni Glas",
                "2350 Clybourn Avenue",
                "Chicago, Illinois"
            ],
            "dateFull": "1911-01-27",
            "dateText": "Jan. 27, 1911",
            "dateYear": "1911",
            "groups": [
                "serbian"
            ],
            "id": "5423966_0083",
            "title": "First Issue of Narodni Glas",
            "topTitle": "Radnicka Straza"
        },
        "5423966_0084": {
            "codes": [
                "iib2d"
            ],
            "content": [
                "We have been informed that contributions and soliciations for the newly organized Serbian workers' newspaper, Radnichka Straza, are doing nicely.",
                "It is our duty to help our comrade Serbians. All contributions should be addressed to the \"Serbian Committee,\" 2350 Clybourn Avenue, Chicago, Illinois."
            ],
            "dateFull": "1910-12-27",
            "dateText": "Dec. 27, 1910",
            "dateYear": "1910",
            "groups": [
                "serbian"
            ],
            "id": "5423966_0084",
            "title": "Contribution for Serbian Newspaper Radnichka Straza",
            "topTitle": "Proletarec"
        },
        "5423966_0085": {
            "codes": [
                "iib2d",
                "ie"
            ],
            "content": [
                "The time has come when also the Serbian workers in the United States will step forward in the fighting circle of the American workers. They must march openly under their own flag, armed with victory and enlightenment.",
                "There was talk about a new Serbian Socialist paper. This paper printed in the cyrilic alphabet will be issued about New Year, under the name of Narodni Glas (People's Voice). The edition of the paper is in charge of the central committee of the Serbian department of the Jugoslav Workingmen's Educational and Political Federation.",
                "We are convinced that this news will gladden Serbian workers all over America, and that they will concentrate all their powers on having it edited. Your support in money should be sent to the Serbian Socialist Committee, 2350 Clybourne Avenue, Chicago."
            ],
            "dateFull": "1910-12-02",
            "dateText": "Dec. 2, 1910",
            "dateYear": "1910",
            "groups": [
                "serbian"
            ],
            "id": "5423966_0085",
            "title": "Forward, Serbian Workers!",
            "topTitle": "Radnicka Straza"
        },
        "5423966_0087": {
            "codes": [
                "iib2e",
                "iia3b"
            ],
            "content": [
                "I have been listening to the Jugoslav program over station WWAE every Sunday and can truthfully say that it is the best foreign program on the air, and the Popovich Brothers deserve great credit for the wonderful music they have been giving us.",
                "Mr. Adam Popovich, as the leader of this group of talented musicians, is doing a great deal to stimulate a new interest in our folk-lore music.",
                "With the aid of Mr. Palandech and Mr. Popovich's knowledge of music (being a composer of songs and music which he has shown in his new song of Kossovo, the undying chapter of history of old Serbia), Adam can give us something we as Jugoslavs want and are in great need of.",
                "A new collection of songs with a modern version is given us on this program. It gives us a chance to learn songs from our mother country.",
                "This would not only give radio audiences satisfaction, but would be very beneficial to the Jugoslav cause, by bringing out the cultural side of the race and the artistic gifts of our people.",
                "Here's luck to Popovich Brothers and to all of Mr. Palandech's splendid artists, and of course, to our own Mr. Stepanchev, who is doing a splendid job at announcing.",
                "Emily Colovich."
            ],
            "dateFull": "1937",
            "dateText": "1937",
            "dateYear": "1937",
            "groups": [
                "serbian"
            ],
            "id": "5423966_0087",
            "title": "Jugoslav Radio Programs",
            "topTitle": "From A. Popovich's Scrapbook"
        },
        "5423966_0090": {
            "codes": [
                "iib3"
            ],
            "content": [
                "Serbian Eagles, of South Chicago, Illinois, claimant of the Serbian baseball title of the nation, will play the Rumanian Junior League at Goldberg Field, Ferry and Hastings Street, today at 1:30 P:M."
            ],
            "dateFull": "1931",
            "dateText": "1931",
            "dateYear": "1931",
            "groups": [
                "serbian"
            ],
            "id": "5423966_0090",
            "title": "Serbian Eagles Baseball Team - Champion",
            "topTitle": "(From Scrap Book - Adam Popovich)"
        },
        "5423966_0091": {
            "codes": [
                "iib3",
                "iiie",
                "iib1a"
            ],
            "content": [
                "A farewell banquet is to be given tomorrow night at the Serbian church hall for the Serbian Singing Society, Sloboda, and the Serbian Eagles Baseball team, both of which will leave for Detroit, Michigan on Saturday May 19th via bus, where, on the following Sunday, the baseball team will play the champion Roumanians in an international tilt.",
                "The Sloboda will be featured in a grand concert in the evening, at which the Popovich brothers of South Chicago will furnish the music to climax the two day program."
            ],
            "dateFull": "1931",
            "dateText": "1931",
            "dateYear": "1931",
            "groups": [
                "serbian"
            ],
            "id": "5423966_0091",
            "title": "Serbian Chorus Baseball Team",
            "topTitle": "(From Scrap Book - Adam Popovich)"
        },
        "5423966_0092": {
            "codes": [
                "iib3"
            ],
            "content": [
                "The Serbian Eagles heavyweight basketball team defeated the Calumet Tigers 18 - 6 at Grand Crossing Park last night.",
                "The Eagles will travel to Franklin Park tomorrow night to play the famous Royal Sportsmen."
            ],
            "dateFull": "1931",
            "dateText": "1931",
            "dateYear": "1931",
            "groups": [
                "serbian"
            ],
            "id": "5423966_0092",
            "title": "Serbian Eagles Win",
            "topTitle": "(From Scrap Book - Adam Popovich)"
        },
        "5423966_0093": {
            "codes": [
                "iib3"
            ],
            "content": [
                "Nick Channic, popular East Side athlete, was elected captain of the Serbian Eagles basketball team at the close of the team's regular practice period at Trumbull Park last night.",
                "Channic is the right forward on the Eagles team and was elected by a unanimous vote."
            ],
            "dateFull": "1912-06-01",
            "dateText": "Date Unknown",
            "dateYear": 0,
            "groups": [
                "serbian"
            ],
            "id": "5423966_0093",
            "title": "Basketball ()",
            "topTitle": "(From Scrap Book - Adam Popovich)"
        },
        "5423966_0094": {
            "codes": [
                "iib3",
                "ic"
            ],
            "content": [
                "Upon request of Bohemian Sokol Organization in Chicago there will be a grand meeting of All-Slavs Sokol Organizations in America.",
                "Place: - Sokol Hall on 43rd and Winchester Street, Chicago",
                "Date: - November.",
                "A great attendance is expected."
            ],
            "dateFull": "1913",
            "dateText": "1913",
            "dateYear": "1913",
            "groups": [
                "serbian"
            ],
            "id": "5423966_0094",
            "title": "All-Slavs Sokol Meeting (February )",
            "topTitle": "Soko (Sokol)"
        },
        "5423966_0095": {
            "codes": [
                "iib3"
            ],
            "content": [
                "Our Chicago Slavic colony will witness a great gathering of Slavic Sokols in America. On June 22 - 23rd, in Chicago, will be held the National Sokol Convention, at which a great number of Sokol representatives from all parts of America, where branches exist - will be present.",
                "The program of this unusual celebration will consist of various kinds of shows, parades, exercises, concerts, theatrical performances, etc."
            ],
            "dateFull": "1912-06-01",
            "dateText": "June 1, 1912",
            "dateYear": "1912",
            "groups": [
                "serbian"
            ],
            "id": "5423966_0095",
            "title": "First Sokol's Convention in America",
            "topTitle": "Soko (Sokol)"
        },
        "5423966_0096": {
            "codes": [
                "iib3",
                "iid1"
            ],
            "content": [
                "The open-air exercises of the Sokol, presented on May 5, were a great success. They left a deep impression of appreciation and pride in the memories of the many friends and members who attended.",
                "The following societies were present: \"Serbian Sokol,\" Gary, Indiana; \"Srpsko Jedinstvo\" (Serbian Unity); \"Srpsko Jamburashko Drushtvo\" (Serbian String Society); \"Srladya\" (Serbia); \"Srpsko Pjevacko Drushtvo\" (Serbian Singing Society); \"Branko Raditchevich\" Society, Chicago; \"C.D.D. Oblich\" Singing Society, Chicago; \"Serbian-American Benevolent Society;\" \"Coko\" (Sokol) ,Chicago; \"Slavia,\" Bohemian Sokol; \"Coko\" (Sokol), Bohemian Oak Park; \"Croatian Sokol;\" \"La Speranta,\" Rumanian Gymnastic Society."
            ],
            "dateFull": "1912-06-01",
            "dateText": "June 1, 1912",
            "dateYear": "1912",
            "groups": [
                "serbian"
            ],
            "id": "5423966_0096",
            "title": "Serbian Sokol in Chicago",
            "topTitle": "Coko (Sokol)"
        },
        "5423966_0097": {
            "codes": [
                "iib3",
                "iib2g"
            ],
            "content": [
                "Mankind is progressing steadily in science, religion, politics, and in people's education. Ways and means, forms and ideals are different, but the fundamental structure of progress is always the same.",
                "New forms of education have been laid in the organization of the \"Sokol,\" whose slogan is: \"A healthy soul in a healthy body.\"",
                "This slogan is as old as mankind.",
                "Today, not only the \"Sokol,\" a special organization to promote this idea, but even schools are getting interested in accepting this form of education as a standard point in their daily program.",
                "What the Serbian \"Sokol\" in America wants: (1) The Serbian \"Sokol\" in America, as any other similar organization, is pursuing \"sokol\" ideas to promote strength in bodies by especially designed exercises. This improved strength is by all means very important to our new generation in America, where people work under very unhealthyful conditions. The American people a long time ago recognized the priceless value of physical education through promotion of their national sports, such as base-ball, foot-ball, fighting, wrestling, etc.",
                "(2) The Serbian \"Sokol\" aims to promote democracy. They accept old and young, poor and rich, teachers and merchants, doctors and laborers. Social and economic differences are erased.",
                "(3) The Serbian \"Sokol\" wants to develop healthy men and women.",
                "The Bohemian \"Sokol\" organization through experience has been convinced that physical education is equally important for males and for females, so in the \"Sokol\" no differences exist between man, woman, girl or boy.",
                "(4)The Serbian \"Sokol\" wants to improve their members' intellect. This purpose is accomplished by organizing lectures, courses, meetings, discussions, etc.",
                "(5) The Serbian \"Sokol\" offers a disciplined education. They want to build strong characters; punctuality, patience, seriousness, etc., are promoted to the last degree.",
                "(6) The Serbian \"Sokol\" also desires to prepare their members for the eventual possibility of becoming defenders of their old and new country.",
                "As we can see, the ideals of the \"sokol\" are high and must be considered as such from any standpoint.",
                "The means by which these ideals are promoted are very simple and inexpensive. It is true that the \"sokol\" is saving much money for its members by occupying their body and mind, which keeps them away from taverns and gambling. The result of \"Sokol\" work cannot be easily estimated. It is very high in ideals and has many tremendous possibilities for expansion.",
                "Dr. Paja Radosavljevich."
            ],
            "dateFull": "1912-05-01",
            "dateText": "May 1, 1912",
            "dateYear": "1912",
            "groups": [
                "serbian"
            ],
            "id": "5423966_0097",
            "title": "Serbian Sokol and its Ideal",
            "topTitle": "Soko (Sokol)"
        },
        "5423966_0101": {
            "codes": [
                "iid1",
                "iiib2"
            ],
            "content": [
                "Thirty-five years of unselfish work on organizing people of Serbian extraction in South Chicago was celebrated on May 23rd of this year by the oldest known Serbian organization, Lika and Krbava.",
                "On this rare occasion hundreds of Serbians, Montenegrins, and the representives of other Slavic nations paid their tribute and homage to fifty-seven old members and pioneers who, thirty-five years ago, got the excellent idea of putting together unorganized old-timers.",
                "Hard work, patience, and love for their neighbors' welfare was the fundamental principle of this society. The self-preservation of those pioneers, of course, played a part in organizing this society.",
                "After a brilliant celebration, partially in church and outside, members and friends held a banquet in the church's hall. Dozens of speeches were delivered by prominent members of the Serbian colony, representatives of several societies, press and political organizations. This showed the attitude of the people toward the activities of the society Lika and Krbava.",
                "The general motive in these speeches was praise of the noble, self-sacrificing and energetic work done by the society in improving colony life, economically, culturally, educationally and religiously.",
                "In the evening the South Chicago Dramatic Club, assisted by a combined choir of a few singing societies, gave a well selected entertainment. The dance following continued until after midnight. Old and young were mixed in perfect harmony, enjoying the music, native songs, dances, games, etc.",
                "G. Kovacevich",
                "St. Louis, Mo."
            ],
            "dateFull": "1937-06-01",
            "dateText": "June 1, 1937",
            "dateYear": "1937",
            "groups": [
                "serbian"
            ],
            "id": "5423966_0101",
            "title": "35th Anniversary of the Serbian Society Lika and Krbava",
            "topTitle": "Amerikanski Srbobran"
        },
        "5423966_0103": {
            "codes": [
                "iid1"
            ],
            "content": [
                "The Serbian Benevolent Society St. Djuradj was organized April 15, 1926, as branch No. 61 of the Serbian Federation Sloboda. At the beginning the above mentioned society had only 50 charter members, whose names are still on the list of today.",
                "During 1927 the society also organized a youth branch. During three years of existence (1926-29), the society succeeded in increasing its membership to 150 members. Today the society's membership consists of 200 adults and 140 children. The assets of this society are valued at over $6,500. From its beginning until today the society has paid to its members $8,082 in sick benefits.",
                "The sick benefit consists of $10 cash per week, plus free medical service during the entire period of illness. This society has always been known as a very active (one) in practically all Serbian affairs in Chicago, and helped financially and morally each cultural or national enterprise.",
                "The Serbian church on the north side of Chicago draws especially much financial help from this society. Every church need is partially paid from this society's treasury. Here are just a few donations registered in its treasury book:",
                "Membership statistics show that the society has:",
                "These statistics show that the insurance policies of this society are highly protected due to the big number of young members.",
                "This society is very young and compares to others; it still shows a bigger cash capital, which offers the best protection to policyholders."
            ],
            "dateFull": "1936-05-10",
            "dateText": "May 10, 1936",
            "dateYear": "1936",
            "groups": [
                "serbian"
            ],
            "id": "5423966_0103",
            "title": "Tenth Anniversary",
            "topTitle": "Memorial Book of the Serbian Benevolent Society St. Djuradj"
        },
        "5423966_0106": {
            "codes": [
                "iid1",
                "iiib2"
            ],
            "content": [
                "In 1878 the Chicago Serbian colony formed their first entertainment club, Obilich. In 1881 the first benevolent society, named Serbian and Montenegro Benevolent Society, was organized.",
                "Due to the prevailing idea that the Serbians, Herzegovinian and Montenegrin provinces must be united into one kingdom, it was found necessary to change separatistic names of existing societies to some name which would be acceptable by all Slav (Balkan) nationalities, and (which) would not suffer from future changes. So, on Oct. 17, 1894, delegates from the society Obilich and the Srpsko Montenegro Benevolent Society unanimously decided, during a meeting, to accept the new name of \"United Serbian Society Jedinstvo,\" under which title the Illinois charter was drawn."
            ],
            "dateFull": "1936",
            "dateText": "1936",
            "dateYear": "1936",
            "groups": [
                "serbian"
            ],
            "id": "5423966_0106",
            "title": "Why the Name \"Srpsko Jedinstvo\" Has Been Selected",
            "topTitle": "Memorial Book Srpsko Jedinstvo"
        },
        "5423966_0107": {
            "codes": [
                "iid1",
                "iib2d"
            ],
            "content": [
                "At the beginning of the 20th century, when the first Serbian organization was established, an idea was born that all existing societies must unite into a federation. So, in 1903, on the initiative of the two societies, Ujedinjeni Srbi and Srpsko Jedinstvo, the foundation was laid for the first Serbian Brotherhood Benevolent Federation, with headquarters in Chicago.",
                "In 1905 this Chicago federation started to publish its organ, Ujedinjeno Srpsko, and the first editor appointed was Mr. George Chokorilo.",
                "In 1907 this federation was liquidated.",
                "On the same day that Chicago organized its federation, the Serbian societies from the East organized another federation, Srbobran, with headquarters in Pittsburg, Pa. In 1906 this federation started to publish its organ, Amerikanski Srbobran, which still exists today.",
                "At the same time the Serbian and Montenegrin organized their own federation in Montana, which they named Serbian and Montenegro Federation, and began publishing their organ, Balkan, in 1908.",
                "So in 1908 we found three federations existing and printing three separate newspapers.",
                "Because all three federations had the same purpose, naturally the idea of merging was under way and became so strong that in 1909 delegates from all three federations held their convention in Cleveland, and on this occasion there was organized a powerful federation named \"Sloga,\" with headquarters in New York City, and as (its) first president, Michael Pupin, famous scientist (was appointed).",
                "The federation Sloga was liquidated on Feb. 28, 1921. Since that time the Serbian society Srpsko Jedinstvo decided to work as an independent organization, as it is today."
            ],
            "dateFull": "1936",
            "dateText": "1936",
            "dateYear": "1936",
            "groups": [
                "serbian"
            ],
            "id": "5423966_0107",
            "title": "Srpsko Jedinstvo and the Federation",
            "topTitle": "Memorial Book Srpsko Jedinstvo"
        },
        "5423966_0109": {
            "codes": [
                "iid1",
                "iiib2"
            ],
            "content": [
                "The Serbian-Montenegrin Benevolent Society, which was organized in Chicago in the year 1881, during its convention held on Oct. 17, 1894, decided to change the name as follows: Srpsko Jedinstvo (Serbian Unity), and since that time its activities are known under the same name.",
                "In 1903 Srpsko Jedinstvo was acting as a branch of the First Serbian Brotherhood Benevolent Federation of America. In 1900 it became part of the federation Sloga, which had been liquidated on February 28, 1921. Since 1921 the society Srpsko Jedinstvo was working as an independent organization. The purpose of this society is to give financial help to their members in case of sickness, accident, surgical aid and death; also to spread propaganda on national culture and unity. Its aim is also to help educate their members in American citizenship.",
                "The society accepts as members any Serbian or Slav, man or woman, from 18 to 40 years of age, who are healthy and of a sound mind.",
                "The youth organization Jedinstvo accepts any child from 2 to 18 years of age, and whose parents are of Serbian, Croatian or Slovenian extraction.",
                "Since 1894 the society has delivered honorary membership to the following distinguished personalities: (1) Alexandar I Obrenovich, former king of Serbia; (2) Nicholas I, Prince of Montenegro; (3) Queen Natarie, Serbia; (4) Nikola Tesla, inventor; and many others whose cultural or philanthropic activities have made them eligible for such an honorary title.",
                "Mr. Ivan Vuchetich, first organizer of this society and a member for 55 years, was elected as permanent honorary president."
            ],
            "dateFull": "1936",
            "dateText": "1936",
            "dateYear": "1936",
            "groups": [
                "serbian"
            ],
            "id": "5423966_0109",
            "title": "55th Anniversary",
            "topTitle": "Memorial Book of the Serbian Society Srpsko Jedinstvo"
        },
        "5423966_0111": {
            "codes": [
                "iid1",
                "iiib2",
                "iiie",
                "iib2f"
            ],
            "content": [
                "More than half a century has passed since our struggling forefathers emigrated from the sunny Adriatic shores of our brave Fatherland to the great bountiful land of freedom, these United States.",
                "Little did those pioneers know at the time that the outcome of their original Obilich Pleasure Club, consisting of just a few men, was to be the present-day United Serbian Society, a strong and independent benevolent society, with a foundation as firm as the Rock of Gibraltar.",
                "The founders of the United Serbian Society and those who came later endured many hardships to keep up such a society of their mother tongue in a new country and a strange environment. But pride, courage and perseverance guided them to the high ideals on which they founded the United Serbian Society, and on which the building of society and its youth is being carried on.",
                "In the first years men were the only ones admitted to membership. Later on, in 1917, women were invited to join, but not until 1921 was there the thought of having any child enter the society.",
                "Between the years 1921 and 1930 little was done to interest the children in joining the Junior Order, but in 1930, when the first elder, Mr. Rade Govedarica, was elected, the Junior Order began having its own meetings, officers and social functions.",
                "Mr. Jovo Simich followed Mr. Govdarica as elder and both did all they could to enroll more members and to inspire and acquaint them with our beautiful Serbian language. For the few short years of its activity, our Junior Order has to its credit an enrollment of 106 fine, healthy boys and girls ranging in age from two to twenty-one years.",
                "The activities of the group are many and varied. Regular monthly meetings are held. Everything is done in the Serbian language. At the head of the Junior Order we have a fine, intelligent girl, Desanka I. Tarailo, as president.",
                "She has held this position for a number of years and has filled it extremely well. She is competent in the Serbian language and is an active and willing worker in any undertaking. She is, indeed, a credit to the Junior Order.",
                "Bozo R. Nogulich stands out among the boys as the most active and acts as vice-president. A short time ago he was awarded a gold pin for having enrolled the largest number of new members in the order.",
                "One of the most interesting activities created in our Junior Order is the Tamburica Orchestra known as \"The Happy Mountaineers,\" (or) Vesels Brdjani. They happily sing and play their cares away.",
                "The Junior Order maintains Serbian classes every Saturday, so that its boys and girls may avail themselves of the opportunity to learn how to read and write their beautiful language. There are three groups which meet at different hours, and they are classed as to their ability. About 65 attend every week. Besides reading, writing and history, they learn national songs, games and kolos (national dance).",
                "They are always willing and ready with recitations and plays whenever a program for some society is needed. All of these things help them to understand and know about their ancestral home better than they would know otherwise.",
                "Sports have not been neglected either. For the past three years a baseball and basketball team have been sponsored by the Junior Order. It has been supplied with Jerseys, caps, ball and other necessary equipment besides moral support. The team has played quite regularly and has been victorious over most of the teams played. The younger boys have organized a team also and play very well for their ages.",
                "One of the most outstanding events in the history of the Junior Order of the United Serbian Society occurred on June 9, 1935, when the Junior Order gave a modest gift to our church in Chicago, the Holy Resurrection, at 1905 Fowler St.",
                "The gift was the icon of St. Sava, a beautiful masterpiece which will long remain in our church as a remembrance of its children who love the church and the memory of Saint Sava. The year 1935 was celebrated as St. Sava's year, for it was the 700th anniversary of the death of this famous monk, who first instilled religion and education into the hearts of our people.",
                "The Junior Order rightly celebrated St. Sava's year by studying all about him at meetings and classes throughout the entire year. The climax was the dedication of the icon in the church, on June 9th.",
                "All the children worked hard to earn the funds to purchase this icon by means of selling tickets in a popularity contest sponsored by the Junior Order.",
                "And so on, the Junior Order of the United Serbian Society keeps on its various activities. This is all due to the efforts of the children themselves, who take interest to do these things through the cooperation and fine support given them by the present officers and other interested members of the United Serbian Society; and through the parents who allow and urge their children to such activity.",
                "The generosity and kindness of the Serbian National Federation and its worthy secretary, Mr. Branko Perich, cannot be surpassed. The Serbian books which they provided for the Serbian children in the Chicago community proved a great help to us also. Their method of spreading Serbian culture is indeed praiseworthy. Many thanks to all of the above mentioned.",
                "The goal of the Junior Order is to outnumber the membership of the United Serbian Society itself, to work loyally and conscientiously on behalf of the society and the juniors, to preserve the ideals forwarded to them by the elders; to know the beautiful traditions and history of Jugoslavia, never to forget the mother tongue, to be good orthodox Christians living up to the standards of Pravoslaveye as taught by the immortal Sveti Sava; to be loyal sons of Jugoslavia; to understand and respect the ideals for which its heroic men fell, as did the never-to-be-forgotten King Alexander I, and finally, as young American citizens to respect and love their adopted country, the United States, and its great President, Franklin D. Roosevelt.",
                "By Nada Pasovich, Elder."
            ],
            "dateFull": "1936",
            "dateText": "1936",
            "dateYear": "1936",
            "groups": [
                "serbian"
            ],
            "id": "5423966_0111",
            "title": "The Junior Order of the United Serbian Society",
            "topTitle": "Memorial Book Srpsko Jedinstvo"
        },
        "5423966_0119": {
            "codes": [
                "iid1"
            ],
            "content": [
                "Being the oldest and most active Serbian society, Srpsko Jedinstvo can be called a nursery of humanitarian, benevolent and educational organizations in Chicago.",
                "A branch of Srpsko Jedinstvo became in 1905 the society Petar Karadjozdjevich.",
                "Among the members of Srpsko Jedinstvo there was organized the first singing society Branko Raditchevich, which has existed for over 30 years.",
                "Also Srpsko Jedinstvo organized among its member the first musical society Srbadia. Also Prosveta, a cultural and educational society, came out of Srpsko Jedinstvo. The Serbian Soko, sokol organization, is among the accomplishments of Srpsko Jedinstvo.",
                "Up to 1917, Srpsko Jedinstvo was considered as a bachelor's organization because of the majority of its members being men, but in 1919 the Women's Society was accepted and united with this society, as it is today."
            ],
            "dateFull": "1936",
            "dateText": "1936",
            "dateYear": "1936",
            "groups": [
                "serbian"
            ],
            "id": "5423966_0119",
            "title": "Srpsko Jedinstvo as a Nursery of Serbian Organizations",
            "topTitle": "Memorial Book Srpsko Jedinstvo"
        },
        "5423966_0121": {
            "codes": [
                "iid1",
                "iid10"
            ],
            "content": [
                "A quarter of a century ago, on February 19, 1910, a few Serbians organized the society St. George. Thirty-five members, organizers, signed the minutes of the first meeting and elected as the first president of their society Mr. Jovan Vukovich.",
                "During the first few years the society slowly progressed. In those dark days in the history of the World War, when the liberty of their native land was at stake, the society of St. George gave all its treasury to the Red Cross, and sent a number of volunteers to the Serbian front.",
                "Because people of Serbian extraction started to move their colony from Cicero, where this society originally was organized, it came as an accommodation and necessity to move the headquarters to Fowler St. After the war the membership of the society was steadily growing and today it has 125 adult and 116 children members."
            ],
            "dateFull": "1935-05-05",
            "dateText": "May 5, 1935",
            "dateYear": "1935",
            "groups": [
                "serbian"
            ],
            "id": "5423966_0121",
            "title": "25th Anniversary",
            "topTitle": "Memorial Book of the Serbian Benevolent Society St. George"
        },
        "5423966_0122": {
            "codes": [
                "iid1",
                "iib1a",
                "iib1c"
            ],
            "content": [
                "The Serbian Benevolent Society Obilich was organized in the year 1905 under the laws of the State of Illinois.",
                "The purpose of this society is to help their members socially, morally and financially in case of trouble, and especially in sickness. The society pays sick benefits at the rate of $1 per day; also death benefits up to $600. Their accident policy covers injured legs, hands, and almost every part of the human body. For all the above mentioned benefits members are charged only $1.75 per month.",
                "Besides financial help, this society is well known as the most active society in the colony in propagating culture and education among Serbians in Chicago. During the long period of its existence, the society has organized a great number of concerts, theatrical performances, dances, etc.",
                "From 1905 to 1921 the society belonged to the former Serbian federation, Sloga. The year 1921 brought the federation Sloga into dissolution, and all of its branches, as for example the society St. George, were facing the problem of forming some other unity or working independently.",
                "The majority in the society of St. George advocated unity with the Serbian federation in Pittsburg. The minority decided to remain independent and has remained so up to today under the name of \"Obilich.\"",
                "Only 35 members were left in Obilich after the members split, but in this case the old proverb, \"Not quantity but quality is what counts,\" proved to be right.",
                "A small number of sincere and willing workers showed great activity and drew not only the sympathy of the Serbians, but also succeeded in enlarging its membership to 180 members. Today the society Obilich is known as the richest society in Chicago, and has a capital of $20,000.",
                "This society also proved the fact that Serbians and Croats can cooperate if good will and honest work prevail, because the society Obilich has a large number of Croatian members.",
                "A great pride and the future hope of this society is the Youth Organization, which grew rapidly not only in its membership but also in its activities.",
                "Obilich's youth band, choir, dramatic club, etc. are the cultural part of the Serbian colony on the North Side of Chicago."
            ],
            "dateFull": "1935-03-10",
            "dateText": "March 10, 1935",
            "dateYear": "1935",
            "groups": [
                "serbian"
            ],
            "id": "5423966_0122",
            "title": "30th Anniversary",
            "topTitle": "Memorial Book of the Serbian Benevolent Society Obilich"
        },
        "5423966_0126": {
            "codes": [
                "iid4"
            ],
            "content": [
                "The Serbian Orphan's Society in Chicago organized a tea party at the church hall on October 4th.",
                "The humanitarian aim of this society brought in hundreds of guests who were interested in rendering help to unfortunate orphans of Serbian parentage.",
                "This noble society, during the past quarter of a century, gave a home and education to hundreds of children.",
                "The president of this society is the well known and oldest member of Chicago's colony, Mr. John Vuchetich."
            ],
            "dateFull": "1936-10-08",
            "dateText": "Oct. 8, 1936",
            "dateYear": "1936",
            "groups": [
                "serbian"
            ],
            "id": "5423966_0126",
            "title": "Tea Party",
            "topTitle": "United Serbians"
        },
        "5423966_0128": {
            "codes": [
                "iid10",
                "iiic"
            ],
            "content": [
                "Under this name, on February 18, 1934, came the reorganization of a very old women's society in South Chicago.",
                "The general aim of this society is humanity, education, charity and religious propaganda among the younger generation of Serbians in South Chicago and vicinity.",
                "This society contributes largely to the upkeep of the church and school. It also supports the House for the Blind in Jugoslavia. A number of helpless people have been supplied with food and money."
            ],
            "dateFull": "1937-05",
            "dateText": "May , 1937",
            "dateYear": "1937",
            "groups": [
                "serbian"
            ],
            "id": "5423966_0128",
            "title": "Of Serbian Sisters  Zorka",
            "topTitle": "Memorial Book"
        },
        "5423966_0130": {
            "codes": [
                "iiib2",
                "iid1"
            ],
            "content": [
                "The open-air exercises of the Sokol, presented on May 5, were a great success. They left a deep impression of appreciation and pride in the memories of the many friends and members who attended.",
                "The following societies were present: \"Serbian Sokol,\" Gary, Indiana; \"Srpsko Jedinstvo\" (Serbian Unity); \"Srpsko Jamburashko Drushtvo\" (Serbian String Society); \"Srladya\" (Serbia); \"Srpsko Pjevacko Drushtvo\" (Serbian Singing Society); \"Branko Raditchevich\" Society, Chicago; \"D.D.D. Oblich\" Singing Society, Chicago; \"Serbian-American Benevolent Society\"; \"Soko\" (Sokol), Chicago; \"Slavia,\" Bohemian Sokol; \"Soko\" (Sokol), Bohemian Oak Park; \"Croatian Sokol\"; \"La Speranta,\" Rumanian Gymnastic Society."
            ],
            "dateFull": "1912-06-01",
            "dateText": "June 1, 1912",
            "dateYear": "1912",
            "groups": [
                "serbian"
            ],
            "id": "5423966_0130",
            "title": "Serbian Sokol in Chicago",
            "topTitle": "Soko (Sokol)"
        },
        "5423966_0132": {
            "codes": [
                "iiib3a",
                "iib1c",
                "iib1a",
                "iiih"
            ],
            "content": [
                "The Jugo-Slav Unity Day committee, which is arranging for the celebration of the fifteenth anniversary of the Jugo-Slav union, will meet at the Hamilton Club on Monday evening.",
                "Subcommittees will be named to arrange for church services in the Jugo-Slav parishes, for the banquet which will be given at the Hamilton Club, and for the concert and dance that will follow.",
                "Professor Alexander Savine is arranging the musical program, on which artists of world-wide operatic fame will appear.",
                "The Jugo-Slav minister to the United States, Dr. Leonid Pitamic, will speak at the banquet. John R. Palandech is chairman of the committee."
            ],
            "dateFull": "1933-09-11",
            "dateText": "Sept. 11, 1933",
            "dateYear": "1933",
            "groups": [
                "serbian"
            ],
            "id": "5423966_0132",
            "title": "Jugo-Slavs Plan Festival",
            "topTitle": "Calumet Evening American"
        },
        "5423966_0133": {
            "codes": [
                "iiib3a"
            ],
            "content": [
                "Every year, for generations, we Serbs and Montenegrins celebrate our national holiday Vidov-Dan. This year, as usually, the celebration was held on June 29. All proceeds will be turned to the treasury of our church for a new church building. Vidov-Dan has a sad memory in our hearts. On this date in 1389 we lost our kingdom and on the same date, a few centuries after, we established our free country, when two of our enemies, Turks and Hungarians, lost their kingdom.",
                "After the church rites, all people present formed a long procession, with a band playing and a choir singing national tunes. Thousands of people joined this procession on its way to Viker Park Hall, where the official celebration was progressing with a dinner and special entertainment. Plenty of money has been collected for the church fund. Our singing society 'Branko Radichevich' sang many songs to everybody's delight."
            ],
            "dateFull": "1930-07-03",
            "dateText": "July 3, 1930",
            "dateYear": "1930",
            "groups": [
                "serbian",
                "montenegrin"
            ],
            "id": "5423966_0133",
            "title": "Celebration of Vidov-Dan in Chicago",
            "topTitle": "Pravda"
        },
        "5423966_0135": {
            "codes": [
                "iiib4"
            ],
            "content": [
                "Last Sunday, February 7th, the great idea of a United Slavic Front became a reality on a small scale. For years and years this idea was propagated among the people of Slavic extraction with no visible success. This time a cornerstone was laid by a few energetic people in Chicago.",
                "As we said, last Sunday a meeting was held with representatives of all Slavic colonies present. After a long and heated discussion, it was decided to appeal to all our newspapers in America. A campaign was started to organize small units in every Slavic concentration. We sincerely believe that this campaign united all our people in a powerful central organization.",
                "This idea has such wide fields for expansion and such importance for the welfare of our people here and abroad that with all our hearts we strongly recommend future work on its realization."
            ],
            "dateFull": "1909-02-09",
            "dateText": "Feb. 9, 1909",
            "dateYear": "1909",
            "groups": [
                "serbian"
            ],
            "id": "5423966_0135",
            "title": "United Slavic League",
            "topTitle": "Balkan"
        },
        "5423966_0138": {
            "codes": [
                "iiic",
                "iiih"
            ],
            "content": [
                "Press news indicate that Bishop Gjorgjevic arrived in America to visit the Serbian bishopric which was given to his care. The question arises of whether or not the new bishop will grasp the situation with open eyes. More important is whether the new bishop will remain silent as his predecessor did when he sees everything.",
                "It is only natural that the new bishop will listen to the mercenaries of Belgrade, who will try to picture the Serbian diocese as a paradise and themselves as angels in it.",
                "Reports of that sort are made at Belgrade, but these reports were paid from the state's treasury. The aim of these reports was to show that the mercenaries who sent them are the chief factors in keeping the Serbian immigration patriotic and (preserving) faith in the Serbian government, and enthusiasm for the church and religion of their forefathers.",
                "In testimony of all this, they will show to the bishop articles of the Am. Srboran, the official organ of the Serbian National Union, and laudatory statements of its board members, with whom they are connected.",
                "To make matters more convincing they will accuse a few of the Serbian priests and make them responsible for anything that is unholy. These priests will be called traitors, devils, absconders from God and religion, from the people and from the national shrines. Such things the new bishop will hear. But he must get information from the other side, too; from people who have a good word for Belgrade, even if they are not paid for their opinion. Some of them claim that Belgrade contributed $100,000 for the Serbian bishopric and nobody knows what became of it.",
                "Belgrade invested heavily in the monastery at Libertyville. The bishop has to visit that monastery to come to the conclusion as to where the money went. There is a cemetery there. Close to it are huts for dancing and drinking.",
                "Never in that monastery has there lived one monk, and yet the place was announced by diplomats and mercenaries as a national shrine, a religious shrine, a new Jerusalem. Whoever does not believe in that is considered a traitor, a Judas and absconder.",
                "The new bishop will find out that the constitution of his diocese does not function. It exists just on paper. All wrongdoings are covered up by the newspaper Am. Srbobran, which is controlled by the priest Sundic and the Serbian diplomacy.",
                "The new bishop has the power to disentangle the common-law marriages of his priests, which are creating rebellion in the Serbian church in America. If the bishop will neglect to do it for whatever reason, this situation will continue.",
                "All above was said from best intentions.",
                "A Member of the Eparchy."
            ],
            "dateFull": "1937-05-07",
            "dateText": "May 7, 1937",
            "dateYear": "1937",
            "groups": [
                "serbian"
            ],
            "id": "5423966_0138",
            "title": "What Situation Will the New Serbian Bishop Find in America?",
            "topTitle": "Svijet (The World)"
        },
        "5423966_0141": {
            "codes": [
                "iiic"
            ],
            "content": [
                "The Eucharistic Congress of the Serbian Orthodox Church in America, which convened in the Serbian Monastery at Libertyville on July 4, attracted thousands of people of Serbian extraction from all parts of America--Colorado, Nebraska, Kansas, Minnesota, Indiana, Michigan, Illinois, and Pennsylvania.",
                "Serbia, and others saw in it a miniature of Yugo-Slavia.",
                "I say that it was at least something that we could call ours.",
                "Several prominent speakers delivered addresses on our national unity and on church activity. Among them were General Counsellor Kolombatovich and Mr. Pekich, secretary of Srbobzan.",
                "We have been informed that a very generous sum of money was collected for the needs of the monastery.",
                "Dushan Popovich."
            ],
            "dateFull": "1937-04-16",
            "dateText": "Apr. 16, 1937",
            "dateYear": "1937",
            "groups": [
                "serbian"
            ],
            "id": "5423966_0141",
            "title": "\"Eucharistic Congress of Serbian Orthodox Church,\"",
            "topTitle": "Scrapbook of D. Popovich"
        },
        "5423966_0142": {
            "codes": [
                "iiic",
                "ib3c",
                "iiig",
                "iiih",
                "ie"
            ],
            "content": [
                "The suffering immigrant should be pronounced a saint.",
                "Our immigrant cannot stand the cry of his poor relatives in the old country; he is carrying a heavy load in supporting his family, and yet he always finds something to contribute to our numerous organizations. It seems that everybody is eager to exploit his hospitality and his open heart.",
                "Our immigrant, despite all his hardships, still manages to be a real Christian and support his church. But too much is too much. Before the war we had three priests in America, and now, after the war, we have forty-three. Our church leaders in Belgrade watch carefully that our souls shall be saved, and they export more and more priests. They do not send us writers, professors, teachers, doctors,--in other words, the intellectuals of whom we are so sorely in need. They send only soul-savers, and we are supposed to thank them for this favor.",
                "Father Zika says, \"Watch your soul, for if you lose your soul, you lose everything.\"",
                "Socialists and communists say: \"Workers work six days a week and rest on the seventh day. Priests work only one day a week and rest six days. The rich do not work at all but rest on all seven days of the week.\"",
                "This is a free country. Let every man think and live in his own way."
            ],
            "dateFull": "1929-05-13",
            "dateText": "May 13, 1929",
            "dateYear": "1929",
            "groups": [
                "serbian"
            ],
            "id": "5423966_0142",
            "title": "\"Noble Souls,\"",
            "topTitle": "Scrapbook of D. Popovich"
        },
        "5423966_0146": {
            "codes": [
                "iiig",
                "iib1a",
                "iib2g",
                "ib3c",
                "ib3a"
            ],
            "content": [
                "A long time beforemany of us were born, our Serbian immigrants organized a colony in Chicago.",
                "Many of these immigrants have seen their sons and daughters married and their grandchildren born. The original immigrants are getting pretty old, and these grandchildren of theirs are growing fast. So our present world is built on the younger generation, and many of their elders have lived so long in Chicago that they may rightfully be considered old settlers.",
                "In some families, father, mother, sons, daughters, grandchildren, and even great-grandchildren were born in Chicago.",
                "This fact convinces us that our colony in Chicago is the oldest Serbian settlement in America.",
                "Serbians have centers in all three divisions of Chicago, on the North Side, the South Side, and the West Side. Many of our people have bought their own houses and have become property-owners. All this is admirable but there is another part of the picture which we do not like.",
                "Serbians in Chicago lack many things. They do not have schools, recreation halls, libraries, or a place where they may gather and relax.",
                "All our meetings, concerts, lectures, etc. are held on rented premises.",
                "Our people in Chicago have a 'builders' committee. This committee has been in existence, at least on paper, for many years. We have hopes that it will soon display some sign of life and so we will continue to be patient a little longer. If the committee continues to sleep, the younger generation will ask the older: \"Were you ever young?\""
            ],
            "dateFull": "1929-09-20",
            "dateText": "Sept. 20, 1929",
            "dateYear": "1929",
            "groups": [
                "serbian"
            ],
            "id": "5423966_0146",
            "title": "\"Serbians in Chicago,\" Scrapbook of D. Popovich",
            "topTitle": ""
        },
        "5423966_0148": {
            "codes": [
                "iiig",
                "iiic",
                "iiih",
                "iid10",
                "iiia",
                "ia2c",
                "id2c",
                "ig"
            ],
            "content": [
                "The life of our people in America is full of trouble. The immigrants' only refuge from grief is his songs, but he cannot be singing all the time. He has not yet decided what he wants to do, whether to return to the old country or to stay here. If he goes back,- not so good. If he stays here, - not so good either. Our people's eyes are always turned in the direction where the old country lies. That country was the immigrants birth-place, and it reared him. No power exists which can make him forget the old country. On the other hand this country, America, gives him his bread and butter and offers him an opportunity to become independent. So though his feet are on American soil, his heart and his soul are still over there.",
                "Most of our people are very generous. They have sacrificed much for the old country. They have lent a helping hand to their poor friends and relatives over there. They went back to serve as volunteers in the war and contributed money for war-time necessities. They donate large sums of money for everything that is Serbian.",
                "Our compatriots are known as hard workers and savers. They try their best to save something from their meager pay-checks and send part of it across the Atlantic to their old country banks where it is probably lost. Then some unscrupulous rascals come here and swindle them out of the rest of their savings. And now the depression has come, with lack of work and no more savings. All this has made the Serbian hard-boiled and selfish. Our people have contributed to causes of all sorts, to the church, to education, to benevolent enterprises, until they have nothing left. They have scattered money right and left by handfuls and by sackfuls. Our people have contributed huge sums for conventions and annual meetings and have received nothing in return. And right now we have another instance to report. Just a few days ago we received an invitation to be present at a church convention, where, as we heard, our church leaders intend to solicit from ten to twenty thousand for a new bell and building repairs. We should like to know who is responsible for this situation.",
                "Dushan Popovich."
            ],
            "dateFull": "1929-03-02",
            "dateText": "March 2, 1929",
            "dateYear": "1929",
            "groups": [
                "serbian"
            ],
            "id": "5423966_0148",
            "title": "\"The Immigrants' Troubles,\" Scrapbook of D. Popovich",
            "topTitle": ""
        },
        "5423966_0152": {
            "codes": [
                "iiih",
                "iiib2",
                "ig"
            ],
            "content": [
                "Immediately after the occupation of Bosnia and Herzegovina by Austria, the real Serbian patriots all over the world got into lively action to help their people in the above mentioned provinces to free themselves from the enemy's rule.",
                "Among the most active organizations working on this worthy cause was Srpsko Jedinstvo. During the time of the Balkan war this society sent twenty volunteers to the front, plus a sizable sum of money to support the movement.",
                "As soon as the World War was begun the society Srpsko Jedinstvo formed a group of 45 members (young and middle-aged), fully equipped and sent them to the front. All expense for equipment and transportation was paid by the society. The society Srpsko Jedinstvo has been known for its patriotic inclination, and there was no worthy cause registered which did not draw its hearty support, financially and morally, from the society."
            ],
            "dateFull": "1936",
            "dateText": "1936",
            "dateYear": "1936",
            "groups": [
                "serbian"
            ],
            "id": "5423966_0152",
            "title": "Srpsko Jedinstvo During the World War",
            "topTitle": "Memorial Book Srpsko Jedinstvo"
        },
        "5423966_0153": {
            "codes": [
                "iiih",
                "iiig",
                "id2c",
                "iia2",
                "ia3",
                "iiic"
            ],
            "content": [
                "I pray that God may grant me sufficient skill in writing to express to my people in the old country what we know here in America.",
                "Many people in my native land desire to immigrate to America. which they depict in their imagination as a land of great opportunity and a heaven on earth, just as I did before my arrival here.",
                "My idea in coming to America was to go underground, into the mines to dig gold, and after spending some time in this labor, to return to the land of my fathers.",
                "But I see now what a terrible mistake I made by not staying in the old country.",
                "Life and work are very hard underground without light and air. But still it would not be right to speak against this rich, beautiful and free country, which gives equal rights to poor and rich, strong and weak.",
                "But for us Serbians this land is cold, and our life here is miserable for many reasons.",
                "We immigrants must forget all that we have learned, and we must so to speak be born again and transport ourselves to another world.",
                "Because we do not know English, we must work hard to learn it; for English is harder than stone. No language in the whole world is more difficult. Americans speak like toothless old women, like cows chewing hay. Both ears must be kept wide open if you want to understand anything. Your mouth must be twisted, and your tongue squeezed in order to pronounce English words properly. If one is looking for a job and does not have a friend to help him, he may spend three whole years and travel a thousand miles without finding work, and God save him from utter destitution! When you are without work in America, you realize what mistake you made in leaving home. Suppose you get a job in a mine. Then you shall see how your health will be ruined, for mines are worse than prisons, and air has to be pumped into them by machinery. Rocks menace you with death, there is none of the sunshine that you love. Candles are forever burning; your eyes are blinded with smoke; poisonous gases fill your lungs. But even this is not the worst, for in summer the mines are filled with water.",
                "After working in a mine, you will be glad to be a shepherd, eating only one meal a day but breathing the clear, pure air above ground.",
                "In mines there is eternal night and darkness quickly kills your youth, depletes your energy, endangers your life, and destroys your ambition. We look like dead men, pale and weak.",
                "Besides working underground, we must cook and do mending and laundering, and there is no time left for the joys of living. So you may see that the life of a miner is worse than the life of a soldier.",
                "After so bitter an experience I no longer desire to gain gold but only to do something full of life and enjoyment. Let my work be in the sunshine, where there is plenty of pure air, even though the wages be small !",
                "May this account of my experience help you be wise!"
            ],
            "dateFull": "1907",
            "dateText": "1907",
            "dateYear": "1907",
            "groups": [
                "serbian"
            ],
            "id": "5423966_0153",
            "title": "Underground in America",
            "topTitle": ""
        }
    },
    "dates": [
        {
            "1937": [
                "5423405_1_0705",
                "5423966_0058",
                "5423966_0060",
                "5423966_0077",
                "5423966_0087",
                "5423966_0101",
                "5423966_0128",
                "5423966_0138",
                "5423966_0141"
            ],
            "1934": [
                "5423966_0037",
                "5423966_0049"
            ],
            "1929": [
                "5423966_0041",
                "5423966_0142",
                "5423966_0146",
                "5423966_0148"
            ],
            "1923": [
                "5423966_0043",
                "5423966_0056"
            ],
            "1922": [
                "5423966_0046"
            ],
            "1930": [
                "5423966_0053",
                "5423966_0133"
            ],
            "1936": [
                "5423966_0061",
                "5423966_0066",
                "5423966_0103",
                "5423966_0106",
                "5423966_0107",
                "5423966_0109",
                "5423966_0111",
                "5423966_0119",
                "5423966_0126",
                "5423966_0152"
            ],
            "0": [
                "5423966_0067",
                "5423966_0093"
            ],
            "1932": [
                "5423966_0070"
            ],
            "1931": [
                "5423966_0072",
                "5423966_0073",
                "5423966_0090",
                "5423966_0091",
                "5423966_0092"
            ],
            "1909": [
                "5423966_0075",
                "5423966_0135"
            ],
            "1933": [
                "5423966_0079",
                "5423966_0132"
            ],
            "1911": [
                "5423966_0083"
            ],
            "1910": [
                "5423966_0084",
                "5423966_0085"
            ],
            "1913": [
                "5423966_0094"
            ],
            "1912": [
                "5423966_0095",
                "5423966_0096",
                "5423966_0097",
                "5423966_0130"
            ],
            "1935": [
                "5423966_0121",
                "5423966_0122"
            ],
            "1907": [
                "5423966_0153"
            ]
        }
    ],
    "codes": [
        {
            "iid1": [
                "5423405_1_0705",
                "5423966_0096",
                "5423966_0101",
                "5423966_0103",
                "5423966_0106",
                "5423966_0107",
                "5423966_0109",
                "5423966_0111",
                "5423966_0119",
                "5423966_0121",
                "5423966_0122",
                "5423966_0130"
            ],
            "iib1a": [
                "5423966_0037",
                "5423966_0058",
                "5423966_0060",
                "5423966_0061",
                "5423966_0066",
                "5423966_0067",
                "5423966_0070",
                "5423966_0072",
                "5423966_0073",
                "5423966_0079",
                "5423966_0091",
                "5423966_0122",
                "5423966_0132",
                "5423966_0146"
            ],
            "iib1c": [
                "5423966_0037",
                "5423966_0075",
                "5423966_0077",
                "5423966_0079",
                "5423966_0122",
                "5423966_0132"
            ],
            "iib2e": [
                "5423966_0037",
                "5423966_0087"
            ],
            "ic": [
                "5423966_0037",
                "5423966_0043",
                "5423966_0053",
                "5423966_0094"
            ],
            "ia1a": [
                "5423966_0041",
                "5423966_0043"
            ],
            "iib2d": [
                "5423966_0041",
                "5423966_0083",
                "5423966_0084",
                "5423966_0085",
                "5423966_0107"
            ],
            "ia3": [
                "5423966_0046",
                "5423966_0077",
                "5423966_0153"
            ],
            "iiia": [
                "5423966_0046",
                "5423966_0148"
            ],
            "ib4": [
                "5423966_0049"
            ],
            "iiic": [
                "5423966_0049",
                "5423966_0128",
                "5423966_0138",
                "5423966_0141",
                "5423966_0142",
                "5423966_0148",
                "5423966_0153"
            ],
            "iiib2": [
                "5423966_0053",
                "5423966_0079",
                "5423966_0101",
                "5423966_0106",
                "5423966_0109",
                "5423966_0111",
                "5423966_0130",
                "5423966_0152"
            ],
            "if1": [
                "5423966_0056"
            ],
            "iv": [
                "5423966_0056",
                "5423966_0079"
            ],
            "iiie": [
                "5423966_0067",
                "5423966_0079",
                "5423966_0091",
                "5423966_0111"
            ],
            "iib3": [
                "5423966_0070",
                "5423966_0079",
                "5423966_0090",
                "5423966_0091",
                "5423966_0092",
                "5423966_0093",
                "5423966_0094",
                "5423966_0095",
                "5423966_0096",
                "5423966_0097"
            ],
            "iia3c": [
                "5423966_0079"
            ],
            "ie": [
                "5423966_0083",
                "5423966_0085",
                "5423966_0142"
            ],
            "iia3b": [
                "5423966_0087"
            ],
            "iib2g": [
                "5423966_0097",
                "5423966_0146"
            ],
            "iib2f": [
                "5423966_0111"
            ],
            "iid10": [
                "5423966_0121",
                "5423966_0128",
                "5423966_0148"
            ],
            "iid4": [
                "5423966_0126"
            ],
            "iiib3a": [
                "5423966_0132",
                "5423966_0133"
            ],
            "iiih": [
                "5423966_0132",
                "5423966_0138",
                "5423966_0142",
                "5423966_0148",
                "5423966_0152",
                "5423966_0153"
            ],
            "iiib4": [
                "5423966_0135"
            ],
            "ib3c": [
                "5423966_0142",
                "5423966_0146"
            ],
            "iiig": [
                "5423966_0142",
                "5423966_0146",
                "5423966_0148",
                "5423966_0153"
            ],
            "ib3a": [
                "5423966_0146"
            ],
            "ia2c": [
                "5423966_0148"
            ],
            "id2c": [
                "5423966_0148",
                "5423966_0153"
            ],
            "ig": [
                "5423966_0148",
                "5423966_0152"
            ],
            "iia2": [
                "5423966_0153"
            ]
        }
    ],
    "values": [
        "serbian"
    ]
}