{
    "items": {
        "5423967_2_0579": {
            "codes": [
                "if3"
            ],
            "content": [
                "Anton Cermak, president of the Cook County Board of Trustees, is one of the two candidates for mayor of Chicago in the coming election of April 7th.",
                "Anton Cermak is an old friend of the White Russians, whom he came to know during the last presidential campaign in 1928. At that time the White Russians supported the candidacies of Alfred Smith for President of the United States, and Anton Cermak for senator. Anton Cermak is of Czech origin, and came as a lad to the New World. He began his career as a miner, and today he holds one of the most outstanding positions among the politicians of Illinois, and particularly in our giant city, Chicago.",
                "At present a goodly half of the Chicago population of several million people is fighting to see him elected as mayor of this city. Particularly hot is the fight of the Slavic races, and of those Americans (Democrats as well as Republicans) who wish to bring about a change in the city's administration, who thirst for reforms, who are eager to exterminate abuse, to re-establish the good name of our city, etc.",
                "We do not doubt that, if elected, Anton Cermak will prove himself capable of being at the summit of his new post. His entire past activity speaks in his favor, and, with his election the White Russians will have the opportunity to come out in the open, struggling as they are in an effort to protect their interests from being trampled upon.",
                "The most outstanding representatives of the White Russian colony fervently support the slogan: Anton Cermak, the next Mayor of Chicago."
            ],
            "dateFull": "1931-03-30",
            "dateText": "March 30, 1931",
            "dateYear": "1931",
            "groups": [
                "russian",
                "whiterussian"
            ],
            "id": "5423967_2_0579",
            "title": "The Life of White Russians in America Anton Cermak and White Russia",
            "topTitle": "Belorusskaya Tribuna (White Russian Tribune)"
        },
        "5423967_2_0604": {
            "codes": [
                "if4"
            ],
            "content": [
                "About eight years ago the Polish Minister, L. Skulski, made a statement that in twenty-five years no trace will be left of the White Russian movement. The esteemed gentleman was wrong: What will be in seventeen years from now (eight years have passed already) we already now anticipate: Most likely no trace will be left by that time of Mr. Skulski.",
                "Again, six months ago a certain Chicago White Russian, a renegade, wrote that in six years the White Russian question will be forgotten in Chicago.",
                "The Skulski of Chicago was wrong. Already American political groups and together with them naturally also the American social groups, have taken an interest in the White Russian question.",
                "In connection with the Presidential campaign a White Russian-American National Club was organized, which stirred up a most lively interest in its behalf among Americans.",
                "This, considering the 'erudition' of the above mentioned pseudo-prophets, should not have occurred. But....can it be that American politicians are less informed about the population statistics of their country than our colony 'journalists'?",
                "Of course, the American politicians, in this instance the democrats, know well the meaning contained in our colony-term--Russian; they know the 99 percent of all the 'Russian' organizations in Chicago, and for that matter also in many other cities of the United States, belong to the White Russians, whether they are nationally conscious or not is another story, but the fact remains that they are White Russians. This nobody will dispute.",
                "For this reason the American democrats felt it was right to recognize the organized club of White Russian-American Nationalists which serves the interests of the National party.",
                "Again, for this reason the hopes of White Russian baiters had not been realized, in the numerous attempts to 'hide' the White Russian cause in America as harmful (indeed !) to all sorts of black-hundred appetites, those russifiers of all parts....",
                "Americans, of White Russian origin take a lively interest in the unfolding presidential campaign....",
                "...The official participation of White Russians in the presidential campaign of 1928, this new phase of interrelationship of White Russians with American political life, lifts the White Russian problem above the colony's work-aday ribaldry...",
                "Signed V. Polesski."
            ],
            "dateFull": "1928-10-20",
            "dateText": "October 20, 1928",
            "dateYear": "1928",
            "groups": [
                "russian",
                "whiterussian"
            ],
            "id": "5423967_2_0604",
            "title": "Belorusskaya Tribuna (White Russian Tribune)",
            "topTitle": ""
        },
        "5423967_2_0611": {
            "codes": [
                "if5",
                "ic"
            ],
            "content": [
                "In the West Side quarters of the Republican Party in Chicago there has been formed a Russian Executive Organization, supporting the candidacy of Herbert Hoover for United States President.",
                "Among the eight persons who were declared leaders of the organization are two White Russians: Archimandrite Timon (Mulyar) and Vladimir Sabinsky, the one time chairman of the Russian National Orthodox Society in Chicago.",
                "Of course, there is no White Russian cause for this organization, despite the fact that it operates chiefly amongst Americans who migrated from White Russia."
            ],
            "dateFull": "1928-10-20",
            "dateText": "Oct. 20, 1928",
            "dateYear": "1928",
            "groups": [
                "russian",
                "whiterussian"
            ],
            "id": "5423967_2_0611",
            "title": "White Russian Republicans",
            "topTitle": "Belorusskaya Tribuna (White Russian Tribune)"
        },
        "5423967_2_1401": {
            "codes": [
                "iib1c",
                "iiib2",
                "iiih"
            ],
            "content": [
                "\"The Chicago 1933 Century of Progress cannot take place without the White Russians.\" The last decade gave this, hitherto 'unknown', people the opportunity to inscribe its name in the largest world centers. Agricultural, ethnographical, esthetical, literary, and other exhibits in Moscow, Paris, Prague, Riga, Cologne, Leipsic, Konigsberg--contained among their exhibitors also the White Russians: Be that the handiwork of White Russian peasant-women, or the rich gifts of White Russian soil, or the creations of etchers and painters from among the White Russian masses, or a copy of the White Russian Testament, Old or New,--dating more than 400 years back,--to say nothing of the White Russian histrionic art, the White Russian theatre, the White Russian song. It is known, for instance, that recently, at the all-Russian competitive congress of numerous national choirs in Moscow, the White Russian Kapella received the first prize.",
                "So it was in Europe. But now is the time for the White Russian people to register its existence among other regenerated peoples and in America. The approaching Century of Progress Exposition in Chicago shall serve as a start for this objective.",
                "All the nations of the world will face one another in this noisy, motley, boundless Fair. All nationalities will appear here, in the fairy-like capacious Grant Park, on the shores of azure-blue Michigan. And here shall also appear the White Russians in 1933.",
                "Fortunately the foundation for it is prepared in America; the White Russian national consciousness in the several localities, in the colony, is after all increasing in greater or lesser degrees. It remains only for the American White Russians to demonstrate their wish, to assist their old native home to be represented at this world-wide Fair. And it were best if our native homeland did not fall before Indian palaces, German castles, American skyscrapers, French towers...It were best that White Russia showed to the world something, even if ever so little, from some village near Minsk or Grodno: a modest frame hut, its roof of aged straw as green as a park, its chimney crooked; and inside the hut everything should be from there; tables, benches, ovens, behind-ovens, wooden beds, a grindstone, enormous trunks, wooden dishes, earthenware receptacles, towels embroidered by skillful hands from Slutsk, girdles and belts, rugs and table cloths of one's own make, dough-mixers, spades, tripods, oven-rakes, cleavers, and a great many other home implements.",
                "Some of these house utensils could even be made here, yet the greater part of it would have to be imported from Minsk, Slutsk, Vilno, Grodno, and Pruzhani.",
                "In the hut should be a typical White Russian family who would explain to hundreds, thousands and millions of visitors, during the Fair, what the White Russians are, what they want, what they produce, and how their neighbors treat them.",
                "By the hut a thrashing-place and a granary may be put up, and even a small modern kiosk in White Russian style could be built to demonstrate White Russian farming (why does not the Chicago market show our lumber, flax, stumps, our leather and wool?:) White Russian culture and handicraft, the richness of our soil, the wealth of the bowels of our earth, etc., but chiefly our achievements in the past twenty five years. This exposition is coincident with the twenty fifth anniversary of the latest White Russian movement.",
                "Of course, in order to realize even this modest plan, means are needed, and not small means, but...in the first place it is yet five years to the Century of Progress; secondly, if the White Russians of all categories and emigration points will start intensive work for this objective, and if all the best forces of the White Russian people will be drawn to this work, then White Russians will be represented by a White Russian Department at this Exposition.",
                "One need not expatiate on the usefulness and significance of such a White Russian demonstration. Not one argument against White Russia's participation in this World Exhibit can hold out.",
                "The Chicago White Russian National Union took upon itself the responsibility of raising this important question. Accordingly an appeal is being issued to all White Russians on this question. Comprehensive information is also given to the Century of Progress Committee where good neighbors are already saying things in behalf of White Russians.",
                "Yet the White Russian National Union does not claim the part of sponsor in this matter. It is important that this idea should be realized, and that White Russians should already tackle the need for an organ, with whose help the White Russians will appear not at the tail of the dazzling array of Eastern European nations before the world of culture. White Russians must be independently represented at this universal exposition."
            ],
            "dateFull": "1928-10-20",
            "dateText": "Oct. 20, 1928",
            "dateYear": "1928",
            "groups": [
                "russian",
                "whiterussian"
            ],
            "id": "5423967_2_1401",
            "title": "(Article by Joseph Voronko)",
            "topTitle": "Belorusskaya Tribuna (White Russian Tribune)"
        },
        "5423967_2_1481": {
            "codes": [
                "iib2a"
            ],
            "content": [
                "The White Russian National Union in Chicago received from the Smithsonian Institute, Washington, D. C., a large consignment of White Russian Belles-Lettres from Minsk. Among the editions are the works of famous White Russian writers and poets. It is a pity that the senders failed to give to the White Russian National Union the latest White Russian literature, also those \"thick\" journals and books on science in the White Russian tongue, all of which one cannot get in Chicago. The Chicago libraries do not have a single White Russian book."
            ],
            "dateFull": "1928-10-20",
            "dateText": "Oct. 20, 1928",
            "dateYear": "1928",
            "groups": [
                "russian",
                "whiterussian"
            ],
            "id": "5423967_2_1481",
            "title": "Books from Washington",
            "topTitle": "Belorusskaya Tribuna (White Russian Tribune)"
        },
        "5423967_2_1692": {
            "codes": [
                "iib2d"
            ],
            "content": [
                "The following are excerpts from newspapers abroad commenting on Belorusskaya Tribuna in Chicago:",
                "Belorusskaya Sprava (White Russian Recorder) of Vilna points out that inasmuch as the object of this publication is to bring back to their own language and culture those White Russians in America who fight shy of it, why then is this paper in the Russian language and not in the White Russian? The writer A. further states that while White Russians may regard themselves as of the Russian culture, many are Catholics and they register as Poles; they do not read Russian;.... \"still something should be done also for them.\" The writer criticizes the paper for the apparent complete disregard of the fact that there is a White Russian Socialist Soviet Republic in the USSR formation; that instead, the paper plays up the independence ideal, and independence - being among the things wishful but nothing more, - will not impress the realistic American.",
                "Golos Belarussa (The Voice of a White Russian), Riga, merely records the existence of the paper and remarks that it is published in Russian for two reasons: (a) A great number of White Russians are Russified and they consider the Russian culture as their own, (b) the paper wishes to reach also other nationalities (Slavic). It is further said that Belorusskaya Tribuna has a White Russian literary section; that the paper has eight pages and contains much interesting material.",
                "Still another paper, Syalyanskaya Niva (Country Pastures) of Vilna, heartily greets the birth of this paper and commends the Tribuna's platform for an independent White Russian state free to work out its own destiny, unshackled by dictums from Moscow or White Russian skinners (the same as kulaks). The writer quotes extensively from an article by the editor of Belorusskaya Tribuna. The title of the article is \"Zaraspyatuya\" (For Her Who is Crucified), its gist being that it is entirely safe to let Belorusskaya (White Russia) work out her destiny; that being a peasant population largely \"all the other classes in White Russia taken together would still leave the peasantry in the majority....,\" she could not but persist on a policy for industrial as well as political democracy. The writer also remembers that the editor of Belorusskaya Tribuna, Joseph Voronko, was \"the first chairman of White Russia's National Republic Government.\""
            ],
            "dateFull": "1928-10-20",
            "dateText": "Oct. 20, 1928",
            "dateYear": "1928",
            "groups": [
                "russian",
                "whiterussian"
            ],
            "id": "5423967_2_1692",
            "title": "The Press on Belorusskaya Tribuna",
            "topTitle": "Belorusskaya Tribuna (White Russian Tribune)"
        },
        "5423967_4_0892": {
            "codes": [
                "iiib2"
            ],
            "content": [
                "1. With the development of the White-Russian people in the New World goes the national and economic rebirth of the White-Russian Nation.",
                "2. The protection of the interests of the White-Russian Nation according to the first paragraph.",
                "3. The cultural-educational work, establishment of schools, lectures, exhibitions, libraries, etc.",
                "4. Help for the fatherland in all branches of political, commercial and social life.",
                "The Committee of W-R. N. C."
            ],
            "dateFull": "1916-02-02",
            "dateText": "Date Unknown",
            "dateYear": 0,
            "groups": [
                "russian",
                "whiterussian"
            ],
            "id": "5423967_4_0892",
            "title": "Purposes of W.-R. N. C.",
            "topTitle": "Miscellaneous Material Owned by: Dr. H. R. Krasnow"
        },
        "5423967_4_1553": {
            "codes": [
                "iiih"
            ],
            "content": [
                "(In English)",
                "The White Russians belong to the family of Slavic nations and occupy a territory of about 350,000 sq. km., in the upper part of the Dnieper, the Dvina and the upper and central parts of Niemen. Everywhere on this territory the White Russians live in compact masses and constitute an unquestioned majority of the population.",
                "The World War which brought about the emancipation, freedom and independence to many European nations, terminated for the White Russians in a partition of their national territory among three states, Soviet Russia, Poland and Latvia. There are at present about eight million White Russians in Soviet Russia on a territory of about 250,000 sq. km., over two million in Poland on a territory of about 100,000 sq. km., and about 200,000 souls in Latvia on a small territory. In addition to this there are about one million White Russians in Siberia and over one half million immigrants in the United States. Therefore there are twelve million of White Russians in the world.",
                "Regarding religious affiliations, four-fifths of the White Russians are Greek Orthodox and one-fifth are Roman-Cathclic.",
                "The civilized world does not know much about the regeneration of White Russian people, because before the World War, under the influence of Russia, they were classified as Russians. The 19th century witnessed the national awakening of the White Russian people. Notwithstanding the great oppression on the part of the Russian Government, and in spite of the strong religious influence of Poland, the White Russians laid down the foundation for their national emancipation. At that time the first White Russian organizations were formed, White Russian books were published, and after the outbreak of the Russian Revolution of 1905, the first White Russian newspapers were edited. At that time also the activity of White Russians began to be felt in the political field.",
                "White Russians joined in the general demand for the reconstruction of the Russian Empire on the basis of territorial autonomy. The aspiration of oppressed nations within Russia was to transform the Russian Empire into a federation in which white Russia was to be an independent unit. However, the return of the reaction in the following years held back the development of the White Russian movements and aspirations. It held it back but did not annihilate it.",
                "For, when as a result of the Russian Revolution in 1917 the Czarat fell and with its fall fell the chains of slavery of the Russian State. The White Russian movement of regeneration went quickly forward. The first general White Russian Congress called at Minsk in March 1917 was not satisfied with the former White Russian demand for White Russian autonomy within the Russian federation, but it went a step further and created the White Russian General Committee which exercised governmental functions on the entire White Russian territory. Other White Russian political organizations, such as the Central Council of the White Russian organization, the Military White Russian Council, the Great White Russian Council and others were grouped around the said Committee. Since then the work of organizing and preparing the White Russian people for a complete political independence of White Russia was conducted with great enthusiasm and energy.",
                "As a result of this work, an all-White Russian Congress was held at Minsk from the 18th to the 31st of December, 1917. This Congress was attended by the representatives of the entire White Russian territory, numbering 2,000 persons, including among then representatives of the western portion of White Russia which at that time was under the German military occupation.",
                "The Congress did not conclude its work because the Russian Bolsheviks, who came into power, occupied the eastern parts of White Russia including the city of Minsk and dispersed the Congress. A new period of constant struggles began. However, when the German troops evacuated the western portion of White Russia, the Council of the White Russian People's Republic proclaimed complete independence of the White Russian state.",
                "This political step was of immense consequence to the White Russian nation because the call of independence since then became the leading thought of the whole White Russian political movement. However, not-withstanding the popular feeling and aspirations regarding the independence of White Russia, on termination of the World War and evacuation of the Eastern Front by the German army, White Russians again fell into a whirlpool of struggles with its western and eastern neighbors, and finally the eastern part of its territory was incorporated into Soviet Russia and the western portion into Poland. The peace treaty between Poland and Soviet Russia concluded at Riga in 1921 confirmed this state of affairs.",
                "Already at the first occupation of the White Russian territory in 1918 by Russian Bolsheviks, the latter reckoning with the strivings and aspirations of the White Russian nation at the conference of the Russian Communist Party at Smolensk on December 28, 1918, recognized in their own interest to promulgate the White Russian Soviet Republic. The Bolsheviks at that time clearly stated that they did it with a view of making use of the White Russian movement for independence so as to facilitate the conversion of the White Russian people to the Bolshevik cause and to secure to themselves a degree of influence for the White Russian masses. There is no doubt that these considerations are decisive also today in the Bolshevist policy towards the White Russians.",
                "After the Bolsheviks came into power in the eastern White Russian territory and upon conclusion of the peace treaty at Riga, the White Russian Socialist Soviet Republic as established by the Bolsheviks with its seat of government at Minsk comprised only 110,000 square km., with 4 1/2 million inhabitants. The remaining territory with five million people was attached to the Russian Soviet Republic, and this constitutes an undeniable proof that the Bolsheviks do not intend to satisfy the aspirations of the white Russians, but make small concessions to them in order to wield their influence for their own purpose. Notwithstanding these facts the white Russian national movement increases steadily in the Soviet White Russia. The cultural work although necessarily proceeds (sic) along the Bolshevik lines, has made great progress. Primary, secondary and higher schools are chiefly white Russian. Science and art are developing.",
                "As already mentioned, the western portion of the white Russian territory is within the boundaries of the Polish state ever since the Riga Peace Treaty was signed. According to the official Polish statistics of September 31, 1921, there were in Poland 1,172,955 White Russians. However, undoubtedly many white Russians of Roman-Catholic faith were registered as Poles, Polish constitution and a series of laws passed in pursuance thereto, as well as the treaty on national minorities signed by Poland at Versailles were supposed to be the guarantees for free and unobstructed development of White Russians in political, cultural and economical fields. These laws and international guarantees were in reality scraps of paper. Not one of these laws came into force as far as White Russians were concerned. Thus in the most important domain, that of education, the discrimination against White Russians is the most striking. In the entire Polish state there is not one White Russian school of governmental status, five mixed Polish-White Russian schools are not being taken into consideration. The widespread demand of White Russians for the establishment of the White Russian schools remain unanswered. The taxes collected from White Russians help the establishment and maintenance of purely Polish schools which constitute the means of Polonization of White Russian. Invariably no permission for the establishment of private White Russian schools is granted. And if exceptions are made, then again it is impossible to obtain the conformation of the teachers. In the primary schools in the White Russian territory the teachers are Polos imported from Poland, whereas White Russian teachers remain without employment and without means for for earning a livelihood in their profession.",
                "Parish and district community organizations exist only on paper in White Russian territory. Everywhere mayors are appointed by Polish authorities and they make use of their subordinate administrative and police organs for the benefit of their masters. Not even the heads of parishes are elected by the population but are appointed by the mayors. Parish councils face dissolution if they act independently. Parish and district councils have to abide strictly by the orders of mayors. If any of them dare to act independently in a way that does not please the authorities, they are persecuted and often arrested.",
                "All the political administration is in the hands of Polish officials, brought chiefly from purely Polish provinces: Congress Poland and Western Galicia.",
                "White Russians are not permitted to take part in the administration. Imported officials not acquainted with local conditions and requirements of the population, treat the White Russians badly and the higher authorities tolerate this.",
                "The economic policy of Poland does injustice to White Russians and constitutes a means of their exploitation. Even in pre-war times, the condition in the White Russian territory which is now incorporated in Poland were very abnormal. Although this territory is very large it includes comparatively very little arable land, for most of it are forests and marshes. Owing to this concentration of population in arable parts of the territory, the density of population compares with that in the ethnographical Polish territories. This condition is made worse by complete lack of industry so that on small plots of arable land the agricultural population is crowded and this situation reduces the farmers to the poor agricultural proletariat crying to make out a living from their dwarfish farms. To make things worse, at least one half of the arable land belongs to the large land proprietors, who are chiefly Poles. The population in effect is no more than servants of these large estates. Even during the Polish (sic) rule the lack of land was severely felt in the western part of White Russia. This caused large emigration of White Russians to the United States and Siberia. At present under the Polish rule the situation has become almost tragical. The war and its resultant devastation, and later inflation led White Russians to a state of extreme poverty. Up to the present time 50c of the devastated farms were not rebuilt. A large part of the population is still living in hovels. It would seem that the highly advertised agrarian reforms would improve matters at least partially and would ameliorate the terrible agricultural and social conditions in Western White Russia.",
                "These hopes were not realized. Although these agrarian reforms were carried through, the land taken away from large land proprietors were given exclusively to Polish civil and military colonists brought from the west. Owing to this the situation is much worse today than it was before the war. Said agrarian reforms and consequent colonization brought about the unemployment of the farm laborers who prior thereto found employment on large estates. As a result the army of small land owners and farm laborers was augmented by hungry agricultural proletarians, which increased internal fermentation in that part of the country. The situation seems hopeless because Polish authorities turn a deaf ear to all warnings and complaints on the part of representatives of the White Russian people, and they seem not to see what happens or takes place in the present White Russian territories. They evidently are of the opinion that mechanical repressions and thoughtless suppressions of every symptom of White Russian national life will serve the purpose and will take the place of the needed fundamental and radical reforms without which there never will be any peace and normal life on White Russian territories.",
                "The White Russian population neither expects nor counts on any miracles, but desires to continue its struggle for a better tomorrow. To this end it does not shirk the work, taking examples from other nations which clearly teach that there is no power in the world which would push back into the darkness of slavery a nation which has started a new life.",
                "The above is the speech delivered by the White Russian Deputy, Fabian Yeremicz, in the Polish parliament as reported in Natio No. 12, January-February, 1927, a magazine printed in Warsaw, Poland, in the interests of minorities in Poland.",
                "(Ed. Note: This article reflects the attitude of the White Russian nationalists of Chicago)."
            ],
            "dateFull": "1928-10-20",
            "dateText": "Oct. 20, 1928",
            "dateYear": "1928",
            "groups": [
                "russian",
                "whiterussian"
            ],
            "id": "5423967_4_1553",
            "title": "By Fabian Yeremicz, Deputy to the Diet.",
            "topTitle": "Belorusskaya Tribuna (White Russian Tribune)"
        }
    },
    "dates": [
        {
            "1931": [
                "5423967_2_0579"
            ],
            "1928": [
                "5423967_2_0604",
                "5423967_2_0611",
                "5423967_2_1401",
                "5423967_2_1481",
                "5423967_2_1692",
                "5423967_4_1553"
            ],
            "0": [
                "5423967_4_0892"
            ]
        }
    ],
    "codes": [
        {
            "if3": [
                "5423967_2_0579"
            ],
            "if4": [
                "5423967_2_0604"
            ],
            "if5": [
                "5423967_2_0611"
            ],
            "ic": [
                "5423967_2_0611"
            ],
            "iib1c": [
                "5423967_2_1401"
            ],
            "iiib2": [
                "5423967_2_1401",
                "5423967_4_0892"
            ],
            "iiih": [
                "5423967_2_1401",
                "5423967_4_1553"
            ],
            "iib2a": [
                "5423967_2_1481"
            ],
            "iib2d": [
                "5423967_2_1692"
            ]
        }
    ],
    "values": [
        "whiterussian"
    ]
}