{
    "items": {
        "03512_0000": {
            "codes": [
                "ib4"
            ],
            "content": [
                "P. 51- “Miners, farmers, skilled and unskilled workmen can discuss with considerable ability such questions as the nature of the soul, the origin of evil, the identity of the human body at the resurrection…”"
            ],
            "dateFull": "1899",
            "dateText": "1899",
            "dateYear": "1899",
            "groups": [
                "welsh"
            ],
            "id": "03512_0000",
            "title": "[Welsh Are Deeply Religious]",
            "topTitle": "The Cambro-American Pulpit"
        },
        "03512_0001": {
            "codes": [
                "ic",
                "iiia"
            ],
            "content": [
                "P. 56- The Welsh “dislike theatres, sports and races…They are impulsive…and have a tendency to be obstinate and are far more gifted with the perception of differences between themselves and others, than with the recognition of similarities and agreements; envious and vindictive; more religious than moral.”"
            ],
            "dateFull": "1899",
            "dateText": "1899",
            "dateYear": "1899",
            "groups": [
                "welsh"
            ],
            "id": "03512_0001",
            "title": "[Welsh Characteristics]",
            "topTitle": "The Cambro-American Pulpit"
        },
        "03512_0002": {
            "codes": [
                "iia3b",
                "vb",
                "ib4"
            ],
            "content": [
                "P. 2- “Wales has produced some of the chief soloists, chorus singers and preachers of the ages. She has not produced either a scientist or a historian.”",
                "P. 7- “There is more religion per square foot in Wales than in any other country under the sun.”"
            ],
            "dateFull": "1899",
            "dateText": "1899",
            "dateYear": "1899",
            "groups": [
                "welsh"
            ],
            "id": "03512_0002",
            "title": "[Welsh Among World’s Greatest Singers]",
            "topTitle": "The Cambro-American Pulpit"
        },
        "03512_0003": {
            "codes": [
                "iib1a",
                "iib2d",
                "iv"
            ],
            "content": [
                "P. 297- Born Swansea, Wales, 1826. Came to Cook County in 1839, and to Chicago in 1843. Became large owner of Chicago and Hyde Park Real Estate.",
                "Was Director and Treasurer of the Cambro Printing Company, which published in Welsh and English a newspaper called “Columbia,” the largest of its kind in the world.",
                "At the World’s Columbian Exposition the International Eisteddfod gave $12,500 in prizes, etc.",
                "Member: Congregational Church. Republican. Cymrodorion."
            ],
            "dateFull": "1899",
            "dateText": "1899",
            "dateYear": "1899",
            "groups": [
                "welsh"
            ],
            "id": "03512_0003",
            "title": "[RECORD OF THOMAS EDWARD LEWIS]",
            "topTitle": "Album of Genealogy and Biography, Cook County, Illinois"
        },
        "03512_0004": {
            "codes": [
                "iib1a",
                "iiic"
            ],
            "content": [
                "Religious music is found in many forms. For instance, the great oratorio writers, Handel, Hayden, Beethoven, Mendelssohn, Parry and others, interest the upper class of people, that have had a degree of musical education that is above the average. I believe the best music for the consecrated Christian is the gospel tune that has life and is more simple, and which carries with it the message of the cross.",
                "Music and life are very closely related. Music has an influence that cannot be expressed in words. Spiritual music and worship go together. Music that has been composed and arranged by some consecrated person is wonderfully effective and gives the sweetest experience. My idea in writing this, is to encourage our young people to give more attention to religious music, because it will be most important in dispelling the darkness when it comes.",
                "The protestant church has been falling down on this very important feature, but with indications here and there we see that it has not entirely disappeared from Israel. For this reason, the redeemed of the Lord will come from far with Zion’s Hymns. When our churches and church organizations will appreciate Zion’s music, they will see the beautiful Zion is not so now, but once in a while a flash of the beautiful, even in this day, is heard and felt through the influence of music that has been composed and sung by consecrated people, and its influence stretches farther than we can imagine. These are the reasons for what I have said.",
                "In Sasiwn, Caernarvon, 1884, I will never forget the Rev. Owen Thomas encouraging congregational singing, and he inferred that some day it may take the place of preaching, - they had sung these words.",
                "The Hill of Calvary will never leave my memory, and the above story is only one of the many to prove the influence of consecrated music on the nations of the world. The worshipful congregational singing is so important that I would like to write more about it, hoping to influence our American young people."
            ],
            "dateFull": "1894-08-16",
            "dateText": "August 16, 1894",
            "dateYear": "1894",
            "groups": [
                "welsh"
            ],
            "id": "03512_0004",
            "title": "Religious Music and Its Influence",
            "topTitle": "Yr Ymdrechdydd"
        },
        "03512_0006": {
            "codes": [
                "iib1a",
                "iib1d",
                "iiih"
            ],
            "content": [
                "W. E. Powell is actively interested in the success of the International Cymrodorion Association, the Welsh society which proposes giving a musical and literary festival in this city the last week of August, 1893. Speaking of the current rumors that there is discord among the Welshmen in relation to the formation of the international festival, Mr. Powell said yesterday: “We have been successful thus far in securing the cooperation of the best musical and literary talent among our people. We have distributed over 10,000 pamphlets throughout Great Britain within the last month, to which the most encouraging replies have been received. The National Association now in session at Swansea, Wales, has officially recognized our efforts and will send a deputation of the Gorsedd here at the time agreed upon. There are something over 2,500,000 Welshmen in this country, nine-tenths of whom will indirectly, at least, contribute to the success of the distinctively characteristic festival. There is no discord and there will be none beyond the discord which may arise from a friendly difference of opinion as to the best methods to be adopted. True there might be and doubtless there are some personal jealousies, but those jealousies will not and can not materially abridge the scope and success of the great enterprise.",
                "Every Welsh society of the United States will actively cooperate in the festival."
            ],
            "dateFull": "1891-08-26",
            "dateText": "Aug. 26, 1891",
            "dateYear": "1891",
            "groups": [
                "welsh"
            ],
            "id": "03512_0006",
            "title": "Welshmen Acting in Harmony",
            "topTitle": "Chicago Tribune"
        },
        "03512_0008": {
            "codes": [
                "iib1c",
                "iib1a",
                "iib2d",
                "iib1e",
                "iiih"
            ],
            "content": [
                "P. 5 – The first even of the afternoon was the contest for the prize offered for the best handbook in Welsh or English of short biographical sketches of Welsh poets with criticisms upon their poems. The prize was not bestowed, but Erasmus W. Jones was mentioned as the most worthy competitor, and Conductor Edwards spoke in commendation of his work.",
                "The soprano singers, six in number, came on next, which was won by little Miss May Jones declared the winner by John Thomas.",
                "In the adjudication on the operatic libretto only one libretto was submitted, but on account of its manifest excellence the prize was awarded to its author, who contested over the nom de plume “Sir Harri Ddu”; but even this did not prejudice him in the minds of the adjudicators, and the author who turned out to be R. D. Williams, received the prize which was hung around his neck by Mrs. Ben Davis.",
                "William Morgan of Caerphili, Wales won the Harp solo contest. The audience of the afternoon was not only the largest of the Eisteddfod season, but it was by far the biggest that Festival Hall has ever been called on to accommodate."
            ],
            "dateFull": "1893-09-09",
            "dateText": "Sept. 9, 1893",
            "dateYear": "1893",
            "groups": [
                "welsh"
            ],
            "id": "03512_0008",
            "title": "Fourth Eisteddfod",
            "topTitle": "Chicago Times"
        },
        "03512_0010": {
            "codes": [
                "iib1c",
                "iib1a"
            ],
            "content": [
                "p. 2- The Rev. W. C. Roberts presented the report of the adjudicators on the last contest of the day before, and announced that the Rev. Ebenezer Edwards of Winersville, Pa., who contested under the nom de plume of William Penn, was the winner.",
                "Then the baritone soloists sang against each other for all they were worth.",
                "Joseph P. Burns of Wilkesbarre, Pa. was declared the champion baritone."
            ],
            "dateFull": "1893-09-08",
            "dateText": "Sept. 8, 1893",
            "dateYear": "1893",
            "groups": [
                "welsh"
            ],
            "id": "03512_0010",
            "title": "Third Eisteddfod",
            "topTitle": "Chicago Times"
        },
        "03512_0011": {
            "codes": [
                "iib1c",
                "iib1a",
                "iiih"
            ],
            "content": [
                "p. 2- The choral competition with which the Esiteddfod concert opened last evening engaged the attention of a large audience. For this contest, which was for women’s voices, choirs of fifty voices each were entered, the Cecilians of Wilkesbarre, Pa., directed by Mrs. Annie Thomas, and the Welsh Ladies’ Chorus from Cardiff, Wales directed by Mrs. Clara Novello Davis. The test pieces selected were Sohubert’s “The Lord Is My Shepherd” and “The Spanish Gypsy Girl” (Lassen) arranged by Walter Damrosch. Excellent opportunity was given for display in the strongest contrast afforded. The Cecilians appeared to better advantage in their first number, but both were sung by them with sweet, fresh voices, and with precision and careful shading.",
                "The singing of the Gypsy song by the Cardiff choir was a piece of work as nearly perfect in precision and delicate beauty of shading as could well be desired. At its close the first prize was awarded them by the adjudicators, the Wilkesbarre choir receiving the second prize."
            ],
            "dateFull": "1893-09-08",
            "dateText": "Sept. 8, 1893",
            "dateYear": "1893",
            "groups": [
                "welsh"
            ],
            "id": "03512_0011",
            "title": "Interest in Choral Competition",
            "topTitle": "Chicago Tribune"
        },
        "03512_0012": {
            "codes": [
                "iib1c",
                "iib1a",
                "iiih"
            ],
            "content": [
                "p. 5- The ceremonies of the Welsh in their second Eisteddfod Day at Festival Hall were only fiarly well attended yesterday.",
                "A Tenor Solo Competition",
                "Then came a most interesting contest-a tenor solo competition. “Oh, Delyn Fy Ngwald” (Oh, Harp of My Land) was the song selected. The prize of $20 was given to Richard Williams of Kengston, Pa.",
                "The poem “Christopher Columbus” written by “Faith” (G. W. Leader of Old Litchfield Terrace, London, N.W.) was announced to be the best in that contest and was spoken of by the judges as a work of rare poetic merit. The prize, $150 and a silver eagle, was given to Wm. F. Maddock, representative of the author.",
                "The award for the best effort in a novel in English, representing the Welsh mode of thought and feeling as reflected in the customs and manners of that country, was given to the Rev. Thomas Griffith of South Wales, and John Roland of Swansea."
            ],
            "dateFull": "1893-09-07",
            "dateText": "Sept. 7, 1893",
            "dateYear": "1893",
            "groups": [
                "welsh"
            ],
            "id": "03512_0012",
            "title": "Second Eisteddfod",
            "topTitle": "Chicago Times"
        },
        "03512_0013": {
            "codes": [
                "iib1c",
                "iib1a"
            ],
            "content": [
                "p. 1- About 2,500 persons were assembled yesterday at the Festival Hall and were Welshmen direct from North Wales, South Wales and all parts of the United States attended.",
                "Then came duet competitions for a prize of $20.00 and a badge of honor offered by the Seattle Cymrodorion. It was to be a duet of bass and tenor, and the selection was the Welsh song “Where the Caveri Ripples”.",
                "The judges William Courtney, John Thomas and Dr. J. M. Gower, awarded first prize to J. T. Watkins and D. Stevens of Scranton, Pa.",
                "The warmest interest centered around the contralto solo competition. For a prize a medal was given. The selection was Gluck’s “Life Without My Eurydice”. The first prize was awarded to Miss Evans.",
                "Everyone waited for the great event of the afternoon, the choral competition for male voices, each choir to number not less than fifty nor more than sixty voices. The first prize is to be $1,000.00, the second $500.00, with gold medals to successful conductors. The results will not be announced until Friday evening."
            ],
            "dateFull": "1893-09-06",
            "dateText": "Sept. 6, 1893",
            "dateYear": "1893",
            "groups": [
                "welsh"
            ],
            "id": "03512_0013",
            "title": "First Eisteddfod",
            "topTitle": "Chicago Record"
        },
        "03512_0015": {
            "codes": [
                "iib1c",
                "iib1a"
            ],
            "content": [
                "p. 5 – Today at eleven o’clock begins the International Welsh Eisteddfod, which promises to be one of the biggest musical festivals of the Fair. The Eisteddfod lasts three days and fifteen splendidly trained choruses will participate. All these choruses, four of them coming from across the sea, will contest for big cash prizes. Today the festivities begin with the Bardic Gorsedd. At twelve o’clock all the celebrants will move to Festival Hall, where the competitions will begin. There are cash prizes and medals for chorus and harp competitions aggregating over $12,000.00 On the first day there will be a chorus prize of $1,000.00, with $500.00 for second money; but the big contest comes Friday afternoon, when four choruses of 250 voices each will contest for a  prize of $5,000.00."
            ],
            "dateFull": "1893-09-05",
            "dateText": "Sept. 5, 1893",
            "dateYear": "1893",
            "groups": [
                "welsh"
            ],
            "id": "03512_0015",
            "title": "Beginning of Welsh Festivities",
            "topTitle": "Chicago Times"
        },
        "03512_0016": {
            "codes": [
                "iib1c",
                "iv"
            ],
            "content": [
                "A delegation of Welshmen, including Messrs Powell, Smith, Ap Maddoc and Job, called on the director-general yesterday. They desire that one week during the fair shall be set apart for their nationality, when national games will be played, national bands be present and they will offer prizes to the amount of $30,000 which will then be competed for."
            ],
            "dateFull": "1891-05-19",
            "dateText": "May 19, 1891",
            "dateYear": "1891",
            "groups": [
                "welsh"
            ],
            "id": "03512_0016",
            "title": "Welsh Want Representation at World’s Fair",
            "topTitle": "The Chicago Daily News"
        },
        "03512_0017": {
            "codes": [
                "iib1d",
                "iib1a",
                "iid1",
                "iiib2"
            ],
            "content": [
                "Ygwir. Ynerbyn. Ybyd. The truth against the world. Kymry Society of Chicago will hold its regular meeting at the Auditorium Hotel, South Parlor, Tuesday evening, January 7, 1913, at eight o’clock. Music will be furnished by Miss E. M. Jones of Evanston, Mr. Theodore Phillips and Mr. Kozakiewicz, violinist.",
                "This being the first meeting of our Society since the death of our President, Mr. D. Charles Harries, a large attendance of our members and friends is desired to show our tribute to his memory and our appreciation for the services he rendered to our Society.",
                "If you can be present please mail the enclosed postal card duly signed not later than Saturday, January 4, R. Jones Evans, Recording Secretary, 5230 Greenwood Avenue."
            ],
            "dateFull": "1899",
            "dateText": "Date Unknown",
            "dateYear": 0,
            "groups": [
                "welsh"
            ],
            "id": "03512_0017",
            "title": "[Kymry Society to Hold Meeting]",
            "topTitle": "Announcement"
        },
        "03512_0018": {
            "codes": [
                "iib1d",
                "iib1a"
            ],
            "content": [
                "The Welshmen of Chicago held a meeting last evening, as they are in the habit of doing every week, the proceedings mostly being of a literary and musical character. Amont the exercises was music by the Cambrian Choral Society, readings and recitations, and an address by Rev. Mr. Hughes. The meetings are becoming very popular among the Welsh population."
            ],
            "dateFull": "1872-10-11",
            "dateText": "Oct. 11, 1872",
            "dateYear": "1872",
            "groups": [
                "welsh"
            ],
            "id": "03512_0018",
            "title": "The Chicago Times",
            "topTitle": ""
        },
        "03512_0019": {
            "codes": [
                "iib2d"
            ],
            "content": [
                "Y Drych, published in Utica, N. Y. devotes one or two columns to the Welsh in Chicago.",
                "A Welsh paper Columbia was published in Chicago from 1888 to 1894 when it was absorbed by Y Drych.",
                "The only other Welsh newspaper in America, the Druid is published in English at Pittsburgh."
            ],
            "dateFull": "1872-10-11",
            "dateText": "Date Unknown",
            "dateYear": 0,
            "groups": [
                "welsh"
            ],
            "id": "03512_0019",
            "title": "",
            "topTitle": ""
        },
        "03512_0020": {
            "codes": [
                "iib2d"
            ],
            "content": [
                "P. 3 – Welsh newspaper, The Columbia, printed in Chicago, August, 1891- J. W. Jones, proprietor and M. A. Ellis, A. M. editor. Editorial and composing rooms at 315-317 Dearborn St. Paper, pages printed alternately in Welsh and English, devoted to general news, and social, religious, musical and literary happenings among the “Cymru”. Special correspondents maintained in all Welsh centers. Started three years earlier at Emporia, Kansas."
            ],
            "dateFull": "1891-08-19",
            "dateText": "Aug. 19, 1891",
            "dateYear": "1891",
            "groups": [
                "welsh"
            ],
            "id": "03512_0020",
            "title": "The Columbia",
            "topTitle": "Chicago Tribune"
        },
        "03512_0021": {
            "codes": [
                "iid1"
            ],
            "content": [
                "Mr. D. C. Harries",
                "1347 East 50th Street",
                "Chicago, Illinois",
                "November 19, 1921",
                "Dear Sir:",
                "As you are probably aware, the Madoc Lodge of the Ivorites intend to have a special meeting Thanksgiving Eve to celebrate the twentieth birthday of the Madoc Lodge and the committee wish to extend an invitation for a representative to convey the good wishes of your society to the now second oldest Welsh Society in Chicago.",
                "We hope to have a pleasant and interesting meeting at the Auditorium Recital Hall, November 27, at 8 P:M, and would be very pleased to have a representative of your Society with us to extend to us your felicitations for another twenty years.",
                "Yours very respectfully,",
                "R. Jones Evans",
                "P. S.",
                "Kindly let me know at once if you accept, and the name of the part representing the Society. Owing to the inevitably long program, we have to request all to be very brief in their remarks."
            ],
            "dateFull": "1921-11-19",
            "dateText": "November 19, 1921",
            "dateYear": "1921",
            "groups": [
                "welsh"
            ],
            "id": "03512_0021",
            "title": "Correspondence of Mr. D. C. Harries",
            "topTitle": ""
        },
        "03512_0023": {
            "codes": [
                "iid1"
            ],
            "content": [
                "Mr. President, members of Madoc Lodge and friends: It will not be necessary to make an apology for the short address, because it is right. As members of the Kymry Society, I extend to you our fraternal feelings on your 20th birthday, trusting you may live to enjoy twenty and even more, of success, and give the kind of helping hand to those who need it as in the past, for the record that your society has, is one to be cherished, and extended and we are with you in mind and heart and soul and will assist in its advancement. Trusting the Blessing of God may rest upon you and make you a blessing to the country."
            ],
            "dateFull": "1893-09-09",
            "dateText": "Date Unknown",
            "dateYear": 0,
            "groups": [
                "welsh"
            ],
            "id": "03512_0023",
            "title": "[Addresses Kymry Society]",
            "topTitle": "Manuscript"
        },
        "03512_0024": {
            "codes": [
                "iid1"
            ],
            "content": [
                "The Ivorites, a sick benefit and burial association was founded in April, 1893. It has two hundred members and was named for Ivor, a 12th Century Welshman who was famous for his benevolence."
            ],
            "dateFull": "1892-02-28",
            "dateText": "Date Unknown",
            "dateYear": 0,
            "groups": [
                "welsh"
            ],
            "id": "03512_0024",
            "title": "Ivorites",
            "topTitle": "Interview with J. T. Jones"
        },
        "03512_0025": {
            "codes": [
                "iid1",
                "iiic"
            ],
            "content": [
                "Of all the Welsh societies in the city the Cambrian is the oldest. It has a membership of some 2,500, but many of them are inactive."
            ],
            "dateFull": "1872-10-11",
            "dateText": "Date Unknown",
            "dateYear": 0,
            "groups": [
                "welsh"
            ],
            "id": "03512_0025",
            "title": "Interview with George Williams",
            "topTitle": ""
        },
        "03512_0026": {
            "codes": [
                "iiib2",
                "iib1a",
                "iv"
            ],
            "content": [
                "p. 3- Except for the presence of faces familiar in Chicago, one would imagine on stepping into the ladies’ ordinary of the Grand Pacific last night, that he had been transported suddenly into an Old World banquet hall. It was the social banquet of the National Cymrodorian Society, and everything was Welsh from the menu to the strange and somewhat dissonant melodies that were sung. The toasts were responded to in English. It was an unique entertainment, and one that was thoroughly enjoyed by the hundred “true-hearted sons and daughters” of Wales present.",
                "After a few remarks by the Chairman, Samuel Job, the old Welsh melody, “Nos Galan,” was sung by the Cymrodorian. It was a song too unlike anything heard in American to be soon forgotten. So also was “Llywn On,” which was sung by Mrs. Anna Lewis- Kimball. George R. Davis responded to the toast “The World’s Columbian Exposition.” D. V. Samuels spoke of “The Cymrodorian and the International Eisteddfod of 1893.” The Rev. Jenkin Lloyd Jones responded to the toast “The Press.” Miss Grace E. Jones sang the Welsh melody “Clychan Aberdyfi.” One of the most striking features of the program, however, was the harp solo “March of the Men of Harlech” by Robert Griffith. The evening closed with the national anthem “Hen Wlad Fy Whaden” sung by the guests in chorus."
            ],
            "dateFull": "1892-02-28",
            "dateText": "February 28, 1892",
            "dateYear": "1892",
            "groups": [
                "welsh"
            ],
            "id": "03512_0026",
            "title": "National Cymrodorian Society Banquet",
            "topTitle": "Chicago Tribune"
        },
        "03512_0028": {
            "codes": [
                "iiib2",
                "iib1a",
                "ic",
                "iv"
            ],
            "content": [
                "p. 4 – Senseless tumult on the Fourth of July has passed the stage of patriotism and hysterical frenzy aroused by many football games, does not consitutte sport. This opinion was handed down by Jenkin Lloyd Jones at the “Eisteddord” in Abraham Lincoln Center last evening.",
                "His opinion followed a short address, in which he spoke on the fashion in which the Welsh had preserved their national unity, and how just such “Eisteddfords”, or literary and musical entertainments, had contributed to it. He contrasted the effect with modern celebrations. The affair of last evening was under the auspices of the Kymry Society and Lincoln Center, and it is planned to make it a yearly event.",
                "Dr. D. Charles Harries acted as president and Rev. John C. Jones as conductor. Prizes for the soprano solo were divided between Miss Sally Hughes and Miss Alice Shaw. Robert Kent Thomas and J. Louis Jones divided honors in the essay comptetition. The prize for a poem was won by “David Evans”, who turned out to be Miss Evans. Miss Elizabeth C. Jones won the prize for a piano solo. W. D. Jones was the sole competitor in the Welsh reading competition and his rendition of “Gwylad y Palmwdd,” or Land of the Palms was roundly applauded."
            ],
            "dateFull": "1908-01-02",
            "dateText": "Jan. 2, 1908",
            "dateYear": "1908",
            "groups": [
                "welsh"
            ],
            "id": "03512_0028",
            "title": "Jenkin Lloyd Jones Speaks At The Ancient Eisteddford Festival",
            "topTitle": "Record-Herald"
        },
        "03512_0030": {
            "codes": [
                "iiic",
                "iiib3b",
                "iiig"
            ],
            "content": [
                "In Chicago there are 4,686 Welshmen with only 1,818 born abroad.",
                "Three Welsh parishes:",
                "Hebron Welsh Calvinistic Methodist Church (largest)",
                "2900 West Adams Street (one English service per month)",
                "Welsh Presbyterian Church (South Side Church)",
                "Princeton Avenue and West 44th Street",
                "Humboldt Park Union Church",
                "Spaulding Street near North Avenue (non-denominatonal)",
                "St. David’s day, March 1st is a Welsh festival."
            ],
            "dateFull": "1913-05-29",
            "dateText": "May 29, 1913",
            "dateYear": "1913",
            "groups": [
                "welsh"
            ],
            "id": "03512_0030",
            "title": "[Welsh Parishes in Chicago]",
            "topTitle": "Chicago Record-Herald"
        },
        "03512_0031": {
            "codes": [
                "iiic",
                "iid1"
            ],
            "content": [
                "1. What is the distinction in character between the Kymry Society and the Cambrian Society?",
                "Answer: The Kymry is a social organization; the Cambrian a benevolent organization.",
                "2. How many Welsh people are there in Chicago at present?",
                "Answer: 5,000",
                "3. Name of first Welsh church in Chicago? Denomination? Location?",
                "Answer: Hebron Church. Calvinistic Methodist. Northeast corner of Monroe Street and Sangamon Street.",
                "4. Name of any extinct churches or societies?",
                "Answer: The South Chicago Calvinistic Methodist Church",
                "5. Name of any extinct newspapers published in Chicago?",
                "Answer: The Columbia, the only one."
            ],
            "dateFull": "1872-10-11",
            "dateText": "Date Unknown",
            "dateYear": 0,
            "groups": [
                "welsh"
            ],
            "id": "03512_0031",
            "title": "Interviews with various Welshmen of Chicago",
            "topTitle": ""
        },
        "03512_0032": {
            "codes": [
                "iiic"
            ],
            "content": [
                "There are three Welsh churches in Chicago. Hebron Welsh Presbyterian is the oldest, founded at least thirty-five years ago. The other two are the Humboldt Park and South Side Church.",
                "These congregations were originally Methodist but some ten years ago voted to become Presbyterian as the American Methodists were not Calvinistic.",
                "The services in these churches are held in Welsh, with an English service generally once a month."
            ],
            "dateFull": "1892-02-28",
            "dateText": "Date Unknown",
            "dateYear": 0,
            "groups": [
                "welsh"
            ],
            "id": "03512_0032",
            "title": "Welsh Churches",
            "topTitle": "Interview with George Williams"
        },
        "03512_0033": {
            "codes": [
                "iiic",
                "ib4",
                "iv"
            ],
            "content": [
                "p. 5 – The modern church was launched yesterday afternoon at Bricklayers’ Hall. The meeting was announced for three o’clock but a number of persons, including the Rev. Jenkin Lloyd Jones, who was to deliver the address, arrived fifteen to twenty minutes before that time. They found the doors locked and Janitor Collier announced that no one had made arrangements for the hall, and that some on would have to be responsible for the rent before he would open the doors. The Rev. Mr. Jones, in the absence of the committee, volunteered, ad this difficulty was overcome. It was explained that the engaging of the hall had been left to a committee of two and that both gentlemen had been called out of the city.",
                "While the hall was filling up, L. T. O’Brien went over to the Moody Institute and secured the services of a double male quartet to lead the singing. These gentlemen supposed they were going to attend a revival meeting, and were considerably put out when they learned the character of the work; however, they remained during the service and led the singing.",
                "There was some disappointment because a larger turnout of the working people was expected. In explanation of the absence of the laborites, Mr. O’Brien said that a number of meetings were being held about the city that had been previously advertised, and which could not be postponed. He said that in the future arrangements would be made so that these meetings should not conflict with those of the Church.",
                "The Rev. Mr. Jones read Christ’s sermon on the mount and a portion of the 26th Chapter of Matthew, giving the closing scenes in the life of the Savior.",
                "Plan Of The New Church",
                "After prayer and a song, Mr. O’Brien addressed the audience. He said it was the intention in founding the modern church to erect a building which would contain in its basement bath-rooms, a gymnasium and a bowling alley. The main floor would be fitted up as a reading a writing room, the tables would be provided for games, etc. On the upper floor would be the auditorium. There would be no pastor, and no collection, and the seats would be free. Meetings would be held each Sunday, and the workers would be give the opportunity of listening to men of all thought. For the present the meetings would be held in Brick Layer’s Hall and would alternate with the Trade and Labor assembly, which meets the first and third Sundays of each month. Two weeks hence there will be a discussion between the Rev. Mr. Burch, secretary of the Ministers’ Association, and William C. Pomeroy. It has not yet been decided whether the discussion shall take place in Brick Layers’ Hall or Centenary Church.",
                "Mr. O’Brien then introduced the Rev. Mr. Jones as the speaker of the day, who took his text from the fortieth verse of the twenty-sixth chapter of Matthew: “What would ye not watch with me one hour?” He said these words were the cry of a soul for sympathy, the groan of the heart for companionship. This cry of the great Teacher in the garden was the wail of the centuries, and was the most fundamental thought of man, the highest privilege of religion to gratify. If he should be the subject of this afternoon’s thought into one word it would be sympathy.",
                "Great And Prophetic Interest",
                "The movement to establish a modern church carried with it great and prophetic interest. It indicated that the God of the Old and New Testament still lived. The church should be established on the root of sympathy. In it all prejudices should be buried. The road to sympathy was the near dear, holy road of service. The modern church should be the church of the good Samaritan – the good Samaritan brought down to the nineteenth century. The church that did not do anything in this world was not a modern church – not even an antiquity. It was a nuisance and a stumbling block, and should be put out of the way. It brought religion into disrepute.",
                "The speaker said the possibilities of the new church were almost beyong the power of description. It would make the millionaire and the beggar equal, who have an equal need of God. To fail in such an undertaking, he said, was a greater glory than to succeed with a less worthy object. In conclusion, he said: “Build on honesty, build on helpfulness, and then you build on the everlasting foundation which prophets and saints have laid in all ages.”"
            ],
            "dateFull": "1894-02-12",
            "dateText": "Feb. 12, 1894",
            "dateYear": "1894",
            "groups": [
                "welsh"
            ],
            "id": "03512_0033",
            "title": "Modern Church Open Without Creed or Pastor",
            "topTitle": "Chicago Record"
        },
        "03512_0037": {
            "codes": [
                "iiic",
                "iv",
                "iib1a",
                "iic"
            ],
            "content": [
                "p. 3 – The natal day of St. David, the patron saint of Wales, and the first Archbishop of Caerlleon, was religiously celebrated yesterday afternoon at the Cathedral of SS. Peter and Paul. The services were conducted by the Rev. J. Gwynne Jones, Pastor of the Church of the Good Shepherd, and the Cathedral was filled to overflowing with Welsh-speaking people from all sections of the city.",
                "In the opening service the responses, prayers and lessons were read in pure Keltic by the Rev. Jones, the congregation uniting in singing the popular Welsh hymn, “Bydd Myrdd o Ryffeddodan”.",
                "A liberal offering was made, which will be used in erecting a memorial in the new church to be built by the congregation of the Church of the Goo Shepherd to commemorate the life work of Dr. Goronwy Owen, a Welsh pastor and professor in William and Mary College, who lived during the eighteenth century."
            ],
            "dateFull": "1892-02-29",
            "dateText": "Feb. 29, 1892",
            "dateYear": "1892",
            "groups": [
                "welsh"
            ],
            "id": "03512_0037",
            "title": "St. David’s Natal Day Celebrated",
            "topTitle": "Chicago Tribune"
        },
        "03512_0038": {
            "codes": [
                "iiic",
                "iib1d",
                "iib1a",
                "iib2g"
            ],
            "content": [
                "The ladies of the Welsh Congregational Church give an oyster supper this evening in the rooms usually occupied by the Cambrian Literary Society. On this account the regular weekly public meeting of the Society has been postponed until Tuesday evening, the 17th, on which occasion the question, “Is the maintenance of the Welsh language a hindrance to the social advancement of the Welsh people?” will be discussed. The exercises will be varied with music and speeches on various subjects."
            ],
            "dateFull": "1872-12-10",
            "dateText": "December 10, 1872",
            "dateYear": "1872",
            "groups": [
                "welsh"
            ],
            "id": "03512_0038",
            "title": "[Welsh Language to be Discussed]",
            "topTitle": "The Chicago Times"
        },
        "03512_0039": {
            "codes": [
                "iiic"
            ],
            "content": [
                "Welsh services were held in Chicago as early as 1844 mainly in private homes.",
                "In the spring of 1850 a room was rented for services at corner of Randolph and Canal Streets. In 1851 a church was built.",
                "P. 4 – From ’55 to ’60 the church was kept up mainly by young women in service. After 1864 it could again afford a pastor.",
                "P. 5 – “The Wisconsin Synod held at Hebron, Wisconsin, October 19-21, 1900, passed a resolution inviting the church to send its pastor to all its churches to plead for financial help”. In 1902 the new church was completed. At the same time Sardis Congregational Church dissolved and join Hebron as did many members of Bethany Welsh M. E. Church.",
                "P. 6 – In 1909 the mortgage to the church was burned at a public meeting while the Cymric Club finished ice cream and cake.",
                "P. 12 – A large dish was placed on the pulpit and three widows of former deacons burned three cancelled notes before the congregation."
            ],
            "dateFull": "1893-09-08",
            "dateText": "Date Unknown",
            "dateYear": 0,
            "groups": [
                "welsh"
            ],
            "id": "03512_0039",
            "title": "[Record of Hebron Presbyterian Church]",
            "topTitle": "A Brief History of Hebron Presbyterian Church"
        },
        "03512_0041": {
            "codes": [
                "iiif",
                "iib2d",
                "iv"
            ],
            "content": [
                "Madoc ap, Owen Gwynedd, discovered a western land in 1170.",
                "Lees, Lloyds, Vaughans, Jefferson, Shelbys, Davises are Welsh.",
                "Benjamin Harris published first American newspaper in 1679."
            ],
            "dateFull": "1926",
            "dateText": "Date Unknown",
            "dateYear": 0,
            "groups": [
                "welsh"
            ],
            "id": "03512_0041",
            "title": "[Welsh Prominent in American History]",
            "topTitle": "Leaflet in Possession of the Chicago Public Library"
        },
        "03512_0042": {
            "codes": [
                "iiif"
            ],
            "content": [
                "P. 64 – Roger Williams was born in Wales, 1596. Seventeen of the signers of the Declaration of Independence were Welsh.",
                "P. 65 – Captain Jones, commander of the Mayflower, was Welsh."
            ],
            "dateFull": "1899",
            "dateText": "1899",
            "dateYear": "1899",
            "groups": [
                "welsh"
            ],
            "id": "03512_0042",
            "title": "[The Welsh in American History]",
            "topTitle": "Morgan, Rev. Vyrnwy"
        },
        "03512_0043": {
            "codes": [
                "iv",
                "iiic",
                "iia2",
                "iib1a"
            ],
            "content": [
                "Was born on a farm, March 26, 1861, Tanygraigwen, Mynytho, Caernarvonshire, Wales. Came to America in 1889 and settled in Chicago. Was field man for J. W. Snyder and Company in the same capacity from 1899 to 1913, and was with the James Shedd and Company in the same capacity from 1913 to 1922. From that time on until 1930 had his own building contractor business. In 1890 he was made Deacon at the Sardis Welsh Congregational Church. Since 1901 he has had the responsibility of supplying the pulpit of the Humboldt Park Welsh Church. His hobby is prose, poetry and music and he had three very good musical selections published to his credit. He has been a continuous contributor to the Drych and Druid for many years. By so doing, he kept the outside world in touch with his people in Chicago.",
                "He served two terms as president of Madoc Lodge, American True Order of Ivorites. Has served as Treasurer for the Cambrian Benevolent Society. Is a Mason. Married Lizzie Jones of Bethesda, South Wales, in 1891. She passed on to her reward in April, 1913. Four children were born to them. Retired. Home: 1418 North Central Park Avenue, Chicago, Illinois."
            ],
            "dateFull": "1936-12-02",
            "dateText": "December 2, 1936",
            "dateYear": "1936",
            "groups": [
                "welsh"
            ],
            "id": "03512_0043",
            "title": "Biography of Mr. John T. Jones",
            "topTitle": "Interview with Mr. John T. Jones"
        },
        "03512_0044": {
            "codes": [
                "iv"
            ],
            "content": [
                "Born in Anglesea, Wales, 1865. Came to the United States in 1888. Received A. B. at Marietta College, Ohio, 1891. Phi Beta Kappa. Student, Lane Theological Seminary, Cincinnati, Ohio, 1891-1892. University of Berlin, Germany, 1893-1895. New College, Edinburgh, Scotland, 1903-4. Received Doctor of Divinity Degree at Marietta, Ohio, 1913. At Carroll College, Waukesha, Wisconsin, 1915. Married Rachel Young of Oswego, N. Y. December 1, 1907. Ordained Presbyterian Minister, 1895. Pastor at Wellston, Jackson, Lima, Ohio. New Pastor First Church of Evanston, Illinois.",
                "Vol. 1926-1927 member Delta Upsilon, K. T. Club, University of Chicago. Home: 1427 Hinman Avenue, Evanston, Illinois."
            ],
            "dateFull": "1936",
            "dateText": "1936",
            "dateYear": "1936",
            "groups": [
                "welsh"
            ],
            "id": "03512_0044",
            "title": "David Hugh Jones",
            "topTitle": "Who’s Who in America"
        },
        "03512_0045": {
            "codes": [
                "iv"
            ],
            "content": [
                "William J. Thomas, born at Colwyn Bay, Wales. Son of James P. and Ann Parry Williams. Surgeon, occultist, aurist. Came to America in 1890. Preparatory education and high school at Williamsburg, Iowa. A. B. at State University of Iowa in 1908, also M. D. at the same University. Went to London in 1908. Studied in London, at Oxford. Studied also in Edinburgh, Vienna, Leipzig, Berlin, Leyden, Paris; receiving degrees, L. R. C. S., M. D. and F. R. C. S. in Edinburgh. Practiced in Chicago since 1919. Specializes in Ear, Nose and Throat. Professor of Ophthalmology and Otolarynology. Illinois: Post Graduate Medical School, Chicago, C. H. M. N., Eye, Ear, Nose and Throat.",
                "Captain, M. C. U. S., Mason, (32 degree Shriner) etc. Republican, Presbyterian. Clubs: Army and Navy. Recreations: Riding, motoring, fishing, literature. Home: Georgian Hotel, Evanston, Illinois, and 1604 Chicago Avenue, Evanston, Illinois. Office: 30 North Michigan Avenue."
            ],
            "dateFull": "1936",
            "dateText": "1936",
            "dateYear": "1936",
            "groups": [
                "welsh"
            ],
            "id": "03512_0045",
            "title": "William J. Thomas",
            "topTitle": "Who’s Who in America"
        },
        "03512_0046": {
            "codes": [
                "iv",
                "iib2b"
            ],
            "content": [
                "Born in Wales, June 23, 1866, son of Robert J. and Frances Humphreys Davies. Educated at the University College School, London, 1979 – 1882, University College of Wales. Married Abbie Poole of Chicago, 1912. Came to the United States of America in 1888. Began as clerk for Marshall Field and Company, 1889. Became connected with the Field Museum in 1894. Has been a director and trustee of Field Museum since March 1st, 1921. Fellow of A. A. A. A. S. Mason. Blubs: Chicago University, Midlothian.",
                "His home is located at 4933 Dorchester Avenue, Chicago."
            ],
            "dateFull": "1936",
            "dateText": "1936",
            "dateYear": "1936",
            "groups": [
                "welsh"
            ],
            "id": "03512_0046",
            "title": "David Charles Davies",
            "topTitle": "Who’s Who in America"
        },
        "03512_0047": {
            "codes": [
                "iv",
                "iiic",
                "iib1d",
                "iib2d"
            ],
            "content": [
                "Independent minister. Lecturer. Editor. Born in Cardiganshire County, South Wales, November 4. 1843. Parents moved to Wisconsin when he was an infant. He worked on their farm until 1862. Was private in the 6th Wisconsin Battery, and was three years in the Civil War. Was a graduate of Meadville, Pennsylvania Theological Seminary in 1870. Was pastor of All Souls Church, Janesville, Wisconsin. Was secretary of the Unitarian Conference for nine years. Organized, and was first secretary of, the Unitarian S. S. Society in 1878, and with others established Unity, a weekly paper, a new organ of the Congress of Religions, and has been its editor since 1879.",
                "Organized, and since 1882 has been pastor of, All Souls Church, Chicago. Secretary of the World’s Parliament of Religions in Illinois. Was its general secretary, and was president of Illinois Sate Conference of Charities. Lecturer in English extension department, University of Chicago. President of Tower Hill Summer School of Literature and Religion. Founder and first president of the Chicago Browning Society. Author of The Faith That Makes the Faithful; With William C. Gannett, 1886; Practical Piety, 1890; Word of the Spirit, 1897; Bits of Wayside Gospel, 1899; A Search for an Infidel; Bits of Wayside Gospel, 2nd Series 1901; Nuggets from a Welsh Mine, 1902. Address: 3939 Langley Avenue, Chicago, Illinois."
            ],
            "dateFull": "1936",
            "dateText": "1936",
            "dateYear": "1936",
            "groups": [
                "welsh"
            ],
            "id": "03512_0047",
            "title": "Jenkin Lloyd Jones",
            "topTitle": "Who’s Who in America"
        },
        "03512_0049": {
            "codes": [
                "iv"
            ],
            "content": [
                "Theologian. Born Liverpool, England, January 1st, 1870. Prep. Education; private school. Graduate Moody Bible Institute, Chicago, 1892. Lutheran Theological Seminary, 1896. Post Graduate course Bible Doctrine, 1900. Ph. D. Chicago Theological Seminary, University of Chicago. D. D. Wheaton Illinois College, 1906. Married Miss L. C. Torgeson of Chicago, June 25, 1902. Ordained in the ministry 1894. Pastor at Goshen, Indiana, 1895-1897. Later at Wheaton and Chicago, Illinois. Director of Bible course Moody Bible Institute, Chicago, 1901-1918. Associate Dean of Bible Institute, Los Angeles, California, 1915-1918. Director of Bible conferences for U. S. and Canada 1918.",
                "Author of Book of Books, 1902. How to Memorize, 1909. Outline Studies in Bible Books, 1909. Personal Soul Winning, 1910. Studies in the Life of a Christian, 1911. The Great Doctrines of the Bible. How to Prepare Sermons. Outline Study of the Bible. Through the Bible. (Series of 10 volumes on Bible exposition).",
                "Address: 816 North LaSalle Street, Chicago, Illinois."
            ],
            "dateFull": "1936",
            "dateText": "1936",
            "dateYear": "1936",
            "groups": [
                "welsh"
            ],
            "id": "03512_0049",
            "title": "William Evans",
            "topTitle": "Who’s Who in America"
        },
        "03512_0050": {
            "codes": [
                "iv",
                "iia3b"
            ],
            "content": [
                "Conductor. Composer. Born in Ystradgynlais, Swansea Valley, South Wales, November 24, 1866. Education at Swansea Normal College. Studied music; became Mus. Bac., Trinity College, Toronto, Canada. Became Music Doc., Grand Conservatory, New York. Won a prize in a local Eisteddfod when five years old. Became leader of Ystradgynlais Choral Society at eighteen years of age. Became very prominent as musical conductor in Wales. Came to the United States in 1866; was naturalized in 1891. Children: Helen, Daniel, Anne, Harris. Was conductor of the Scranton Cyrodorion (Welsh Friends), 1886 to 1894. Conductor of the Arion Musical Club, Milwaukee, since 1904. Was teacher of music and singing. Composer of Cantatas, songs, anthems and choruses. Republican. Presbyterian. Mason. Member of the Chicago Club. Author of Nodau Damweinol, a Welsh song book. Studio at the Fine Arts Building. Home: 5021 Dorchester Avenue, Chicago, Illinois.",
                "NOTE: Eisteddfod is a competitive meeting held to discover the talents of children, and to keep the people interested in things that are worth while. Prizes are given, for solo singing, reciting, impromptu speaking, male and mixed chorus singing, etc., also for writing poetry, essays, etc. The prize is cash and the money placed in a bag, the size of a small envelope, with a ribbon attached at two of the top corners making a loop. When the judge has made his decision, he announces the name of the winner, who goes to the platform. The judge then calls on some small girl or some prominent woman to deliver the prize, which is done by placing the loop attached to the bag around the winner’s neck. The winner then makes a bow to the awarder, then to the dignitaries on the platform, then to the audience.",
                "Daniel Protheroe, Musical Compositions",
                "(Gamble Hinge Music Company)",
                "Cantata – Mixed Voices, “Lenten at the Cross”.",
                "Cantata – Mixed Voices, “Story of Bethlehem”.",
                "Anthem – Mixed Voices, “Praise the Lord”.",
                "Response – Mixed voices, “Four Religious”.",
                "Secular – Mixed Voices, “Four Winds”.",
                "Male Voices",
                "Secular – Mixed Voices, “Castilla”.",
                "Secular – Mixed Voices, “Crusaders”.",
                "Secular – Mixed Voices, “Moorish Serenade”.",
                "Secular – Vocal Solo, “Sing Again”.",
                "Secular – Vocal Solo, “Tears and Smiles” (Ballad).",
                "Secular – Vocal Solo, “Ah! Lone But a Day”.",
                "Unison (For Children)",
                "”Dipping the Milky Way”.",
                "”The Pirates” (For Boys). Two Part Songs.",
                "Two Part Songs",
                "“The Diamond Dew”.",
                "“The Mountain Rill.”",
                "“The Sea Maidens”.",
                "”The Lamb” (Sacred).",
                "“The Lord is My Light” (Sacred”.",
                "Three Part Songs (S. S. A.) Pub. by H. T. Fitzsimons, Chicago.",
                "”Come Night”.",
                "“Good Night, Beloved”.",
                "“O, Little Town of Bethlehem,” Christmas (A Capella).",
                "”Springtime is Calling”.",
                "”Strawberry Fair”.",
                "Three Part Songs (S. A. B.)",
                "”Awake the Morning Dawns”.",
                "”Out in the Fields” (A capella ad. lib.).",
                "”Peace on the Deep”.",
                "Male Voices T. T. B. B. Pub. by H. T. Fitzsimons, Chicago.",
                "“Allah”.",
                "“Bye and Bye” (A Capella).",
                "“Daphne’s Cheeks” (A Capella).",
                "“The Grouch”.",
                "“Longing for Virginny” (A Capella).",
                "“Out in the Fields” (A Capella).",
                "“A Pep Song”.",
                "“The Pirates”, T. B. (A dashing chorus for boys).",
                "“Song of the Adventurers”.",
                "“Song of the Marching Men”.",
                "“A Song of the Road” (A Capella).",
                "“The Song of the Western Men”.",
                "Secular – Mixed Voices S. A. T. B. Pub by H. T. Fitzsimons, Chicago.",
                "”Good Night Beloved”.",
                "“Out in the Fields” (A Capella).",
                "“Song of the Marching Men”.",
                "“Seascape” (A Capella).",
                "”Mixed Voices – Sacred S. A. T. B. Pub. by H. T. Fitzsimons",
                "”Fairest Lord Jesus” (A Capella).",
                "“The Good Shepherd”.",
                "“O Jerusalem, That Bringest Good Tidings”.",
                "“O Love Divine” (A Capella).",
                "“There Shall be Night No More” (A Capella ad. lib.).",
                "“We cannot Always Trace the Way” (A Capella).",
                "Sheet Music Vocal",
                "“The Ginger Cat” (Encore Song)(Medium Voice).",
                "“Springtime is Calling” (high Voice).",
                "For Junior High, Pub. H. T. Fitzsimons, Chicago",
                "”Tea House of Sing Lo”.",
                "For the Grades. A cantata for Two Part Treble Voices.",
                "”The Spider and the Fly”.",
                "For Junior High, Pub. H. T. Fitzsimons, Chicago",
                "Sacred Cantatas for Mixed Voices.",
                "“The Garden and the Sepulchre” (Easter).",
                "“King of Kings” (Christmas).",
                "”Olivet” (Lenten).",
                "”Thanks and Praise” (Thanksgiving)."
            ],
            "dateFull": "1935",
            "dateText": "1935",
            "dateYear": "1935",
            "groups": [
                "welsh"
            ],
            "id": "03512_0050",
            "title": "Daniel Protheroe",
            "topTitle": "Who’s Who in America"
        },
        "03512_0058": {
            "codes": [
                "iv"
            ],
            "content": [
                "Born in Swansea, South Wales on July 26, 1873. Clergyman. Son of John and Mary Frances Thomas Morrison. Education: Arnold College, Aberstwyth, and University College, Cardiff, Wales. Graduate, Bangor, Maine Theological Seminary in 1898; S. T. D. Potomac University, 1909; D. D. Knox College, 1923. Married Edith Wynne Roberts of Columbus, Ohio on April 29, 1905. Children: John Hayden, Gwynfa Ruth and Mary Frances. Came to the United States in 1895, naturalized in 1911.",
                "Ordained Congregational Minister in 1898. Pastor of Thomastown Church, Akron, Ohio. 1898 to 1899 was pastor of the Washington Avenue Congregational, Columbus, Ohio. 1899 to 1907, Plymouth Church, Newark Ohio. 1907-1913 Ravenswood Congregational Church. Member of Congregational Ministers Union and Liberal Ministers Union (President), 1927-1931.",
                "Clubs: President of Wranglers from 1826-1931. Benedict Club. Mason (K T 32°). Hamilson Club, Congregational. Republican. Author of Idylls of the Beautiful, 1909.",
                "Home: 1718 Montrose Boulevard, Chicago."
            ],
            "dateFull": "1931",
            "dateText": "1931",
            "dateYear": "1931",
            "groups": [
                "welsh"
            ],
            "id": "03512_0058",
            "title": "Thomas J. Morrison",
            "topTitle": "Who’s Who in America"
        },
        "03512_0059": {
            "codes": [
                "iv"
            ],
            "content": [
                "John Thomas Llewellyn. Born Britton Ferry, South Wales, on July 7, 1863. Came to America in 1863 locating in Chicago, then moving to Milwaukee in 1869. Attended Back Bay View High School. Married Agnes, daughter of James Sheriffs in 1886. Employed in Milwaukee Works of the North Chicago Rolling Mills Company, now Illinois Steel Company. At sixteen years of age, he advanced to Assistant General Sales Agent, when the Milwaukee General Offices were moved to Chicago in 1895. In charge of the Belle City Malleable Iron Company Works, Racine, Wisconsin, from 1895-1899, of which he is now president. President of the Allied Steel Castings Company, Virginia Hotel Corporation. Trustee of Chicago Orphan Asylum. Republican. Methodist. Mason. Clubs: Chicago Athletic Association, South Shore Country Club, Midlothian Country Club.",
                "Home: 233 East Walton Place",
                "Office: 80 East Jackson Blvd."
            ],
            "dateFull": "1931",
            "dateText": "1931",
            "dateYear": "1931",
            "groups": [
                "welsh"
            ],
            "id": "03512_0059",
            "title": "John Thomas Llewellyn",
            "topTitle": "Who’s Who in America"
        },
        "03512_0060": {
            "codes": [
                "iv",
                "iia2"
            ],
            "content": [
                "p. 5 – Among Chicago’s most successful business men with Welsh ancestry is Paul Llewellyn, president of Interstate Iron Co.",
                "Mr. Llewellyn was born in Milwaukee, his father being in an executive position with the Bay View Rolling Mills. When the Illinois Steel Company was formed, the family moved to Chicago.",
                "As soon as Paul Llewellyn left school, he entered the steel business in this city, occupying important positions with the company of which his father was president.",
                "Mr. Llewellyn was elected president of The Interstate Iron & Steel Co. in 1925 upon the death of his father, Silas Llewellyn. The company now employs about 3,500 men.",
                "The Llewellyn family came from Wales in 1865, and three generations have been engaged in the steel business since that time."
            ],
            "dateFull": "1929-03-16",
            "dateText": "March 16, 1929",
            "dateYear": "1929",
            "groups": [
                "welsh"
            ],
            "id": "03512_0060",
            "title": "Paul Llewellyn",
            "topTitle": "Chicago Evening Post"
        },
        "03512_0061": {
            "codes": [
                "iv",
                "iia2"
            ],
            "content": [
                "P. 5 – As the name implies, Ernest W. J. Hughes is of Welsh ancestry, altho he has spent the greater part of his life in Chicago. He is at the head of the firm of Ernest W. J. Hughes & Co., dealers in quality first mortgage real estate bonds at 10 S. La Salle St., and now regarded as one of the leading investment houses in this city.",
                "Practically every descendant of purely Welsh parentage who has distinguished himself in Chicago, began his career as a poor boy with nothing in the way of assets except the noble ideas instilled into his mind by parents to whom the golden rule in life is always sacred; and Ernest W. J. Hughes is no exception.",
                "For more than thirty years, Mr. Hughes has been dealing in first mortgage investments in Chicago, and with him the business has reached the dignity of a science. He knows the requirements for sound investments and never offers his clients securities until they have stood every acid test which a due regard for safety can apply.",
                "There are thousands of investigators in Chicago who ask nothing more than a recommendation from Ernest W. J. Hughes before they make a bond or mortgage investment. To them that is enough.",
                "Like other educated business men, Mr. Hughes, is fond of music and art. His personality is most pleasing and once his customer always a customer, for it is soon discovered that his securities are of a high class."
            ],
            "dateFull": "1929-03-16",
            "dateText": "March 16, 1929",
            "dateYear": "1929",
            "groups": [
                "welsh"
            ],
            "id": "03512_0061",
            "title": "Ernest W. J. Hughes",
            "topTitle": "Chicago Evening Post"
        },
        "03512_0063": {
            "codes": [
                "iv",
                "iia2"
            ],
            "content": [
                "p. 5 – When Marshall Field & Co. published the Rothschild store in 1923, a Welsh name came into prominence at once. The store was name after the newly elected president and general manager, Arthur Davis, who had been with the Marshall Field & Co. for several years.",
                "Mr. Davis if of Welsh ancestry, his parents having come from Wales ancestry, his parents having come from Wales. He was born near the coal pits of Ohio, and his rise to the presidency of one of Chicago’s biggest department stores may be attributed to the splendid precepts which were family ideals in the little English principality.",
                "It is of particular interest to the Welsh people of Chicago to know that under the present management the Davis Store has experienced almost phenomenal success. Its growth is one of the romances of Chicago’s history."
            ],
            "dateFull": "1929-03-16",
            "dateText": "March 16, 1929",
            "dateYear": "1929",
            "groups": [
                "welsh"
            ],
            "id": "03512_0063",
            "title": "Arthur Davis",
            "topTitle": "Chicago Evening Post"
        },
        "03512_0064": {
            "codes": [
                "iv"
            ],
            "content": [
                "Born at Rhoos near Cardiff in 1865. Leaving Wales he came to Canada and stayed for a short time. Coming to the United States, he graduated from Brown University, Providence, Rhode Island, and in 1898 he entered the publishing business in Chicago. Later he became connected with the Sherwood Music School, and upon the death of Mr. Sherwood in 1911, took over the complete management of the school with the assistance and cooperation of his wife, Mrs. E. A. Llewellyn who has been Mr. Sherwood’s pupil.",
                "In 1913, Mr. Llewellyn organized an extension department at the school. The object of this department was to make it possible for serious students in country towns to obtain the essentials of a conservatory education in music, and to earn credentials without the expense and inconvenience of leaving home. This was accomplished by affiliating qualified and established teachers in outside communities and enrolling pupils in a course of study paralleling that given by the main school in Chicago, the studies conducted by an affiliated teacher. This course of study was in printed text form, and embraced theory lessons and annotated exercises, studies and compositions. The course was divided into eight grades, and led to a diploma. Those who wished to go further with their music and work for advanced credentials at the main school, could lay a thorough foundation at home upon which to build when they went away. While those who did not wish to go further, had acquired a good music education at home.",
                "The school has now over 1,000 affiliated teachers, with some 30,000 pupils enrolled, and working for credits. This extension plan is unique, and there is nothing like it in connection with any other school."
            ],
            "dateFull": "1929-03-16",
            "dateText": "March 16, 1929",
            "dateYear": "1929",
            "groups": [
                "welsh"
            ],
            "id": "03512_0064",
            "title": "Biography of A. J. Llewellyn, Vice-President and Manager of the Sherwood Music School",
            "topTitle": "Chicago Evening Post"
        },
        "03512_0066": {
            "codes": [
                "iv",
                "ia1a",
                "iib1a"
            ],
            "content": [
                "p. 5. No man is doing more to perpetuate the Welsh love of music and song in Chicago than A. J. Llewellyn, Vice-President and Manager of Sherwood Music School, one of America’s notable musical institutions.",
                "Mr. Llewellyn is typically Welsh, having been born at Rhoos, near Cardiff, in 1865. After leaving Wales he settled in Canada for a short time.",
                "After coming to the States he graduated from Brown University, Providence, R. I. He came to Chicago in 1898 and entered the publishing business.",
                "Later Mr. Llewellyn joined the Sherwood Music School, founded by Wm. H. Sherwood in 1895. His interest in music and in the school management soon advanced him to a position of responsibility, and upon the death of Sherwood in 1911 he was chosen Vice-President and General Manager.",
                "Mrs. E. A. Llewellyn was a pupil of Wm. H. Sherwood, and since the latter’s death has assisted her husband in the management of the school. Both Mr. and Mrs. Llewellyn have been associated with music and musicians all their lives, and under their able management the Sherwood Music School has become one of the most popular music schools in America.",
                "Both Mr. and Mrs. Llewellyn are ardent lovers of music and have the happy faculty of being able to inspire young people in musical endeavors."
            ],
            "dateFull": "1929-03-16",
            "dateText": "March 16, 1929",
            "dateYear": "1929",
            "groups": [
                "welsh"
            ],
            "id": "03512_0066",
            "title": "A. J. Llewellyn",
            "topTitle": "Chicago Evening American"
        },
        "03512_0068": {
            "codes": [
                "iv"
            ],
            "content": [
                "Born in Hirwain, South Wales, March 14, 1855. Son of Rhys W. and Margaret (Pugh) Lloyd. Was given A. B. at Marietta College 1884. In 1885 he was given the following degrees: A. M., D. D.. B. D. In 1887 graduated from the Chicago Theological Seminary. Married Miss Sarah A. Davis of Scranton, Pennsylvania, three children. Ordained as Congregational minister in 1887. Pastor California Avenue Church, Chicago, 1885-1890. Geneva Illinois, 1890-1892. Professor in New Testament. International Training School for Y. M. C. A. Secretaries of Chicago, 1892.",
                "Pastor Mills College, California, 1888-1890. First President of Chicago Christian Endeavor Union, 1890-1891. Life member of the National Christian Endeavor Society. Member Phi Beta Kappa. Delta Upsilon. Author of Baptism as Taught in the Scriptures, 1895. Historic Christ in the Letters of Saint Paul, 1896. The Best Address Ever Made. Home: 5666 Ridge Avenue, Chicago, Illinois."
            ],
            "dateFull": "1926",
            "dateText": "1926",
            "dateYear": "1926",
            "groups": [
                "welsh"
            ],
            "id": "03512_0068",
            "title": "Rhys Rees Lloyd",
            "topTitle": "Who’s Who in America"
        },
        "03512_0069": {
            "codes": [
                "iv",
                "iia2"
            ],
            "content": [
                "Born Pembroke Dock, South Wales, July 27, 1865. Son of George Edward and Elizabeth Anne\n    (Jones) Thomas. Came to America in 1870. Educated at Mosely Public School and South Division\n    High School, Chicago. Married Annie Katherine Vance of Chicago, April 16, 1906. One child.\n    Entered banking business as teller with the Commercial Loan and Trust Company, Chicago, 1891,\n    remaining as such until that company was absorbed by the Royal Trust Company. Was an assistant\n    in the Royal Trust Company in 1909. Served with the latter until 1918. Vice-president 1918-1919.\n    Resigned to join newly formed Great Lakes Trust Company."
            ],
            "dateFull": "1926",
            "dateText": "1926",
            "dateYear": "1926",
            "groups": [
                "welsh"
            ],
            "id": "03512_0069",
            "title": "John William Thomas",
            "topTitle": "Who’s Who in America"
        },
        "03512_0070": {
            "codes": [
                "iv"
            ],
            "content": [
                "Conflict in Christian\n     Belief"
            ],
            "dateFull": "1926",
            "dateText": "1926",
            "dateYear": "1926",
            "groups": [
                "welsh"
            ],
            "id": "03512_0070",
            "title": "John Morris Evans",
            "topTitle": "Who’s Who in America"
        },
        "03512_0071": {
            "codes": [
                "iv",
                "iia2"
            ],
            "content": [
                "Born Pembroke Dock, South Wales, July 27, 1865. Son of George Edward and Elizabeth Anne\n    (Jones) Thomas. Came to America in 1870. Educated at Mosely Public School and South Division\n    High School, Chicago. Married Annie Katherine Vance of Chicago, April 16, 1906. One child.\n    Entered banking business as teller with the Commercial Loan and Trust Company, Chicago, 1891,\n    remaining as such until that company was absorbed by the Royal Trust Company. Was an assistant\n    in the Royal Trust Company in 1909. Served with the latter until 1918. Vice-president 1918-1919.\n    Resigned to join newly formed Great Lakes Trust Company.",
                "Returned to the Central Trust Company of Illinois, 1921, as Vice-president. Vice-consul for\n    the Argentine Republic 1920-1921. Permanent chairman, United States Section Honduras group of\n    the Pan American Union. Served as chairman and Vice-president of the National Security League,\n    Midwest Golf and South Atlantic Commission. Assisted in bringing about the passage of the\n    Merchant Marine Act and contributed toward other matters pertaining to the advancement of our\n    foreign commerce. Alderman, City of Evanston, Illinois,\n    1920-1922. Member Chicago Association of Commerce serving as director and chairman. Republican.\n    Episcopalian.",
                "Clubs: Bankers, Chicago, Athletic Association, Country Club of Evanston.",
                "Recreations: Motoring, travel.",
                "Home: 321 Davis Street, Evanston, Illinois. Office 125 West Monroe Street, Chicago,\n    Illinois."
            ],
            "dateFull": "1926",
            "dateText": "1926",
            "dateYear": "1926",
            "groups": [
                "welsh"
            ],
            "id": "03512_0071",
            "title": "John William Thomas",
            "topTitle": "Who’s Who in America"
        },
        "03512_0073": {
            "codes": [
                "iv"
            ],
            "content": [
                "Born Milford Haven, South Wales, June 5, 189. Son of Thomas and Marie (Clay) Lloyd. Educated at English Schools and Dorchester Theological College, Oxfordshire. Musical Doctor; College of Musicians 1895. Later received the following degrees: M. A., L. TT., D. D., Intercollegiate University, D. D., Rutherford North Carolina College 1901. Married Mrs. H. B. Peabody of Chicago, February 7, 1917. Ordained Minister of the Church of England 1882. Emigrated to Canada in 1882 and held various positions. Came to America in 1893, continuing pastoral work. President Intercollegiate University; Chicago and London, Superintendent of the Grace Episcopal Parish house Chicago four years. Elected coadjutor of Oregon P. E. 1905, but declined. Resigned from P. E. ministry 1906.",
                "Ordained to ministry in American Catholic Church, June 18, 1915 and consecrated by Bishop of Illinois, December 29, 1915. Elected Archbishop and Primate, 1920. Member 48th General Assembly of Illinois 1912-1914, third Senatorial District. Was member of Curran Committee for investigating home-finding institutions of Illinois. Democrat. Editor Lloyds Church Musician Directory 1910. Church Life. (Ohio Diocesan organ) 1901-1903. Founder of the Society of Saint Phillip the Apostle for Mission preachers, 1902. Author of Two Years in the Regions of Icebergs, 1885. Also many magazine articles. Home: 44 E Schiller Street, Chicago, Illinois."
            ],
            "dateFull": "1926",
            "dateText": "1926",
            "dateYear": "1926",
            "groups": [
                "welsh"
            ],
            "id": "03512_0073",
            "title": "Frederic Ebenezer John Lloyd",
            "topTitle": "Who’s Who in America"
        },
        "03512_0075": {
            "codes": [
                "iv",
                "iia2",
                "iiid"
            ],
            "content": [
                "Born Haverfordwest, South Wales, September 19, 1860. Son of John and Sarah (Davies) Harries. Education: Haverfordwest Grammar School. Honorary A. M. Howard University, Washington, D. C. in recognition of Colonial History, L. L. D. Kentucky State University. Married Elizabeth Langley of Washington D. C., April 23, 1884. Two children: Herbert Langley Harries, Captain U. S. A., Warren Goodwin Harries, 1st Lieutenant, U. S. A. Killed in France, July 1918. President Metropolitan Railroad Company, Washington, D. C., 1895-1896. Vice-president Washington Railway and Electric Company and all participating companies in that combination, 1900 to 1911.",
                "On the staff of the vice-president, 1912, H. M. Byllesby ad Company, Chicago. Brigadier-General Commanding Militia and Navy of the District of Columbia, November 30, 1897 to May 18, 1915 by Presidential Commission. Promoted on May 18, 1915 and retired upon his own request May 26, 1915. Colonel, District of Columbia Infantry, United States Army, 1898, serving before Santiago de Cuba, during siege of that city and in the Cuban army of occupation. Serve in various positions during Indian campaigns. Was member of the War Department Board on promotion of rifle practice for many years.",
                "Brigadier-general commanding 1st Brigade Nebraska, National Guard, June 25, 1817. Brigadier-general United States Army, August 5, 1917 to September 30, 1919. Commanded successfully the 59th  Depot Brigade, 186th Infantry. Brigadier-General, 13th Corps, 2nd French Army. Base section number 5, A. E. F., 173rd Division Infantry. Brigadier-general, Chief of United States Mission, Berlin, Germany, December 3, 1918 to September 30, 1919. Brigadier-general, Officers’ Reserve Corps, December 28, 1920 to May 1921, General Artillery, September 16, 1924. Awarded distinguished service medal in the army and distinguished service medal in the navy.",
                "Commander Legion D’Honeur (for construction and operation of Fort Brest, etc) was also decorated by eight other European Governments for military service. Was vice-president of the Board of ducation, Washington, District of Columbia 1895 to 1903. President of Washington D. C. Board of Trade 1910-1911. National Commander, Order of Indian Wars, United States 1912. Commander-in-Chief Military Order of World War 1920-1925, declining further re-election. Vice-president Society Army of Santiago de Cuba, 1925. Fellow American Institute of Electrical Engineering. President of the American Electrical Railway Association 1912-1913. Associated with Edison Illuminating Companies 1911-1912. Illuminating Engineers Society 1920-1921. Member American Society Mechanical Engineers, National Electric Light Association, American Gas Institute, Western Society Engineers, etc.",
                "Republican. Methodist. Clubs: Army-Navy, National Press Club, Washington, D. C., Union League Club of Chicago, Mid-day Club of Chicago, President Army and Navy Club of Chicago, Recess (N. Y.) Home: Army and Navy Club, Washington, D. C., also 231 South LaSalle St., Chicago, Illinois."
            ],
            "dateFull": "1925",
            "dateText": "1925",
            "dateYear": "1925",
            "groups": [
                "welsh"
            ],
            "id": "03512_0075",
            "title": "George Herbert Harries",
            "topTitle": "Who’s Who in America"
        },
        "03512_0078": {
            "codes": [
                "iv"
            ],
            "content": [
                "Born Castletown, Isle of Man, Great Britain, July 13, 1844. Son of John Quirk and Katherine (Watterson) Jones. Educated at King William College and Douglas School of Science, Isle of Man. Married Susan Warren Wilbur of Oak Park, Illinois. Formerly with the Publication Department of A. C. McClurg and Company. On the staff of The Dial, and a contributor to The Public, Editor of Friday Literary Review, and the Chicago Evening Post since May 1914. Member, Chicago Little Theatre. Lecturer on literary topics.",
                "Unitarian. Clubs: Chicago, Literary, Cliff Dwellers. Wrote introduction to the Chicago Anthology in 1916. Home: 5455 Woodlawn Avenue. Office: 12 South Franklin Street."
            ],
            "dateFull": "1917",
            "dateText": "1917",
            "dateYear": "1917",
            "groups": [
                "welsh"
            ],
            "id": "03512_0078",
            "title": "Llewellyn Jones",
            "topTitle": "Who’s Who in America"
        },
        "03512_0079": {
            "codes": [
                "iv"
            ],
            "content": [
                "Born in Wales, June 23, 1866. Son of Robert Joseph and Francis (Humphreys) Davies. Educated at University College School, London, England. University of Wales at Aberstwyth. Came to America in 1888. Married Abbie Stuart Poole of Chicago, December 18, 1912.",
                "Began as clerk for Marshall Field and Company, 1889-1894. Became connected with the Field Museum of Natural History February, 1894, and until his passing away was assistant secretary, auditor and recorder. Was a Mason. Was a member of the Windsor Golf Club.",
                "Home: 6835 Chappel Avenue, Chicago, Illinois."
            ],
            "dateFull": "1917",
            "dateText": "1917",
            "dateYear": "1917",
            "groups": [
                "welsh"
            ],
            "id": "03512_0079",
            "title": "David Charles Davies",
            "topTitle": "Who’s Who in America"
        },
        "03512_0080": {
            "codes": [
                "iv",
                "if5"
            ],
            "content": [
                "Born Caernarrion, Wales, May 25, 1882. Son of Daniel H. and Annie Williams. Came to the United States in 1887. Educated in the public school, Minneapolis, Minnesota. L. L. B. Chicago Kent College of Law. 1907 Post Graduate course Northwestern University Law School. Married 1908.",
                "Associated in practice with Master in Chancery, Guerin, 1907-8. Later went into partnership with M. Guerin and Oliver R. Barrett. Practiced alone since 1916. Secretary to C. W. Wrigley and Company. President, Maxwell Laughlin Company. Member of the American, Illinois State and Chicago Bar associations. Member of the Chicago Republican Convention 1916. Regional Director of Republican Clubs, National Committee, 1920.",
                "Presbyterian. Mason: Oriental Consistory, Medinah Temple; Mystic Shriner. Clubs:",
                "Illinois Athletic, Yacht Club, Delta Chi, Chicago, Three Score and Ten Club, president.",
                "Home: 51 E. Division Street, Chicago, Illinois.",
                "Office: 7 South Dearborn Street, Chicago, Illinois."
            ],
            "dateFull": "1917",
            "dateText": "1917",
            "dateYear": "1917",
            "groups": [
                "welsh"
            ],
            "id": "03512_0080",
            "title": "Edenfed H. Williams",
            "topTitle": "Book of Chicagoans"
        },
        "03512_0081": {
            "codes": [
                "iv"
            ],
            "content": [
                "Born Aberstwyth, South Wales, September 23, 1885. Son of Joseph and Margaret (Davies) Jones. Educated British School and National School. Graduate Bala Theological College, North Wales, 1882. Post graduate work in Liverpool University, one year. D. D. Ripon, Wisconsin, 1911.",
                "Married Elizabeth Wigley of Judson, Minnesota, October 9, 1885. Wife died March 1890. Children: Robert Jones, Elizabeth Jones (Mrs. Elmer Roberts of Chicago). Married second time to Alice Williams of Chicago, January 1895. Began preaching in Wales, 1877, at Welsh Calvinistic Methodist Church.",
                "Came to the United States in 1883. Pastor at Mankato, Minnesota, 1884 to 1888. Pastor at Minneapolis, Minnesota, 1889 to 1894. Came to Chicago February, 1894 to Hebron Church. This church was erected at 2900 West Monroe Street, Chicago, at a cost of $36,000.",
                "Moderator General of Calvinistic Assembly 1913-1916; collected $105,600 for missions in sixteen months, 1914-1916. Republican. Member of Cambrian Benevolent Society. Mason. Kymry Society of Chicago.",
                "Home: 3011 Warren Avenue, Chicago, Illinois."
            ],
            "dateFull": "1917",
            "dateText": "1917",
            "dateYear": "1917",
            "groups": [
                "welsh"
            ],
            "id": "03512_0081",
            "title": "(Biography)",
            "topTitle": "Book of Chicagoans"
        },
        "03512_0083": {
            "codes": [
                "iv",
                "iib2d",
                "iib2d",
                "iia3b",
                "ia1a",
                "iib1c"
            ],
            "content": [
                "With T. Solomon Griffiths, Prof. Apmadoc edited Welsh periodicals, Blodau’r Oes, The Drych and Cambrian, all published in Utica.",
                "Translated and set to music Shelley’s “Indian Serenade”, and several others. For twenty-two years he conducted singing at All Souls Church, conducted Eisteddfod at Panama Exposition, and supervised Department of Music in Chicago Pubic Schools.",
                "Born in Wales 1844, came to United States in 1864, went to Chicago at time of Columbian World’s Fair."
            ],
            "dateFull": "1916-08-16",
            "dateText": "Aug. 16, 1916",
            "dateYear": "1916",
            "groups": [
                "welsh"
            ],
            "id": "03512_0083",
            "title": "Prof. Wm. Apmadoc",
            "topTitle": "Utica Daily Press"
        },
        "03512_0084": {
            "codes": [
                "iv",
                "iib1a"
            ],
            "content": [
                "Professor Wm. ApMadoc came to Chicago from Utica in 1890, conducted Eisteddfods at Buffalo and St. Louis Expositions, also concert exercises of Royal National Eisteddfod of Wales in 1906 and was musical director of the National Peace Congress in 1909."
            ],
            "dateFull": "1916-08-13",
            "dateText": "Aug. 13, 1916",
            "dateYear": "1916",
            "groups": [
                "welsh"
            ],
            "id": "03512_0084",
            "title": "Prof. Wm. Apmadoc",
            "topTitle": "Chicago Record-Herald"
        },
        "03512_0085": {
            "codes": [
                "iv"
            ],
            "content": [
                "Born Swansea, South Wales, August 2nd, 1864. Son of Rees and Ann (Morris) Harris. Came to America in 1874. Education: private and public schools and business college. Married in Chicago, June 24, 1894 to Harriet A. Aurlelius. Three children. His mother passed away when he was nine years of age and his father when he was thirteen.",
                "Entered the employ of the Pullman Loan and Savings Bank, September 10, 1890 as collector, and has served as Bank Teller, Chief Clerk and Cashier, November 1902 to February 1909. Cashier Roseland State and Savings Bank since 1909. Treasurer of the Arcade Mercantile Company, Director Roseland Safety Deposit Company, The Pullman Trust and Savings Bank.",
                "Republican. Mason. Member of Hamilton and West Pullman Country Club. Residence: 12034 Yale Avenue. Office 11500 South Michigan Avenue."
            ],
            "dateFull": "1911",
            "dateText": "1911",
            "dateYear": "1911",
            "groups": [
                "welsh"
            ],
            "id": "03512_0085",
            "title": "David John Harris",
            "topTitle": "Book of Chicagoans"
        },
        "03512_0086": {
            "codes": [
                "iv"
            ],
            "content": [
                "Born November 16, 1857, Montgomeryshire, Wales. Son of Edward and Jane (Powell) Evans. Educated in schools in Wales. Married Elizabeth Jones at Racine Wisconsin, September 1883, four children. Came to America in 1880. Has been identified with manufacturing ornamental glass. Had his own business in Kansas City, 1884-1890. Came to Chicago and with C. L. Rawson, organized the firm of Rawson and Evans, which continued until the passing away of Mr. Rawson in 1905, with the business was incorporated as Rawson Evans and Company, of which he has been president and treasurer.",
                "Republican. Methodist. Recreations: Hunting and fishing. Residence. Oak Park. Office: 710 Washington Boulevard, Chicago."
            ],
            "dateFull": "1911",
            "dateText": "1911",
            "dateYear": "1911",
            "groups": [
                "welsh"
            ],
            "id": "03512_0086",
            "title": "Samuel Evans",
            "topTitle": "Book of Chicagoans"
        },
        "03512_0087": {
            "codes": [
                "iv"
            ],
            "content": [
                "Born July 27, 1861 at Rhyl, North Wales. Education: Grammar School graduate; one year private school. Came to the United States in 1882. Naturalized in 1882. Married. Has four children. Was employed by Thomas O’Brien, building contractor. From 1887 to 1893 was in business as Roberts and Myddleton Company, contracting, plastering and decorating. From 1893 to 1894 was superintendent for Smith and Eastman Company, Decorators, at St. Louis World’s Fair. From 1894 to 1904 was superintendent for Myddleton and Company, Decorators. Retired in 1928.",
                "Presbyterian. Republican. Ivorite. Treasurer Welsh Male Choir. Hebron Mixed Choir. (Gymanfa Ganu) Singing Festival. Eistedfodd which was carried on by the Welsh people for fifteen years prior to 1932. Hebron Presbyterian Church.",
                "Hobbys: music and baseball.",
                "Home: 635 South Scoville Avenue, Oak Park, Illinois."
            ],
            "dateFull": "1917",
            "dateText": "Date Unknown",
            "dateYear": 0,
            "groups": [
                "welsh"
            ],
            "id": "03512_0087",
            "title": "Autobiography of Mr. John Myddleton",
            "topTitle": "Interview, with Mr. John Myddleton (retired)"
        },
        "03512_0088": {
            "codes": [
                "iv"
            ],
            "content": [
                "Born 1863 at Rhyl, North Wales. Graduate of grammar school, one year of private school. Came to Chicago in 1885; naturalized in 1887. Married and has two daughters. Was superintendent for Lennox and Alderman, Contractors, from 1885 to 1889. Was in partnership as Myddleton Roberts, 1889 to 1894.",
                "From 1894 to 1903 was superintendent for Lennox-Alderman. During 1903 was superintendent for Smith-Eastman Contractors on St. Louis World’s Fair Buildings. Went into the contracting business as Myddleton and Company in 1904 and has been operating as such since.",
                "Mason, 32 degree Shriner.",
                "Clubs: Medinah Country; Lake Shore Club; Glenn Oak Golf Club.",
                "Republican.",
                "Home: 5669 Washington Boulevard, Chicago, Illinois. Phone: Mansfield 2440."
            ],
            "dateFull": "1929-03-16",
            "dateText": "Date Unknown",
            "dateYear": 0,
            "groups": [
                "welsh"
            ],
            "id": "03512_0088",
            "title": "Autobiography of Mr. Edward B. Myddleton",
            "topTitle": "Interview, with Mr. Edward B. Myddleton (retired)"
        },
        "03512_0089": {
            "codes": [
                "iv"
            ],
            "content": [
                "Born November 1870, Chicago. Son of David and Ruth Thomas Jones. Married Mary Jane Rees in Chicago, June 18, 1895. Four children. Education: Chicago Public School; High school; Manual Training. Went with Marshall Jackson Company in 1890. Became secretary in 1901, upon reorganization of Marshall Jackson Company in 1904; was made secretary and director; was made treasurer in 1911 and vice-president in 1914 and president in 1922. Former member of Board of Education, La Grange, Illinois. Secretary and director of the Chicago Industrial League.",
                "Camp Gray Forward Movement. Republican. Presbyterian. Mason. K. T. Shriner. Member Union League Club, La Grange Country. Recreations: Music and Golf.",
                "Home: 56 South Spring Avenue, La Grange, Illinois."
            ],
            "dateFull": "1929-03-16",
            "dateText": "Date Unknown",
            "dateYear": 0,
            "groups": [
                "welsh"
            ],
            "id": "03512_0089",
            "title": "Biography of Mr. J. Harry Jones (Deceased)",
            "topTitle": "Interview, with Mrs. J. Harry Jones"
        },
        "03512_0090": {
            "codes": [
                "iv",
                "iia3b"
            ],
            "content": [
                "“Kynles Fair” (Impressions of a Welsh Village).",
                "“Coming to the Fair” (Dod ir Fair).",
                "“A Love Song” (Can Serch).",
                "“Ah, Well-A-Day” (The Old Ballad Singer).",
                "“The Tumbler” (Billy Sambo).",
                "Words by Kate Foreman."
            ],
            "dateFull": "1916-08-13",
            "dateText": "Date Unknown",
            "dateYear": 0,
            "groups": [
                "welsh"
            ],
            "id": "03512_0090",
            "title": "Secular Vocal Music",
            "topTitle": ""
        },
        "03512_0091": {
            "codes": [
                "iv",
                "iia3b"
            ],
            "content": [
                "“Mary’s Treasures, Christmas Song,”",
                "(Words by Hugh Aikin)",
                "“The Trees and the Master,”",
                "(Poem by Sidney Lanier)",
                "Also published for mixed and male voices.",
                "“Raining” (S. A. B.)"
            ],
            "dateFull": "1916-08-13",
            "dateText": "Date Unknown",
            "dateYear": 0,
            "groups": [
                "welsh"
            ],
            "id": "03512_0091",
            "title": "Sacred Songs",
            "topTitle": ""
        },
        "03512_0092": {
            "codes": [
                "iv"
            ],
            "content": [
                "Born in Portland, Oregon, 1891. Came to Chicago 1894. Education: Chicago Grammar School; High School; Y. M. C. A: North Western School of Commerce; Chicago Kent College of Law, graduated with degrees of L. L. B. and L. L. M. Married, one child. Specializes in Patents and Trade Marks. Member of Chicago Bar Association. Patent Law Association of Chicago. American Legion Advertizing Men’s Post. Was President of the Kymry Society of Chicago two years. Mason. Presbyterian. Republican.",
                "Office: 6 North Michigan Avenue – Room 1402. Residence: 843 North Harvey Avenue, Oak Park, Illinois."
            ],
            "dateFull": "1911",
            "dateText": "Date Unknown",
            "dateYear": 0,
            "groups": [
                "welsh"
            ],
            "id": "03512_0092",
            "title": "Autobiography of Mr. Ap. Trevor Jones, Jr.",
            "topTitle": "Interview, with Mr. Ap. Trevor Jones, Jr."
        },
        "03512_0093": {
            "codes": [
                "iv"
            ],
            "content": [
                "Born in Caernarvon, Wales in 1868; had graduate school education. Came to the United States in 1888. Settled in Pennsylvania. Came to Chicago in 1893. Naturalized in 1895. Is the founder of the Western State Company at 326 South Aberdeen Street, Chicago.",
                "The roof the the Chicago University and blackboards were finished by the Western State Company. Presbyterian. Republican. Mason. Business operated by son now at the above address.",
                "Home: 639 South Elmwood Avenue, Oak Park, Illinois."
            ],
            "dateFull": "1917",
            "dateText": "Date Unknown",
            "dateYear": 0,
            "groups": [
                "welsh"
            ],
            "id": "03512_0093",
            "title": "Biography of Mr. Owen Huxley Jones",
            "topTitle": "Interview, with Mr. John S. Jones"
        },
        "03512_0094": {
            "codes": [
                "iv"
            ],
            "content": [
                "Dr. David J. Jones, Chicago city physician, had his own private practice from 1911 to 1923. Appointed city physician in 1923 and was such until 1927; from 1927 to 1933 again private practice. 1933 to 1936 City of Chicago physician, - Congregational Church – has had all branches of Masonry (32 degree Shriner).",
                "Home: 6101 North Washtenaw Avenue.",
                "Office: Room 111, City Hall, Chicago, Illinois."
            ],
            "dateFull": "1905",
            "dateText": "Date Unknown",
            "dateYear": 0,
            "groups": [
                "welsh"
            ],
            "id": "03512_0094",
            "title": "Interview, with Mr. David J. Jones",
            "topTitle": ""
        },
        "03512_0095": {
            "codes": [
                "iv"
            ],
            "content": [
                "Born near Cardiff, South Wales, August 19, 1848. Son of W. B. and Emma A. Davis. Education: Public school in South Wales. Married to Amy Carlett, 1878. Learned trade in Wales. Came to America in 1882, settling in St. Paul, Minnesota. Came that year to Chicago and engaged in the manufacture of fine cabinet work, afterward adding the building contracting business. Organized the Reginald J. Davis Company in 1900, and was president and director. This company operates three factories for high class cabinet work, and did contract work of the Railway Exchange Building, Chicago, also the new First National Bank Building; Marshall Field Annex to Retail Stores; Heyworth Building and other structures.",
                "Independent in politics. Royal Arch Mason. Office: Railway Exchange Building. Residence: 945 South Sawyer Avenue."
            ],
            "dateFull": "1905",
            "dateText": "1905",
            "dateYear": "1905",
            "groups": [
                "welsh"
            ],
            "id": "03512_0095",
            "title": "Reginald John Davis",
            "topTitle": "Who’s Who in America"
        },
        "03512_0096": {
            "codes": [
                "iv"
            ],
            "content": [
                "Born in Sumersetshire, England, May 22, 1861. Son of Rev. Lewis and Mary Ann Joanna (Rutt) Llewellyn. Educated at Stony Gate Grammar School, Leicester England. Married Alberta Cook in Cannon Falls, Minnesota in 1887. Four children.",
                "Was articled apprentice to Gimson and Company, Engineers, Leicester, England, 1876 to 1882. Designing Engineer, Midland Railway and Carriage and Wagon Company, Schrewsbery, England, 1882-1884. Travelled 1884 to 1885, then became chief engineer for the Gillette Herzog Manufacturing Company, Minneapolis, Minnesota. In 1893 the plant was moved to West Pullman, Illinois. In 1902 was organized as International Harvester Company and became its vice-president.",
                "Republican. Methodist. Member of the Union League Club. Office: 7 West Monrie Street. Home: Evanston, Illinois."
            ],
            "dateFull": "1905",
            "dateText": "1905",
            "dateYear": "1905",
            "groups": [
                "welsh"
            ],
            "id": "03512_0096",
            "title": "Frank J. Llewellyn",
            "topTitle": "Book of Chicagoans"
        },
        "03512_0097": {
            "codes": [
                "iv"
            ],
            "content": [
                "Born Penygroes, South Wales, May 1, 1845. Song of Hugh Jones. Educated in Wales until 1857. Came to America, settled in Columbia, Wisconsin in 1858. Married Elizabeth Owen; two children.",
                "Worked on farm in Wisconsin until 1865. Became agent for Dodge Reapers and Champion Mowers, Berlin, Wisconsin, 1866-1868. Became travelling salesman for L. J. Bush and Company, Milwaukee Wisconsin, 1868-1870. Employed by E. H. Gammon and William Deering, 1870-1881. With E. H. Gammon established the Plano Manufacturing Company at Plano, Illinois, becoming its president, 1885-1890. Vice-president and chief engineer until 1900. Sold out to the American Bridge Company in 1900. Became president of the Koken Iron Works at St. Louis, Missouri.",
                "In 1901 he became assistant vice-president and contracting manager of the American Bridge Company of New York. Since 1901 Director of the International Bond and Development Company; World Today Company. Trustee and Treasurer of the University of Chicago Divinity School. Member American Society of Chemical Engineers. Clubs: Chicago Athletic, Quadrangle, Homewood Country. Office: Monadnock Block, Chicago. Home: 6033 Jefferson Avenue."
            ],
            "dateFull": "1905",
            "dateText": "1905",
            "dateYear": "1905",
            "groups": [
                "welsh"
            ],
            "id": "03512_0097",
            "title": "William Hugh Jones",
            "topTitle": "Book of Chicagoans"
        },
        "03512_0099": {
            "codes": [
                "iv",
                "iib1c1"
            ],
            "content": [
                "When a boy of seventeen, Professor ApMadoc translated two acts from Sheridan’s “Pygaro”, adapted the same for the stage and trained the actors for a performance that proved to be a fine success."
            ],
            "dateFull": "1929-03-16",
            "dateText": "Date Unknown",
            "dateYear": 0,
            "groups": [
                "welsh"
            ],
            "id": "03512_0099",
            "title": "Prof. Wm. ApMadoc",
            "topTitle": "The Music News"
        },
        "03512_0100": {
            "codes": [
                "iv"
            ],
            "content": [],
            "dateFull": "1929-03-16",
            "dateText": "Date Unknown",
            "dateYear": 0,
            "groups": [
                "welsh"
            ],
            "id": "03512_0100",
            "title": "",
            "topTitle": ""
        }
    },
    "dates": [
        {
            "1899": [
                "03512_0000",
                "03512_0001",
                "03512_0002",
                "03512_0003",
                "03512_0042"
            ],
            "1894": [
                "03512_0004",
                "03512_0033"
            ],
            "1891": [
                "03512_0006",
                "03512_0016",
                "03512_0020"
            ],
            "1893": [
                "03512_0008",
                "03512_0010",
                "03512_0011",
                "03512_0012",
                "03512_0013",
                "03512_0015"
            ],
            "0": [
                "03512_0017",
                "03512_0019",
                "03512_0023",
                "03512_0024",
                "03512_0025",
                "03512_0031",
                "03512_0032",
                "03512_0039",
                "03512_0041",
                "03512_0087",
                "03512_0088",
                "03512_0089",
                "03512_0090",
                "03512_0091",
                "03512_0092",
                "03512_0093",
                "03512_0094",
                "03512_0099",
                "03512_0100"
            ],
            "1872": [
                "03512_0018",
                "03512_0038"
            ],
            "1921": [
                "03512_0021"
            ],
            "1892": [
                "03512_0026",
                "03512_0037"
            ],
            "1908": [
                "03512_0028"
            ],
            "1913": [
                "03512_0030"
            ],
            "1936": [
                "03512_0043",
                "03512_0044",
                "03512_0045",
                "03512_0046",
                "03512_0047",
                "03512_0049"
            ],
            "1935": [
                "03512_0050"
            ],
            "1931": [
                "03512_0058",
                "03512_0059"
            ],
            "1929": [
                "03512_0060",
                "03512_0061",
                "03512_0063",
                "03512_0064",
                "03512_0066"
            ],
            "1926": [
                "03512_0068",
                "03512_0069",
                "03512_0070",
                "03512_0071",
                "03512_0073"
            ],
            "1925": [
                "03512_0075"
            ],
            "1917": [
                "03512_0078",
                "03512_0079",
                "03512_0080",
                "03512_0081"
            ],
            "1916": [
                "03512_0083",
                "03512_0084"
            ],
            "1911": [
                "03512_0085",
                "03512_0086"
            ],
            "1905": [
                "03512_0095",
                "03512_0096",
                "03512_0097"
            ]
        }
    ],
    "codes": [
        {
            "ib4": [
                "03512_0000",
                "03512_0002",
                "03512_0033"
            ],
            "ic": [
                "03512_0001",
                "03512_0028"
            ],
            "iiia": [
                "03512_0001"
            ],
            "iia3b": [
                "03512_0002",
                "03512_0050",
                "03512_0083",
                "03512_0090",
                "03512_0091"
            ],
            "vb": [
                "03512_0002"
            ],
            "iib1a": [
                "03512_0003",
                "03512_0004",
                "03512_0006",
                "03512_0008",
                "03512_0010",
                "03512_0011",
                "03512_0012",
                "03512_0013",
                "03512_0015",
                "03512_0017",
                "03512_0018",
                "03512_0026",
                "03512_0028",
                "03512_0037",
                "03512_0038",
                "03512_0043",
                "03512_0066",
                "03512_0084"
            ],
            "iib2d": [
                "03512_0003",
                "03512_0008",
                "03512_0019",
                "03512_0020",
                "03512_0041",
                "03512_0047",
                "03512_0083",
                "03512_0083"
            ],
            "iv": [
                "03512_0003",
                "03512_0016",
                "03512_0026",
                "03512_0028",
                "03512_0033",
                "03512_0037",
                "03512_0041",
                "03512_0043",
                "03512_0044",
                "03512_0045",
                "03512_0046",
                "03512_0047",
                "03512_0049",
                "03512_0050",
                "03512_0058",
                "03512_0059",
                "03512_0060",
                "03512_0061",
                "03512_0063",
                "03512_0064",
                "03512_0066",
                "03512_0068",
                "03512_0069",
                "03512_0070",
                "03512_0071",
                "03512_0073",
                "03512_0075",
                "03512_0078",
                "03512_0079",
                "03512_0080",
                "03512_0081",
                "03512_0083",
                "03512_0084",
                "03512_0085",
                "03512_0086",
                "03512_0087",
                "03512_0088",
                "03512_0089",
                "03512_0090",
                "03512_0091",
                "03512_0092",
                "03512_0093",
                "03512_0094",
                "03512_0095",
                "03512_0096",
                "03512_0097",
                "03512_0099",
                "03512_0100"
            ],
            "iiic": [
                "03512_0004",
                "03512_0025",
                "03512_0030",
                "03512_0031",
                "03512_0032",
                "03512_0033",
                "03512_0037",
                "03512_0038",
                "03512_0039",
                "03512_0043",
                "03512_0047"
            ],
            "iib1d": [
                "03512_0006",
                "03512_0017",
                "03512_0018",
                "03512_0038",
                "03512_0047"
            ],
            "iiih": [
                "03512_0006",
                "03512_0008",
                "03512_0011",
                "03512_0012"
            ],
            "iib1c": [
                "03512_0008",
                "03512_0010",
                "03512_0011",
                "03512_0012",
                "03512_0013",
                "03512_0015",
                "03512_0016",
                "03512_0083"
            ],
            "iib1e": [
                "03512_0008"
            ],
            "iid1": [
                "03512_0017",
                "03512_0021",
                "03512_0023",
                "03512_0024",
                "03512_0025",
                "03512_0031"
            ],
            "iiib2": [
                "03512_0017",
                "03512_0026",
                "03512_0028"
            ],
            "iiib3b": [
                "03512_0030"
            ],
            "iiig": [
                "03512_0030"
            ],
            "iic": [
                "03512_0037"
            ],
            "iib2g": [
                "03512_0038"
            ],
            "iiif": [
                "03512_0041",
                "03512_0042"
            ],
            "iia2": [
                "03512_0043",
                "03512_0060",
                "03512_0061",
                "03512_0063",
                "03512_0069",
                "03512_0071",
                "03512_0075"
            ],
            "iib2b": [
                "03512_0046"
            ],
            "ia1a": [
                "03512_0066",
                "03512_0083"
            ],
            "iiid": [
                "03512_0075"
            ],
            "if5": [
                "03512_0080"
            ],
            "iib1c1": [
                "03512_0099"
            ]
        }
    ],
    "values": [
        "welsh"
    ]
}