{
    "items": {
        "5423972_10_1_1306": {
            "codes": [
                "iv"
            ],
            "content": [
                "The 50th jubilee of the Yiddish poet, Aaron Heller, was very successful. The hall was filled to capacity with friends and followers of Mr. Heller.",
                "There was also a concert, and a truly Jewish spirit prevailed through the evening. At this affair Mr. Heller received a gift - a loving cup and a bouquet of flowers."
            ],
            "dateFull": "1908-10-26",
            "dateText": "Oct. 26, 1908",
            "dateYear": "1908",
            "groups": [
                "yiddish"
            ],
            "id": "5423972_10_1_1306",
            "title": "For Aaron Heller",
            "topTitle": "Daily Jewish Courier"
        },
        "5423972_2_0358": {
            "codes": [
                "ib4",
                "iiic"
            ],
            "content": [
                "We are informed that the Sinai Congregation has resolved to abolish all the Hebrew prayers with the exception of Sheman and Borchoo, from their ritual. This congregation worships according to Minhag Einhorn, but from time to time new reforms are introduced. So has the reading of the weekly portion of the Torah been cut down to only a few verses which are selected by the Rabbi ad libitum and neither the three nor the seven yearly cycle is strictly followed."
            ],
            "dateFull": "1884-05-30",
            "dateText": "May 30, 1884",
            "dateYear": "1884",
            "groups": [
                "yiddish"
            ],
            "id": "5423972_2_0358",
            "title": "[Certain Hebrew Prayers Abolished]",
            "topTitle": "Occident"
        },
        "5423972_2_1446": {
            "codes": [
                "ic"
            ],
            "content": [
                "We do not know whether we should attribute it to the Blaine boom, to the cool summer, or to the awakening of the still small voice within the manly bosom of the learned editor of the Chicago Tribune.",
                "Of late we notice that the whip which used to hang in the sanctum of that great daily journal and which every fresh and young reporter and even the old sinners used to snatch up once in a while, roll up their sleeves and slash away at the poor Jew, has either been consigned to the garret or was delivered into the safe-keeping of one of the campaign reporters to use it for a while on the backs of the representatives of the great Democratic Party. The Tribune even went so far as to copy an article from the Boston Herald which is rather friendly to our people."
            ],
            "dateFull": "1884-06-20",
            "dateText": "June 20, 1884",
            "dateYear": "1884",
            "groups": [
                "yiddish"
            ],
            "id": "5423972_2_1446",
            "title": "The Chicago Tribune and the Jews",
            "topTitle": "The Occident"
        },
        "5423972_5_0336": {
            "codes": [
                "iia3d",
                "iid6"
            ],
            "content": [
                "Tonight is the first performance at the new Metropolitan Theatre for the benefit of the Jewish Shelter. The theatre is located at Jefferson and O'Bryan streets.",
                "The well known masterpiece Ben-Hador will be played. All Jews of Chicago should do their utmost in order to get these tickets, so that Father Abraham's Hotel would profit the most, for they are in dire need of funds.",
                "The Jewish Shelter is the only Jewish institution which has at all times open doors for the hungry and homeless Jews. In order to exist they must have money. Their expenses are enormous, their income is insignificant.",
                "The perpetuation and maintenance of this shelter is greatly dependent upon tonight's and tomorrow's performances. Help us continue the noble work of the Home. Remember tonight is the benefit for the Jewish Shelter!"
            ],
            "dateFull": "1908-10-26",
            "dateText": "Oct. 26, 1908",
            "dateYear": "1908",
            "groups": [
                "yiddish"
            ],
            "id": "5423972_5_0336",
            "title": "This Evening for the Jewish Shelter",
            "topTitle": "Daily Jewish Courier"
        },
        "5423972_7_0345": {
            "codes": [
                "iid6"
            ],
            "content": [
                "Last Monday a meeting of all painters of the city of Chicago was held at the Hebrew Institute.",
                "Dr. Fishkind thanked the painters of Chicago for their noble undertaking, that of painting the Hebrew Institute gratis.",
                "The meeting was conducted to the satisfaction of the officers. An offer of eighty-five days of work for the Institute was the high light of this meeting.",
                "The Painters' Aid Society has taken a very active part in this movement and it is to be hoped that the undertaking will be a success.",
                "A committee was sent out to obtain necessary materials. Work will begin in the near future.",
                "All those who wish to make contributions of time or materials should contact Mr. Lipson at 254 Washburn Avenue, or Mr. Morgolis at 587 W. 13th Street."
            ],
            "dateFull": "1908-10-25",
            "dateText": "Oct. 25, 1908",
            "dateYear": "1908",
            "groups": [
                "yiddish"
            ],
            "id": "5423972_7_0345",
            "title": "For the Hebrew Institute",
            "topTitle": "Daily Jewish Courier"
        },
        "5423972_9_1_1114": {
            "codes": [
                "iiic",
                "ic"
            ],
            "content": [
                "At 6 o'clock last Friday evening (8-22-84), the Northside Hebrew Congregations dedicated their new temple. The temple is situated on the northeast corner of Rush Street and Walton Place. The edifice is built of white stone and the architecture is in the Gothic style. A few broad stairs lead to the front entrance of the temple. The interior of the temple is very plain but pleasant. There are no loud colors, no red paint and no gold stripes which make some of our temples look like butcher shops or theatres. An elegant carpet of a bright pattern covers the floor, the seats are of polished cherry-wood and oron ha kodesh (The Holy Arc of the Covenant), and the pulpit of black walnut."
            ],
            "dateFull": "1884-08-29",
            "dateText": "Aug. 29, 1884",
            "dateYear": "1884",
            "groups": [
                "yiddish"
            ],
            "id": "5423972_9_1_1114",
            "title": "Dedication of the New Temple of the Northside Jewish Congregation",
            "topTitle": "The Occident"
        }
    },
    "dates": [
        {
            "1908": [
                "5423972_10_1_1306",
                "5423972_5_0336",
                "5423972_7_0345"
            ],
            "1884": [
                "5423972_2_0358",
                "5423972_2_1446",
                "5423972_9_1_1114"
            ]
        }
    ],
    "codes": [
        {
            "iv": [
                "5423972_10_1_1306"
            ],
            "ib4": [
                "5423972_2_0358"
            ],
            "iiic": [
                "5423972_2_0358",
                "5423972_9_1_1114"
            ],
            "ic": [
                "5423972_2_1446",
                "5423972_9_1_1114"
            ],
            "iia3d": [
                "5423972_5_0336"
            ],
            "iid6": [
                "5423972_5_0336",
                "5423972_7_0345"
            ]
        }
    ],
    "values": [
        "yiddish"
    ]
}